{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 16, "totalParentCommentsFound": 649, "totalEditorsSelectionFound": 16, "depthLimit": 0, "totalRecommendationsFound": 658, "comments": [{"approveDate": "1478600744", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625943", "permID": "20392449", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Warrenton VA", "parentID": null, "userDisplayName": "silver bullet", "commentTitle": "<br/>", "commentBody": "This election season has shown the moral decay of the Republican party. In the selection of its standard bearer and encouraging his rambling tirades against large demographics of American society, the GOP has abandoned all pretense at effective, democratic government. The party is threatening more obstruction if their candidate loses tonight's election, with more oversight committee hearings for Hillary Clinton, a refusal to give a fair hearing to any Supreme Court nominee by any Democratic president and possible impeachment proceedings against the Secretary if she is elected president. The GOP obstructed President Obama for eight years and now proposes to shut down the judicial branch of government unless a Republican president can nominate a Supreme Court justice. MItch McConnell, Paul Ryan, John McCain, Jason Chaffetz and an endless list of Republicans in the Senate and House represent the ugliness and dysfunction of American government today.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7591/1032/cropped-75911032.jpg", "createDate": "1478597527", "commentID": 20392449, "userID": 75911032, "recommendations": 699, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20392449}, {"approveDate": "1478600780", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625950", "permID": "20392521", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Galveston, Texas", "parentID": null, "userDisplayName": "Thomas", "commentTitle": "n/a", "commentBody": "I disagree. I think what the 2016 presidential race has shown is the exact opposite.  <br/><br/>Almost every poll is showing that Mrs. Clinton is going to win. So, given that, let us ask ourselves what this election year has taught us.<br/><br/>It has taught us that:<br/>(1) hate doesn't sell. After eight years of democrats being in power, this year was supposed to be an easy win for the republicans. But then comes along Mr. Trump with his hate messages, making the prospect of a republican win almost impossible.<br/>(2) Economic anxiety can not be the cause of Mr. Trump's rise because unemployment rate is currently at it's lowest rate it has been in many years. Gas prices are below $2.20 nationally, housing markets are in a healthy shape, and most of Trump's supporters are making above average  income.<br/>(3) The media may enable extreme candidates to flourish,  but the media can destroy them too. What led to the demise of Mr. Trump was the exposure of Trump's tax avoidance by the New York Times, and the release of his sexual prowess tape by the Washington Post.<br/>And (4) globalization is here to stay. Had it not been for globalization, most of us wouldn't be able to shop at wal-mart and still have some money left over.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478599176", "commentID": 20392521, "userID": 76552752, "recommendations": 214, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20392521}, {"approveDate": "1478601247", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625938", "permID": "20392643", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Waltham, MA", "parentID": null, "userDisplayName": "Christine McMorrow", "commentTitle": "<br/>", "commentBody": "What a sobering editorial.  Its first point hit me right between the eyballs--\"Hate Sells.\"  <br/><br/>God almighty.  Hate not only sells, it convinces.  It has convinced millions of disenfranchised voters that a con man can solve their every problem and fulfill their every need.  Couldn't Trump have made these points without dragging in racial bigotry, conspiracy  theories, and idiotic resentments?<br/><br/>And yet: the man they projected their hopes on couldn't help them if he tried.  Not only does he offer no solutions (unlike his opponent who has fleshed out policies and costs for retraining workers in changing industries), his quest for power is just that: a quest for personal power.  <br/><br/>Donald J. Trump hasn't the faintest  idea how to resolve the jobs problem in places like Michigan and Pennsylvania.  He began his campaign as a lark. fed his ego in rallies, and has shown in word and deed his unfitness for political office.<br/><br/>As for the media: shame on most of you.  Even this paper, which I read faithfully, was remiss--both in reporting on Trump's business history and covering the success of Bernie Sanders.  By these omissions, it too helped fan the flames of resentment.<br/><br/>But TV in all forms is the most guilty of all, with its ability to cover big-screen events.  By treating politics more as entertainment--with farcical debates and  breathless, endless coverage of sexual escapades and ethnic slurs--it kept the ugliness going.<br/><br/>What a relief it's ending.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2073/520/cropped-2073520.jpg?0.18587254704312467", "createDate": "1478601193", "commentID": 20392643, "userID": 2073520, "recommendations": 844, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20392643}, {"approveDate": "1478604427", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625941", "permID": "20392906", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charleston, SC", "parentID": null, "userDisplayName": "walterhett", "commentTitle": "<br/>", "commentBody": "We saw a candidate who sexual assaulted 12 to 17 women, ogled nude teenagers, bragged about his prowess, (silent about his wife's full spread nudes), insultingly claim his accusers too unglamorous for his advances--suffer no consequences, despite collaboration of the claims from friends/family/co-workers.<br/><br/>We witnessed the Ku Klux Klan endorse a Republican. We watched the FBI muddle the election, through leaks and breaks in protocol and procedures. We were astonished to see the KKK endorsement seconded by the Russian press! <br/><br/>Daily, we observed democracy severely undermined and extremism divide the country as policies were proposed that cast the constitution and separation of powers aside. (The Muslim ban; the wall.)<br/><br/>We have heard a litany of \"rigged/rigged/rigged\" before the vote! On evry topic, we are told lies that defy the facts. For every policy, for every incident or slight (often tweeted at 3 am!) <br/><br/>We noticed the voices of millions (30 to 40 million on twitter alone!) of women ignored, as Muslim women shared their voices and achievements and women shared their angst about assaults by posting their first recollected incidents. We heard Michelle Obama.<br/><br/>We heard the twisted logic of racism applied to a federal judge; we observed the deceptive strategy of racism use to appeal to white voters (assured blacks were cordoned in a \"living hell.\"<br/><br/>We witnessed pathology over policy, and innuendo and blame over truth and honesty. Today we vote. We pass or fail.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3360/5332/cropped-33605332.jpg", "createDate": "1478604422", "commentID": 20392906, "userID": 33605332, "recommendations": 769, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20392906}, {"approveDate": "1478609521", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478609521", "permID": "20393564", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 28, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NC", "parentID": null, "userDisplayName": "A", "commentTitle": "n/a", "commentBody": "I've seen many close friends and families split over this election, and then I thought of the last time families were so divided  - the Civil War. How strange. How sad.<br/><br/>This is what we have come to. That is who we are now.<br/><br/>Heartbreaking.<br/><br/>This is a mess, and I fear it won't get any better after the election. Hillary will win and Trump supporters will not be as gracious as Gore supporters were in 2000- an election which actually was stolen. Some are already talking 2nd amendment solutions, while the Republicans are vowing to keep Congress tied up with impeachment and investigations.<br/><br/>I am so disgusted, I waiver back and forth between standing ground, trying to make the facts heard and walking away. Simply give in to the inclination to crawl into my home, and stop talking to anyone... for a long time.<br/><br/>Maybe my sons are right - maybe we do need a revolution.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478609381", "commentID": 20393564, "userID": 52068757, "recommendations": 326, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20393564}, {"approveDate": "1478612257", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625946", "permID": "20393938", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "PA", "parentID": null, "userDisplayName": "Mary", "commentTitle": "<br/>", "commentBody": "The hate came from one side, yet that is the side that dominated the news. Trump states allegations as \"facts\" and then non-thinking people just accept them as facts.  Journalists never asked enough questions, never pressed on the issues, they got caught up in the flurry of outrageous claims.  We would  have been better served by news media that asked questions.  As it is, the false equivalence of \"Hillary is a liar because she was investigated\"  dogged her campaign, unfairly.   Meanwhile, journalists dropped the demand for the tax returns and financial history of a candidate who proposes to hide his business dealings and not disclose his potential conflicts of interest.  It's outrageous. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478611171", "commentID": 20393938, "userID": 30315546, "recommendations": 373, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20393938}, {"approveDate": "1478612272", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625952", "permID": "20393971", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 18, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Baltimore", "parentID": null, "userDisplayName": "Fred White", "commentTitle": "<br/>", "commentBody": "Ed Rendell, my favorite Democrat after Bernie, gave Hillary very wise advice this morning: Go on a listening tour of the angry white working-class areas where you are hated, and then craft policies which will help these people specifically as much as you can. If Hillary actually does that, instead of performing in office as the puppet of Goldman I and other Bernie supporters logically assume she will be, she can truly be a great president. If, however, she uses identity politics as a cloak of fake virtue over her actual policies favoring the rich over the lower classes of all races, like Bill Clinton's, she will be an absolute disgrace. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478611299", "commentID": 20393971, "userID": 37480815, "recommendations": 192, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20393971}, {"approveDate": "1478612289", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625944", "permID": "20394100", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "North Carolina", "parentID": null, "userDisplayName": "Joseph C Bickford", "commentTitle": "<br/>", "commentBody": "As a retired person and a political junkie I have watched a lot of the the coverage of the campaign and have been astonished at the free time given to Trump, as well as the absence of any serious decission of issues. Just this pastg week CNN has given a short story about the assault on Mosul, but very little explanation of the issues involved. The media still thinks elections are horse races and entertainment, and seem to encourage the public to think they are right. I have also been astonished at the tv's treating Trump as a legitimate candidate which he was not. Then there's the Republican Party; a moral swamp. Good God, what a time we live in!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478611860", "commentID": 20394100, "userID": 58558081, "recommendations": 418, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20394100}, {"approveDate": "1478612296", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625948", "permID": "20394054", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cc", "parentID": null, "userDisplayName": "A", "commentTitle": "<br/>", "commentBody": "I just got to vote for the first female major party candidate for president. She is smart and beyond qualified. I left the voting booth in happy tears, so proud to be part of this historic moment. Yes, there may be ugly things in this election, but the fact that 100 years after women got the right to vote that we and our husbands, fathers, brothers and children can vote for a woman - it's pure beauty.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478611621", "commentID": 20394054, "userID": 10068287, "recommendations": 297, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20394054}, {"approveDate": "1478615888", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478626026", "permID": "20395140", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Jack  Chicago", "commentTitle": "<br/>", "commentBody": "What 2016 has taught me is that I cannot rely on press coverage to inform me about the candidates in a thoughtful, reasoned and reliable way.  But most of all the element of honesty has been lost. Candidates bend the truth, it's in the nature of politics. This time around bare-faced lying has not been called out and one candidate was allowed and even encouraged to call for the imprisonment of his competitor. This ugly mess cannot be unseen. The question is even if we escape the worst outcomes of this election, how do we recover any sense of dignity or respect in our political system?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3741/1144/cropped-37411144.jpg?0.301885875640437", "createDate": "1478615861", "commentID": 20395140, "userID": 37411144, "recommendations": 152, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20395140}, {"approveDate": "1478616370", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478626034", "permID": "20395303", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "hen3ry", "commentTitle": "<br/>", "commentBody": "The elections preceding the Civil War were fairly ugly as was the conduct in Congress itself.  The only difference is that they didn't have instant communications so things that happened in DC took a little bit longer to make it back to the states.<br/><br/>2016 showed us the culmination of the GOPs consistent calling out of racial stereotypes to create fear and anger, their willingness to use any tactic to win even if that tactic involves hurting Americans (literally or otherwise) who do not agree with them or fit their idea of a real American.  2016 debates were not about the issues facing America.  They were about Trump. Clinton had to answer back because if she left it alone the media would use it against her.<br/><br/>The blame for this election cycle goes to the parties and the media. The parties, especially the GOP, didn't focus on the issues of health care, wages, global warming, our failing infrastructure, or how they plan to improve things for all Americans.  In fact the biggest message that came out of the GOP campaign was that the only Americans that counted were the ones who supported GOP candidates.  If a candidate cannot serve those who elected him and those who didn't she has no business running in the first place.  The same for a candidate who plays coy about losing.<br/><br/>And after all this there's a country to govern.  I hope that it's still governable by whoever wins because it's our country, not the GOPs or the Democrats.  They work for us and it's time they remember that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478616358", "commentID": 20395303, "userID": 12443097, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20395303}, {"approveDate": "1478620408", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478620408", "permID": "20394768", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Clinton, NY", "parentID": null, "userDisplayName": "dmdaisy", "commentTitle": "<br/>", "commentBody": "We have also learned that the educational system has not done an adequate job of teaching critical thinking or the history and strategies of propaganda.  The tragic decline in public  school funding across the nation, especially in states such as Kansas and Louisiana, must be undone.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478614450", "commentID": 20394768, "userID": 57792969, "recommendations": 254, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20394768}, {"approveDate": "1478621339", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478621339", "permID": "20396561", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Mohammad Qadeer", "commentTitle": "<br/>", "commentBody": "Undoubtedly economic anxiety is major concern of people. But it is much more wide spread than the inequality and joblessness experienced by the poor and workers. The apparently prosperous suburbanites and  professionals are also affected by it in the form of uncertain job security, shedding of pension benefits and health insurance.Their existence in precarious. A typical home owner in the US lives under the threat of homelessness  as her job/business can disappear in an instant. This new phase of finance-led capitalism and global movement of  opportunities have to be regulated. Careers and not just jobs have to be restored.  Editorialist should rise above right-liberal world views of economy. This is what Trump tapped.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478621089", "commentID": 20396561, "userID": 63334420, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20396561}, {"approveDate": "1478622490", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478626085", "permID": "20396902", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "switzerland", "parentID": null, "userDisplayName": "j. von hettlingen", "commentTitle": "<br/>", "commentBody": "The 2016 elections have taught us how divided America is. But the high turnout shows that Americans do care who will determine the fate of their nation in the coming four years. Perhaps they fear what an impact a Trump presidency would have on the US and the wider world. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6486/7739/cropped-64867739.jpg?21038317081094072451", "createDate": "1478622433", "commentID": 20396902, "userID": 64867739, "recommendations": 37, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20396902}, {"approveDate": "1478625702", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478625702", "permID": "20396923", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Capital University", "parentID": null, "userDisplayName": "Thomas Hobbs", "commentTitle": "<br/>", "commentBody": "The thing about Trump in this race is that all he did was make it okay people who act and think like him to come and be their true selves. It isn't like with the birth of Trump in this race, also came the birth of ignorant, racist, misogynistic, egotistical, white supremacist Americans. They have been around for years, all Trump did was give them the platform and the arena in which to voice their opinions. We should not be shocked at that fact, people who have hate in their hearts have been around for centuries and will more than likely always be around. What 2016 should have showed us is how undeniably attached to our political affiliations we are in today's society. it is no longer about be right or wrong or doing what is best for our country but opposing one another, and I say this more about Republicans than Democrats. The die hard's, those who have been apart of the GOP for decades refuse to see the benefits of either voting for Hilary or abstaining from the presidential vote at all. The fact that someone could be an accused rapist, a sexual assaulter, a hater of women, blacks, those of lower socioeconomic standings, the mentally and physically ill and still get the vote of decent Republicans is baffling to me. It isn't because they don't oppose him and what he says but the fact that under his name is Republican party candidate that he still can get the vote. what 2016 has taught me is that political affliation is more important than what is best for the country.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478622538", "commentID": 20396923, "userID": 74031805, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20396923}, {"approveDate": "1478631078", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478631078", "permID": "20398848", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "Former Geek", "commentTitle": "<br/>", "commentBody": "Why does no one seem to be looking at the underlying institutional issues?<br/><br/>Less than 40 (Cook says 37) of the 538 Congressional seats in this election are  contested.  This partisan gerrymandering has lead to the phenomena we have seen in recent years -- unfunded or underfunded contenders for the vast majority of the seats, \"safe\" incumbents unable to govern and compromise as they are more indebted to their party than to their constituents and  worry only about fighting off primary challenges. <br/><br/> Does my vote for my local Congressional representative \"count?\"  Not  if I'm in one of the 501 uncontested districts.<br/><br/>And then there are other issues like Citizens United, campaigns for judges, and an unrepresentative primary system. <br/><br/>We need to look at the underlying problems in our flawed government if we are to understand 2016,", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478630474", "commentID": 20398848, "userID": 11888098, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20398848}], "totalEditorsSelectionReturned": 16, "replyLimit": 3, "totalRecommendationsReturned": 16, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1146, "api_timestamp": "1488822333", "totalReplyCommentsFound": 497, "totalCommentsReturned": 16, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}