{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 16, "totalParentCommentsFound": 273, "totalEditorsSelectionFound": 17, "depthLimit": 0, "totalRecommendationsFound": 385, "comments": [{"approveDate": "1465989867", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081881", "permID": "18848730", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lake Station, Indiana", "parentID": null, "userDisplayName": "Josh Weinstein", "commentTitle": "<br/>", "commentBody": "The Republican Party has blood on it's hands. They would like everyone to believe this is was the act of a radical Muslim terrorist, but guess what? The shooter was born in the USA. He grew up here, not in a Muslim country. He is a natural born US citizen, not an immigrant. <br/><br/>He grew up in a country where Republican leaders have always used the gay community as a scapegoat, blaming us for everything they fell is wrong with this country. They make anti-gay speeches, pass anti-gay laws and send the message to people like the shooter that it is OK to hate gay people. <br/><br/>And this is the result. No doubt Republicans would dispute this, saying they have no responsibility for it, but they do. I'm sorry, but you don't get to use gay rights as a wedge issue to win elections and enact anti-gay laws and spread hatred through the politics of fear and then distance yourself from it when it ends in a tragedy like this. They created the atmosphere of hatred and intolerance. They own it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465978657", "commentID": 18848730, "userID": 72214290, "recommendations": 582, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18848730}, {"approveDate": "1465990487", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466080831", "permID": "18849282", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Deep Red South", "parentID": null, "userDisplayName": "David Gregory", "commentTitle": "<br/>", "commentBody": "Politicians take these positions because way too many Americans are uninformed, uneducated and unwilling to listen to facts or reason. Somebody is electing the craven politicians unwilling to take a stand for what is right and what is just and certain institutions are actively enabling them.<br/><br/>Maybe we should all stop being polite and call out the houses of worship and the various faith groups that still teach that being Gay, Lesbian, Bisexual, Transgendered or Queer identified is a sin against the wishes of a vaporous god. This being summer, Churches running Vacation Bible School are picking up children all over America and taking them to classes where they are being fed this doctrine today and tonight. Not all VBS groups are of the churches teaching this, but more than a majority are.<br/><br/>The politicians are merely representing the people who sent them. The Churches that expose these things have blood on their hands just as they did when many sat aside during the Civil Rights Movement and did nothing. The modern apologies of the Southern Baptist Convention and others do not offset the century plus where they actively taught doctrine that supported Slavery and Jim Crow. Likewise, many are still teaching of gay therapy like what was practiced at Exodus International. I was raised in the Baptist Church  and know this all too well.<br/><br/>Before politics change the hearts of America must change. Sadly, too many faith groups are fighting that change.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3000/6326/cropped-30006326.jpg?711136243625463747", "createDate": "1465989116", "commentID": 18849282, "userID": 30006326, "recommendations": 305, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849282}, {"approveDate": "1465991451", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081752", "permID": "18849491", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rehoboth beach, DE 19971", "parentID": null, "userDisplayName": "David Gifford", "commentTitle": "<br/>", "commentBody": "All of this proves the case that it is not religious people whose freedoms need protecting but the remainder of us who need our freedoms protected from religion. Time and time again we see tragedies perpetrated by people of faith. The 1990's Freedom of Religion act needs to be thrown out. There was never any reason for it. It should be replaced by a law guaranteeing freedom from religion, as the founding fathers meant, when they wanted to decrease the influence of any church in the politics of this great country. How far we have strayed from that initial intent.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465990731", "commentID": 18849491, "userID": 53905383, "recommendations": 399, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849491}, {"approveDate": "1465991562", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081070", "permID": "18849113", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Jeff", "commentTitle": "<br/>", "commentBody": "While the arguments for gay rights and the recognition of anti-gay attitudes is well stated, this unfortunate massacre does not appear to feed into that narrative. Neither does the notion that this was an ISIS-esque attack. Instead, the perpetrator (by all accounts) was a gay man who could not accept his identity. This appears to be a psychologically maladjusted individual who, perhaps by virtue of being raised in an intolerant religious family, projected his self-hatred onto others. His illness is not reflective of the anti-gay biases that seek to obstruct gay marriage and has nothing to do with the absurd bathroom controversy. To use this man's perverted acts as a means to argue for gender neutral bathrooms or immigration bans on Muslims is self-serving. These events, like the killings in Newton, argue for the need to keep weapons of all kinds out of the hands of the mentally ill. We need a better system to identify and treat violently ill sociopaths before they act. This is the real lesson.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465987609", "commentID": 18849113, "userID": 63599195, "recommendations": 136, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849113}, {"approveDate": "1465991655", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081190", "permID": "18849559", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fauquier County, VA", "parentID": null, "userDisplayName": "Thin Edge Of The Wedge", "commentTitle": "<br/>", "commentBody": "I doubt there are many LGBT Americans deluded enough to think there is anything the GOP, the political party of hate, or Trump, its hater in chief, ever have or ever would do to protect and promote the safety and equality of LGBT citizens. Trump, who would appoint a Scalia clone or three to the Supreme Court, would cheerfully roll back equal marriage rights. The only person whose rights he cares about are his own. He's in the pocket of the NRA, and will do zero to stop the spread weapons of mass death because, for Trump, it's all about votes from the gun fetishists of the right wing. The tragedy in Orlando is just another golden opportunity for Trump to sell his brand of Islamophobia and propel himself into the White House. Shut your trap, Trump. No one wants to hear your self promoting clap trap during this terrible time.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465991115", "commentID": 18849559, "userID": 68057259, "recommendations": 174, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849559}, {"approveDate": "1465991860", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465988260", "permID": "18849446", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CA", "parentID": null, "userDisplayName": "RB", "commentTitle": "<br/>", "commentBody": "This was not a terrorist attack. To be so it would need to be inspired by a common ideology. The killer named a number of groups/individuals on whose behalf he was committing his crimes--several of which are in direct opposition. He was clearly ignorant of their ideological underpinnings. His associations simply make no sense unless you want to ascribe to the line supported by Trump that this is all about Muslims and Islam and they all Muslims pose a threat. Nonsense.<br/><br/>His one constant driver was clearly hatred against the LGBT community. Whether that was the result of his own inner demons as reports have suggested, or the hatred inspired by religious teachings, it is clear he was mentally unstable and that what he committed was a hate crime against the LGBT community--not a terrorist act. It's an important distinction that our political leaders are refusing to make outright lest they be branded as soft on terrorism.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465990464", "commentID": 18849446, "userID": 8614189, "recommendations": 155, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849446}, {"approveDate": "1465991996", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1466081626", "permID": "18849007:18849613", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Beliavsky", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": 18849007, "userDisplayName": "Mike NYC", "commentTitle": "<br/>", "commentBody": "Why do they oppose gay marriage? Because at heart they feel LGBT people are not enough of their cloth and are in fact inferior beings. While most people opposed to equality are not physically violent, many nevertheless engage in gleeful character assassination of LGBT people and seek to destroy their peace of mind via their endless harangues and misguided policies. Killing the soul is not a far cry from killing the body and gives incentive to those who would do both.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465991494", "commentID": 18849613, "userID": 38291930, "recommendations": 99, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849613}, {"approveDate": "1465997789", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081232", "permID": "18850088", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "GMHK", "commentTitle": "<br/>", "commentBody": "The sadness for the loss of life in Florida is overwhelming. No one should ever be singled out because of who they are and abused, persecuted or murdered. Every individual should feel safe and free from harm. Therefore, it is so unfortunate, but so NYTs, to use their bully pulpit to continually push their political agenda for LGBT advocacy on the back of the tragic situation in Orlando. One can, even a politician, feel with deep sadness, the senseless loss of life, without supporting and condoning the LGBT lifestyle.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4663/5774/cropped-46635774.jpg?0.36978373280726373", "createDate": "1465994112", "commentID": 18850088, "userID": 46635774, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18850088}, {"approveDate": "1465997995", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081389", "permID": "18849868", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "PeterS", "commentTitle": "<br/>", "commentBody": "We will never fully know why Mr. Mateen choose LGBT community as a target but he probably grew up learning that homosexuals are an offense to god and is a deadly sin punishable by death. From where do we learn our prejudices? The typical sources are our parents, schools, and houses of worship. Mr. Mateen will always be responsible for his murders. However, his community must also search deep in its own soul. I am sure that they do not advocate murder and terrorism. However, by designating a group of people as sinners or as genetically or morally inferior, you strip them some of their humanity. If you do that often enough, impressionable people will see these \"others\" as animals, inhibition to kill crumbles, and wholesale slaughtering becomes possible. This is the origins of mass murders from small ones like these recent shootings to horrific large scale genocide committed by Mr. Hilter. This is also why Mr. Trump is so toxic. As a presidential nominate and an authority figure, he tells us that we should be proud of our own biases based on race, religion, and gender. We should be free to loudly advocate our bigoted views because we should be \"authentic\" and not be constrained by \"political correctness.\" Mr. Mateen's community has a role in the destruction of Omar and over 50 innocent people. If Mr. Trump has his way, many more people will be hurt. The irony is that we don't even know if Mr. Trump believes in any of what he says except to win.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465992898", "commentID": 18849868, "userID": 50973161, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18849868}, {"approveDate": "1466000890", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465997290", "permID": "18850494", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Denver", "parentID": null, "userDisplayName": "aurora", "commentTitle": "<br/>", "commentBody": "Some of the posts here comment that the motives have more to do with a psychologically imbalanced individual than societal homophobia. Regardless of whether you agree with that (I don't), we all need to be aware that this incident has sparked an outpouring of homophobia in many places. Examples: Westboro Baptist Church leaders (famed for protests at the funerals of gay service members) say the shooter was sent by God.\\<br/><br/>Second, aA pastor in California praised the deaths, but said gays should be sentenced to death by due process. See article here:<br/><br/><a href=\"https://www.washingtonpost.com/news/acts-of-faith/wp/2016/06/14/pastor-refuses-to-mourn-orlando-victims-the-tragedy-is-that-more-of-them-didnt-die/\" title=\"https://www.washingtonpost.com/news/acts-of-faith/wp/2016/06/14/pastor-refuses-to-mourn-orlando-victims-the-tragedy-is-that-more-of-them-didnt-die/\" target=\"_blank\">https://www.washingtonpost.com/news/acts-of-faith/wp/2016/06/14/pastor-r...</a><br/><br/>Third, in the apartment building where I live in Denver, a group of people was heard celebrating the deaths of gays in Orlando. When I discussed this with a gay friend who lives here, he said, \"I am not surprised.\" The battle against hatred is far from over, and the tragedy in Orlando feeds into it, no matter how you interpret it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465995834", "commentID": 18850494, "userID": 61568267, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18850494}, {"approveDate": "1466001575", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081738", "permID": "18850796", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco, CA", "parentID": null, "userDisplayName": "J. Grant", "commentTitle": "<br/>", "commentBody": "The hatred that certain Americans have in their hearts towards the LGBTQ community is tragic and irrational.  Our lives and our loves ought to be of no concern to such people.  And yet, a vicious backlash to the Supreme Court's Obergefell same-sex marriage ruling continues to manifest itself through corrosive \"religious freedom\" and \"gender bathroom\" legislation.  In addition, an individual can still be fired in over half of our states because of his or her sexual orientation.  We desperately need to send representatives to Washington, D.C. who reject \"identity politics\" so that we can continue to move forward in achieving equal rights for all Americans. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465997133", "commentID": 18850796, "userID": 32934683, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18850796}, {"approveDate": "1466002214", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465998635", "permID": "18851138", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "JJ", "commentTitle": "<br/>", "commentBody": "Donald Trump changed his position from pro-choice to pro-life in a New York minute when it became clear that he could get votes by doing so. Expect the same from him on marriage equality and LGBT rights.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465998596", "commentID": 18851138, "userID": 69376901, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18851138}, {"approveDate": "1466003695", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466000095", "permID": "18852229", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Johnson City, Tenn.", "parentID": null, "userDisplayName": "G. Sears", "commentTitle": "<br/>", "commentBody": "Even in the face of such a horrendous slaughter of Americans, this editorial is over the top.<br/><br/>America is both hopefully and painfully in the of extraordinary social change and reformation in a sexual revolution that far transcends what has occurred largely incrementally since the 1960s. Major changes have occurred in response to the L.G.B.T. movement for legal protections and rights. Certainly more remains to be done. The presumption that America will somehow now transition easily or quickly to a state of universal L.G.B.T. acceptance, support, and agreement is fundamentally unreasonable and utopian delusion.<br/><br/>“While the precise motivation for the rampage remains unclear, it is evident that Mr. Mateen was driven by hatred toward gays and lesbians.”<br/><br/>The precise motivation? In none of the awful litany of mass shootings in the last two decades have the precise motivations been deciphered. As for Mateen’s hatred, it is evident that it had no bounds, he evidently intensely hated just about every one and everything including himself. <br/><br/>Either attempting to divine his motivations or to make pat assertions about why he chose the particular setting for his rampage is a kind of exploitation of grievous tragedy to make the strongest possible point about a host of other L.G.B.T. issues. It is an unseemly and unnecessary rush to judgement. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6452/7736/cropped-64527736.jpg?0.5053697326220572", "createDate": "1466002554", "commentID": 18852229, "userID": 64527736, "recommendations": 36, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18852229}, {"approveDate": "1466003757", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466003214", "permID": "18851143", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Ray", "commentTitle": "<br/>", "commentBody": "Despite what this article infers, the cause of this massacre is very simple: institutional Isalmic hatred for gay. True, some governors are resisting an arbitrary ruling that men be allowed to use women's bathrooms, based on systemic problems with enacting that dictate. That is not the same as throwing gay people off buildings. This is exactly what drives so many people crazy: an attempt to distract from true evil, by deflecting the conversation into some sort of broader social or political discussion about how we're all to blame. We're not. It's certainly not GOP leaders that caused this incident, since the shooter was reportedly a registered Democratic Party voter. The target here is clear: institutional Islamic hatred for gays. Straying from that topic perpetuates the problem. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465998607", "commentID": 18851143, "userID": 4039053, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18851143}, {"approveDate": "1466004135", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081424", "permID": "18852025", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fayetteville, Ark.", "parentID": null, "userDisplayName": "ttrumbo", "commentTitle": "<br/>", "commentBody": "'Hate crimes don’t happen in a vacuum. They occur where bigotry is allowed to fester, where minorities are vilified and where people are scapegoated for political gain.' This statement is central to many, if not most, of the mass shootings and bombings we've seen in this country over the last few decades. The 'hate radio' and other marketing tools push anger as a way to catch and gain listners and advertiser dollars from (or if the message is just right-wing promotion, maybe it's financing is not a problem) the populace. 'Hate' radio, hating so much, of so many, at such cost.<br/>   This 'hate' may just anger and politically motivate some, but it may also push others into a state of madness. Whether a call to attack Americans for religious reasons, or a more muted call to 'contain' the spread of liberalism and 'shared bathrooms', the perpetrators of violently-tinged speech stoke the fires of base, emotionalism aimed at demonizing others (while seeing ourselves as good and decent, God-fearing and 'protectors' of America).<br/>   Time to be stronger and more committed to love and compassion and unity. This also must be a political movement; for far too many of our politicians today are there because of their financing by the few, the powerful interests, the marketers of hate and anger as a means of acquiring and holding political power.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466001837", "commentID": 18852025, "userID": 40651927, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18852025}, {"approveDate": "1466005522", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466081856", "permID": "18851162", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Astoria, NY", "parentID": null, "userDisplayName": "Dominic", "commentTitle": "<br/>", "commentBody": "As a LGBT American, you are never allowed to forget how little you fit in, or how grudgingly at best you are accepted in this country. It's a terrible, caustic background noise that follows you everywhere. There are places where it comes like a roaring tide, and other places where it's a crackling hum, but only in a few places is it ever gone. <br/><br/>For my entire lifetime, the Republican Party has fostered this hatred and bigotry. They have embraced it and spread it like the cancer it is. They prop up the most retrograde, dehumanizing opinions and rhetoric from American Christian Fundamentalists, and make it a central, perennial plank in their domestic platform. In any other civilized nation, these atrocious opinions would be fringe and extremist, only with the Republican Party's full embrace and promotion of them, are they centralized here. <br/><br/>The GLBT community has never forgotten for one instant that no matter how hard we work, no matter how much we achieve, no matter how successful we are, and no matter how much we give back to our communities we are still seen as an \"other\" - not fully American, and with some, not even fully human. <br/><br/>When dozens of us are slaughtered in hatred, in one of our few safe spaces, we see most of our media and political figures cowardly doing everything they can to marginalize that this was a hate crime, carried out against LGBT people, and mostly people of color. <br/><br/>I hoped we were better than this, that we'd gotten better. I see we have far to go.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465998682", "commentID": 18851162, "userID": 64888397, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18851162}, {"approveDate": "1466007487", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466003887", "permID": "18852949", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Astoria, NY", "parentID": null, "userDisplayName": "The Buddy", "commentTitle": "<br/>", "commentBody": "Unfortunately, many reader comments seem to be getting carried away with an Intentionalist/Functionalist debate about the motives of the shooter. But the bottom line is, this was one of the most vicious murder scenes in gay history, in a climate where too many elected officials cannot resist scapegoating the group. As we saw with deranged Planned Parenthood attacker Robert Dear, scapegoating however subtle, has unpredictable consequences.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466005260", "commentID": 18852949, "userID": 67603102, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18852949}], "totalEditorsSelectionReturned": 17, "replyLimit": 3, "totalRecommendationsReturned": 17, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 488, "api_timestamp": "1488822344", "totalReplyCommentsFound": 215, "totalCommentsReturned": 17, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}