{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 1596, "totalEditorsSelectionFound": 37, "depthLimit": 0, "totalRecommendationsFound": 1385, "comments": [{"approveDate": "1474852447", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474885348", "permID": "19917412", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 81, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "east lansing mi", "parentID": null, "userDisplayName": "norman pollack", "commentTitle": "<br/>", "commentBody": "\"Is this the example we want for them?\"  No, clearly.  Yet when one pairs this editorial with that on Clinton, one finds that dumping on Trump, however merited, is not matched by well-placed criticism of Clinton' record and character.  By the latter I mean unstoppable ambition,fierceness on military policy, regime change, and support of Wall Street.  In fact, the two candidates are hardly distinguishable--both flawed, neither one to be trusted on matters of state.<br/><br/>Why give credence even to a \"lesser-of-two-evils\" argument, when evil is a bipartisan affliction?  This does not mean, necessarily, go out and support a third party.  It means, speak truth to power and condemn the proceedings as a denial of human rights and democratic government.  An honest position would be to recognize that America is no longer a just polity, and instead, a class-state tipping toward fascism.  Of the two candidates and their supporting parties, both favor wealth concentration, and neither accepts basic principles of international law.<br/><br/>The Times would serve the nation better by admitting the dangers ahead, from a renewed, intensified Cold War to sharpening divisions in domestic wealth and power.  Detraction from Trump is ever so easy, a thoroughly reprehensible figure, but why go from the frying pan into the fire by accepting, or even accommodating to, one as opportunist as Clinton?  Thinking back to FDR and the New Deal, one's heart aches for what awaits America, from belligerence to mediocrity.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474852425", "commentID": 19917412, "userID": 11983749, "recommendations": 199, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917412}, {"approveDate": "1474878389", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474874789", "permID": "19916075", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles, CA", "parentID": null, "userDisplayName": "Vesuviano", "commentTitle": "<br/>", "commentBody": "Donald Trump is without a doubt the most unsuitable major-party candidate ever to run for the White House.  Gary \"What is Aleppo\" Johnson doesn't count because his party is minor.<br/><br/>However, Trump has done three things successfully that make him a serious threat to be our next president:  First, he has accurately calibrated the high degree of anger with the low degree of intelligence of much of the American voting public and campaigned accordingly; second, he has run not just against Mrs. Clinton, but against a Washington establishment, of which she is part, that has convincingly demonstrated itself to be uncaring and out of touch with America's working class; and third, largely through his mastery of social media to reach the American people, left his rival's campaign metaphorically fighting the last war.<br/><br/>Sure, Mrs. Clinton has a better ground game; sure, Mrs. Clinton has raised tons of money; sure, Mrs. Clinton has scads of experience in government; sure, Mrs. Clinton knows what Aleppo is and can find Afghanistan on a map without help, but none of it matters.  Once again, as against Obama in 2008, she's run a lousy campaign.  Instead of beating the hustings making a case for her presidency, she's spent her time among the mega-wealthy raising money.<br/><br/>Perhaps she's counting on the debates to win for her.  I wish her well, I really do.  The United States doesn't need Trump in the White House, and neither does the world.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2368/8396/cropped-23688396.jpg", "createDate": "1474837131", "commentID": 19916075, "userID": 23688396, "recommendations": 427, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916075}, {"approveDate": "1474878437", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474908028", "permID": "19916080", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Woodstock NY", "parentID": null, "userDisplayName": "Heath Quinn", "commentTitle": "<br/>", "commentBody": "Trump embodies such a blizzard of negatives than even a focused opposition opinion like this has a hard time communicating how very radically bad he is. One needs to build a counter-blizzard to tell the whole story, and it's not only exhausting to do it, it also tells his story in part, thus feeding into his free media coverage - the very thing one doesn't want to do. Every discussion of Trump and his follies inadvertently normalizes him by placing him on the same ground as regular folk. Here's hoping Clinton takes him down tomorrow night, in a manner unequivocal even to his supporters.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5879/588/cropped-5879588.jpg?705382821942397425", "createDate": "1474837160", "commentID": 19916080, "userID": 5879588, "recommendations": 563, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916080}, {"approveDate": "1474878479", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474874879", "permID": "19916086", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London", "parentID": null, "userDisplayName": "Brandon", "commentTitle": "<br/>", "commentBody": "If anything this critique on Trump is not strong enough, probably for fear of sounding alarmist.  Yet here is a man who seems to have no understanding of or respect for the institutions upon which American democracy depend.  His indifference to notions of equality under the law, justice and due process, suggest that he is unlikely to respect constitutional restraints or the checks and balances provided by the other branches (assuming they are not all in the hands of supine Republicans).  Not to mention his disdain for freedom of the press, and his cynical and brazen disregard for truth.  Our democracy is in grave danger.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474837247", "commentID": 19916086, "userID": 69555866, "recommendations": 889, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916086}, {"approveDate": "1474883417", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474879817", "permID": "19916137", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Southern California", "parentID": null, "userDisplayName": "Tokyoglide", "commentTitle": "<br/>", "commentBody": "It has, in a very short time, become a well-worn cliche that we are seeing an election like none other in memory -- perhaps history. I am not alone, I'm sure, in finding it astounding that the Republican nominee is even being considered for the Presidency. The office used to be one to which our children could confidently aspire -- that the holder of that office should be a model of great intellect, compassion, integrity, maturity and relevant experience. The Republican nominee fails abysmally in each of these areas. Most important, however, is that he is truly dangerous. The President's foremost obligation is the security of the nation; in every instance where he has weighed in on the subject of national security, he has demonstrated ignorance, arrogance, bellicosity, and a marked lack of mental stability.<br/><br/>I like and respect President Obama, and believe he has conducted himself in a manner consistent with the standards I mentioned earlier. If four years ago Mitt Romney had been elected I most certainly would have been disappointed and believe he would have taken the country in the wrong direction. However, I would not have felt what I feel, intensely, every day when contemplating the prospect of a Trump presidency: Fear. Fear for the viability of the Republic, fear for my children's future, and fear that we have, finally, abandoned the principles that made us a great nation.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474837868", "commentID": 19916137, "userID": 60958600, "recommendations": 980, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916137}, {"approveDate": "1474889218", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474885618", "permID": "19916259", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Deep Red South", "parentID": null, "userDisplayName": "David Gregory", "commentTitle": "<br/>", "commentBody": "The fact that Donald Trump could secure the nomination of a major political party tells us that this country is disturbingly unlike the image America likes to hold in it's mind's eye and that which we would like to project to the rest of the world. The fact that the Party of Abraham Lincoln, Theodore Roosevelt, Dwight Eisenhower and Gerald Ford is the party that gramted him that nomination is sad beyond words.<br/><br/>While I disagree vehemently with the editorial board of this paper regarding Ms Clinton, I agree that Donald Trump is simply unfit to be our President. That can also be said of all Republican Congressional leadership. Rather than engage the serious challenges our government and people must face, they resort to disinformation, fear mongering, obstruction and suppression of well grounded science. They are unfit to serve and unfit to lead.<br/><br/>Without a Congress composed of people more concerned with the good of our nation than the partisan makeup of the next election no President will be able to do much- just ask President Obama. If the American people return the dysfunctional Republican cabal currently in control of both chambers of our national assembly it really does not matter all that much who sleeps in the White House.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3000/6326/cropped-30006326.jpg?711136243625463747", "createDate": "1474839012", "commentID": 19916259, "userID": 30006326, "recommendations": 324, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916259}, {"approveDate": "1474889337", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474885737", "permID": "19916276", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Columbus Ohio", "parentID": null, "userDisplayName": "Byron Edgington", "commentTitle": "<br/>", "commentBody": "It's long past time for the Republican leadership to openly, vociferously denounce the charlatan Donald Trump. As long as Paul Ryan, Mitch McConnell, Orrin Hatch, Rob Portman, John McCain, Charles Grassley and other GOP leaders maintain the fiction that Trump can somehow become presidential, and that they can work with him, the more legitimacy Trump will have. It's time for these public servants to renounce Donald Trump and all he represents, regardless of the damage it may do to their careers.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6388/8227/cropped-63888227.jpg?14390429201499077847", "createDate": "1474839228", "commentID": 19916276, "userID": 63888227, "recommendations": 714, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916276}, {"approveDate": "1474889749", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474886149", "permID": "19916311", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Eugene Oregon", "parentID": null, "userDisplayName": "DC Elliott", "commentTitle": "<br/>", "commentBody": "Trump began as entertaining trivia, he may end (if elected) a tragedy. Destroying \"Obamacare,\" right-winging the Supreme Court, quashing female and gay rights, eliminating civil rights protections, further enriching plutocrats, hollowing Social Security, giving the gun lobby and rogue police free-rein for mayhem, fomenting riots, rousing Old Dixie, courting Czar Vladimir, disabling NATO, enraging Iran, forging a Cold War with Mexico and giving every slick-biz hustler more leverage -- all of that would rapidly create a free-fall loss of support, and leave Trump exposed to bipartisan impeachment. The bland, gutless appendage Mike Pence is not ready to be president. The Times editorial lays out lucidly why we cannot, must not, elect a dangerous, ego-driven fool, a man so flawed he will make Richard Nixon seem a mischievous neurotic, Warren G. Harding a genial dupe, and George W. Bush (at last) a bravura statesman. Mrs. Clinton is our only real choice, and a good one.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474839704", "commentID": 19916311, "userID": 56072720, "recommendations": 429, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916311}, {"approveDate": "1474890014", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474886414", "permID": "19916341", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NH", "parentID": null, "userDisplayName": "KM", "commentTitle": "<br/>", "commentBody": "I agree that a Trump presidency would be disaster for such a long list of reasons. So why does he have so many supporters despite the evidence? And why do so many people persist in believing that Mrs. Clinton is \"equally\" untrustworthy?  That's the bigger story here, and the NYT and the media in general are complicit in it.   I fear that we will face a Brexit like phenomenon in this country, where voters are misled into making an irreversible and unwise decision.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474839899", "commentID": 19916341, "userID": 45341715, "recommendations": 490, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916341}, {"approveDate": "1474890161", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474908042", "permID": "19916352", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WV", "parentID": null, "userDisplayName": "Freedom Furgle", "commentTitle": "<br/>", "commentBody": "Step right up, Ladies and Gentlemen, step right up!<br/><br/>Try new and improved Trump-Brand Snake Oil. The miracle of the modern age! It cures unemployment, underemployment, racism, terrorism, globalism, sexism, liberalism, and the piles! All within the first 100 days! Guaranteed*<br/><br/>Side effects may include the following:<br/>- Increased income inequality for 99% of users<br/>- Gaping holes in the social safety net<br/>- Tax cuts for hedge fund owners and managers<br/>- Destruction of the polar ice caps<br/>- Closing the US Dept of Education<br/>- Loss of standing in the world<br/>- Severe indigestion<br/><br/>Trump-Brand Snake Oil - talk to your doctor about it today. (Unless your doctor is a woman or minority, of course.)<br/><br/>* Guarantee not valid in all 50 states, US territories, or Washington DC.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7397/5112/cropped-73975112.jpg", "createDate": "1474839967", "commentID": 19916352, "userID": 73975112, "recommendations": 490, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916352}, {"approveDate": "1474890334", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474886734", "permID": "19916365", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "MCV207", "commentTitle": "<br/>", "commentBody": "Who can ever say Donald Trump is not a Republican?  He is the ultimate Republican embodiment of the \"bait-and-switch\" aspirational politics that party has perfected, getting middle (and mostly white) America to vote against their economic interests in the hopes of becoming rich and successful at the expense of others - just like Trump himself, so exaggerated with his gilded towers, private planes, eponymous products and accompanying outsized ego.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474840097", "commentID": 19916365, "userID": 2108947, "recommendations": 359, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916365}, {"approveDate": "1474890509", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474886909", "permID": "19916381", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "karma2013", "commentTitle": "<br/>", "commentBody": "It is not hyperbole to state that Donald Trump poses an existential threat to our democracy. Why is he so perilously close to winning? I know many Trump supporters and all of them are aware of issues raised in this editorial. And all of them have cited their \"white hot\" hatred of Hillary Clinton as their primary reason for supporting Trump. I imagine this is what is motivating many otherwise intelligent people in this election, and may be the only reason he has come so close. They recite right wing accusations as gospel and talk about her as being \"overly ambitious.\"  Decades of Hillary bashing have taken root, and the candidate herself has not helped to dispel the public perception that she is untruthful and untrustworthy -- the private email server, in particular, has done considerable damage.<br/><br/>Monday's debate is the last best chance to change the minds of those who are motivated by animous for Hillary,  Editorials won't do it, it's up to Hillary to show that with all of her faults she is competent and sane, something that Donald Trump most definitely is not. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474840321", "commentID": 19916381, "userID": 67607556, "recommendations": 327, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916381}, {"approveDate": "1474890845", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474887245", "permID": "19916416", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kansas City, MO", "parentID": null, "userDisplayName": "Phyllis L.", "commentTitle": "<br/>", "commentBody": "Comments about which candidate has more baggage or is liked the least are not helpful. What should matter is which candidate has the experience and the temperament to lead this country, and in those two areas, Mrs. Clinton is FAR superior to Mr. Trump. And she has exhibited a passion to help others; she has been in the trenches, not always winning, but slugging it out. These are dangerous times, and we need someone who knows the players, the issues, and shows restraint and diplomacy. There is a clear choice, and ignoring it to bet this country's future on the empty promises of a petulant pretender is the height of recklessness.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474840699", "commentID": 19916416, "userID": 73833622, "recommendations": 524, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916416}, {"approveDate": "1474899955", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474896355", "permID": "19916954", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tucson", "parentID": null, "userDisplayName": "Masud M.", "commentTitle": "<br/>", "commentBody": "My wife and I have roughly 100 friends and acquaintances, with whom we meet fairly regularly at work, neighborhood gatherings, community groups, etc. Most of these people are well educated and hold positions as doctors, engineers, teachers, professors, lawyers, and artists. With them, a typical conversation involves facts, logic, historical anecdotes, scientific news, memories of past events, and so on. These friends are all Democrats, are frightened of Trump and his supporters, and, without exception, plan to vote for Hillary in the upcoming election. Then there are a couple of other friends (also in the same group) who are kind and generous, have raised good families, and are generally nice people to hangout with. However, we all know that these friends don't read books, get their information mostly from talk radio and Fox News, and are poorly informed about the world events, history, literature, science, arts, etc. You cannot have a complicated discussion with these friends about interesting topics, so you just stick with simple issues, exchange a few pleasantries, and move on. These friends of ours are Trump supporters; they aren't bothered at all that their political leanings are at odds with the rest of the group. I am not being judgmental here; simply reporting my observations. But I believe (based on these limited observations) that broad-based knowledge and ability to process complex information is one of the main factors that sets Clinton and Trump supporters apart.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474846743", "commentID": 19916954, "userID": 63654427, "recommendations": 271, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19916954}, {"approveDate": "1474900084", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474896484", "permID": "19917212", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland", "parentID": null, "userDisplayName": "Adam Erlichman", "commentTitle": "<br/>", "commentBody": "As a college student, the rise of Donald Trump has almost been surreal. From the 2012 election, I remember the Trump mentions as merely tabloid fodder. It was kind of a funny concept to indulge in -- this ridiculous personality leading the most powerful nation in the world. <br/><br/>His campaign seemingly faded into the ether, along with his birther comments and other scattered strong opinions. <br/><br/>Now here we are, four years later. Not only is he again running for President, but there is actually some sort of chance of him winning. <br/><br/>As a millennial, I haven't really experienced many drastic moments in history. When 9/11 happened I was only 6 and barely even realized what was taking place. Without having to provide for myself, the 2008 recession didn't really resonate with me. <br/><br/>Even at 20 years old, I can understand the consequences that would come with a Trump Presidency. Canada doesn't seem too bad.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474849630", "commentID": 19917212, "userID": 74949705, "recommendations": 172, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917212}, {"approveDate": "1474901409", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474897809", "permID": "19917139", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland, OR", "parentID": null, "userDisplayName": "Sherry Dye", "commentTitle": "<br/>", "commentBody": "In its editorial today NYT bravely and (of course) belatedly reminds us of all the reasons we should not vote for Trump.  Anyone who thinks about such things has known all this already. I will add one reason: we need not assume that if Trump is elected, he will survive his first term.  In the upcoming election Trump's name is on the ballot; but behind him are multitudes of powerful undesirables (oops almost said deplorables), who will sail into power on Trump's coattails and continue to try to make the USA their personal ATM.  If you think Mr. Pence is a \"man of the people,\" look again, and very closely.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474848831", "commentID": 19917139, "userID": 61774436, "recommendations": 113, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917139}, {"approveDate": "1474901448", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474897848", "permID": "19917140", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bethesda, MD", "parentID": null, "userDisplayName": "RickF", "commentTitle": "<br/>", "commentBody": "A constructive editorial. Thank you NYT.  I hope that Trump supporters will look at the non-partisan fact checking of Trump vs Clinton. It is not even close. Yes, Clinton answered like a lawyer regarding her emails. And she took a long time to be contrite.  But Trump's lying is compulsive and pathological.  Would you hire someone like him?  When asked, not one of my Republican or Democrat friends would. He is a spoiled brat and provocateur who grew up with no lessons in humility and speaks his latest unfiltered, undisciplined, and contradictory thoughts. He is hyperfocused on himself. He has no philosophical or moral center. He panders to crowds and manipulates. He does two things well: Branding and Selling Himself. He sells confidence and people buy it, despite his catastrophic failures.  FOUR times in bankruptcy, and many more business failures. And his failures have been on the backs of countless small businesses. He refused to honor his payments to them. That is not good for the economy or Americans, but was good for Trump. His daily actions over 70 years mean something.They ARE who he is. He outsourced while patriotic business owners continued to use US production and workers. He used illegal aliens on his construction projects and other properties. Rather hypocritical. His risk taking impulsiveness and child-like temperament and manners may be entertaining, but his hatred and lack of diplomacy is dangerous for our great nation and invites terrorism and war.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474848863", "commentID": 19917140, "userID": 47227279, "recommendations": 136, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917140}, {"approveDate": "1474901975", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474898375", "permID": "19918010", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "United States", "parentID": null, "userDisplayName": "Next Conservatism", "commentTitle": "<br/>", "commentBody": "The problem isn't that Trump is unsuitable. It's that Trumpism in its entirely, with all its effects, has to be stopped. The Republicans needed to do it months ago. Instead they sold their party out and obviated any possibility of its constructive participation in a Clinton Administration. They defeated themselves irreversibly in the Obama years. They used tantrum and obstruction to represent ignorance and obsolescence.<br/><br/>The details will change but the relentless ignorance will become a lingering trait. There will be another Trump after this. Trump will gain influence by not gaining power. He'll continue discrediting GOP candidates and ideas. Trumpism infects the party like termites in a house, and it has to be torn out and replaced down to tlhe local offices.<br/><br/>The Times keeps saying what ought to happen, but not who ought to make it happen. Here is the prescription that ought to have been delivered months ago in these pages by the Board: The Republicans need to purge Trump and Trumpism to the last voter, as Johnson did with the bigots of his era. If they don't, they deserve to be finished as a party.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/706/3142/cropped-7063142.jpg", "createDate": "1474857349", "commentID": 19918010, "userID": 7063142, "recommendations": 119, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19918010}, {"approveDate": "1474902678", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474899078", "permID": "19917325", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "dallas", "parentID": null, "userDisplayName": "mom of 3", "commentTitle": "<br/>", "commentBody": "I lived abroad for nine years, during which I went from a young, idealistic liberal with a PhD to a cautious mother of three in middle age.  I am prime Republican material, by income, race and age.  <br/><br/>Still, that I missed Obama's presidency and am looking to the real threat of a Trump reign is so dispiriting to me that I'm considering leaving the country again.  I have citizenship in Europe, earned by chance.  I love my country, but I love my daughters more.<br/><br/>Please, Ms. Clinton, remember who you are.  Don't worry about your opponent.  He is racist, sexist and pretty much every other -ist.  Those who can read and remember know this.  You are historic and inspiring.  You are better.<br/><br/>Also, Ms. Clinton, you are fallible.  Famously, infamously, and humanly so.  Those of us who live in the real world are all fallible, though usually not so famously. Don't deny it.  You're the democratic Presidential candidate, not a robot.<br/><br/>If you win, please raise my taxes.  They are at historical lows.  We'll be okay, promise.  Lots of kids in Dallas and across the country aren't.  They need our help.<br/><br/>Also, please make good on the promise of the US being a new Ellis Island. If my memory serves, we are a nation of immigrants.  My mother was.  My husband is.  We are ready to help.  Lots of families like ours would help too.<br/><br/>Best of luck, and remember that, unlike your opponent, you have values.  Stick with them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474851024", "commentID": 19917325, "userID": 52881509, "recommendations": 261, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917325}, {"approveDate": "1474903116", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474899516", "permID": "19923251", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Tim Alexander", "commentTitle": "<br/>", "commentBody": "I do not \"like\" Hillary Clinton. More to the point, I disagree with a raft of her policies - beginning with her unbridled advocacy of abortion. I bristle with her shape-shifting, \"Now I'm a hawk; now I'm a dove; now I'm a populist; now I'm a friend of Wall Street\" persona. I do not consider her inspirational. I consider her a leader passionate for people in the abstract but ruthlessly, indifferently ambitious regarding the individual person.<br/><br/>Yet for all I heartily dislike and distrust in Hillary Clinton, I cannot see her blowing up our economy, shattering our international alliances. Critically, I cannot see Mrs. Clinton regarding our nuclear arsenal from a posture of ignorant, cavalier, lack of impulse control. She may be numbingly dull. She may be oppressively dutiful. She may be politically deceitful. Hillary Clinton is not pridefully dangerous.<br/><br/>I would have voted voted for John Kasich. I would have voted for Jeb Bush. I would have voted for Marco Rubio. I could have been persuaded to vote for Ted Cruz. <br/><br/>Woe to the Republican party for presenting a nominee so demonstrably unfit for the Presidency. Woe to the Republican leadership for using Hillary Clinton as pistol put to my head to coerce my vote for their standard bearer.<br/><br/>I will not. I refuse. I will not be afraid.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474901444", "commentID": 19923251, "userID": 69500927, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19923251}, {"approveDate": "1474903148", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474908074", "permID": "19919043", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Albany", "parentID": null, "userDisplayName": "Uuman", "commentTitle": "n/a", "commentBody": "I'm all for electing Trump, if only because it will force congress to reign in executive power. Power which has only been expanding over the last couple of decades. Power which only seems to have negative consequences for us, the average citizen.<br/><br/>Electing Hilary will only make it worse. She isn't even elected and accusations of sexism have already been launched over the exact questions every nominee is expected to answer. The moment someone does something she doesn't like, she can just have a member of her camp insinuate sexism.  <br/><br/>So,  yeah, I'd prefer a president who will be prevented from causing further harm to one like Hilary. A person whose friends don't even want to vote for them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474869421", "commentID": 19919043, "userID": 76857217, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19919043}, {"approveDate": "1474903208", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474899608", "permID": "19917412:19919104", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "norman pollack", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "massapequa new york", "parentID": 19917412, "userDisplayName": "aft", "commentTitle": "<br/>", "commentBody": "In the nineties it was Hillary who tried very hard to get a comprehensive health care program passed into law. Guess who blocked it. She made some speeches at Goldman Sachs and made some money.  That doesn't prove she is a big protector of Wall Street. She was one of the earliest voices raised warning that a problem in the subprime mortgage market would spread to the economy in general.  Whitewater was rehashed a zillion times and found to be a big fat zero.  But it keeps getting brought up like a valid concern. Its bull. The same is true of Bengazi.  Bull. The legitimate press is to blame for not calling out our 'fair and balanced' crew of hate mongers all these years, and giving Republican liars the respect they never deserved by not calling them on lies and exaggerations for so many years.  Now its probably too late.  They have stumbled their way into the reptilian portion of the brain of enough voters to make this a very close election. All the media is to blame.  Clinton is giving an important policy speech, and they cut away to an airplane landing that will disengorge Trump in about 20 minutes. They have panel discussions that are unbalanced with an excess of republicans and give them uninterrupted speaking time and cut the democrats short.    This first debate is being moderated by a registered republican, and on top of that the republicans are making noises that the debate is rigged.  Yeah, right.  On top of that he's being asked not to correct lies.  Give me a break.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474870896", "commentID": 19919104, "userID": 65906765, "recommendations": 134, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19919104}, {"approveDate": "1474903281", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474908443", "permID": "19916394:19921335", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "R. Miller", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Georgia", "parentID": 19916394, "userDisplayName": "Caroline Fraiser", "commentTitle": "<br/>", "commentBody": "There is really no comparison between the honesty of the two candidates--and it is dangerous and false to equate the two,<br/><br/>Hillary Clinton is flawed, like most of us, and I disagree with some of her positions. She has occasionally behaved in a less than forthright manner. But it is simply not true that she is in the same category as Donald Trump, who is a pathological liar. She has been relentless pounded with baseless charges of dishonesty. Republicans know that accusations and and innuendo, even if ultimately proven false, still taint the accused.<br/><br/>Republicans have actually acknowledged that the whole Benghazi controversy was created to bring down Clinton's approval ratings. The email controversy came up when the Benghazi accusations were proven untrue. The private server was a mistake, as she has admitted, but we aren't talking Watergate, here. Many people in Washington, including many members of Congress, don't follow protocol with classified information, and much \"classified\" material is incorrectly deemed such.<br/><br/>The Time's Nick Kristof said it best, in his column:<br/><br/>\"Clinton’s Fibs vs. Trump’s Huge Lies\"<br/> \"...the idea that they are even in the same league is preposterous. If deception were a sport, Trump would be the Olympic gold medalist; Clinton would be an honorable mention at her local Y.\"<br/><br/>What voters need to focus on is competency, knowledge, and temperament.<br/>Simply put, Clinton has it, while Trump does not.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474894321", "commentID": 19921335, "userID": 71806314, "recommendations": 131, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19921335}, {"approveDate": "1474903559", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474908052", "permID": "19917408", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tennessee", "parentID": null, "userDisplayName": "vulcanalex", "commentTitle": "<br/>", "commentBody": "Why Hillary should not be president:<br/><br/>She has proven to lie, see the emails for only one example.<br/>She has a history of very bad decisions, see her handling of being sick for only one example.<br/>She is not a competent administrator, see the state department for only one example.<br/>She is corrupt, see how wealthy she is from being flat broke for an example.<br/><br/>Now Trump is not perfect, but many of his proposals are better for the country than Hillary's.  Growth and jobs.  Suspending immigration until we can better control it.  Enforcing the laws fairly.  I could go on.<br/><br/>I don't like some of what he says, and I better understand it than say this newspaper says they do.  Bottom line Hillary is poor for sure, Trump has some possibilities.  Better a possible winner than a sure looser like Hillary.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474852364", "commentID": 19917408, "userID": 63687177, "recommendations": 27, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19917408}, {"approveDate": "1474904046", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474900446", "permID": "19920354", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Stockholm, Sweden", "parentID": null, "userDisplayName": "Seth Strandin", "commentTitle": "<br/>", "commentBody": "In the beginning, I thought Mr. Trump was entertaining and that the GOP had gone suicidal. When Mr. Trump actually got the nomination my smile became a bit strained and now when I read the polls I start to get scared.<br/><br/>I have two specific questions that I have not found the answer to:<br/>1. When was America great in the eyes of Mr Trump?<br/>2. How does Mr. Trump define \"great\" in this case?<br/><br/>Does he mean \"great\" as in \"lebensraum\"? Does he plan to put 11 million illegals in camps before deportation? Will he try to outlaw opposition?<br/><br/>I feel I could take the German list of political Changes during the 1930s and easily fit everyone into the Trump Campaign.<br/>Should he become the next president of the United States I will Place some bets that he will be the second president to be impeached ever since he is totally incapable of doing a Nixon.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474889925", "commentID": 19920354, "userID": 76439322, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19920354}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 2561, "api_timestamp": "1488822340", "totalReplyCommentsFound": 965, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}