{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 1298, "totalEditorsSelectionFound": 30, "depthLimit": 0, "totalRecommendationsFound": 1114, "comments": [{"approveDate": "1476774652", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476771052", "permID": "20169075", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 15, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "MaryEllen", "commentTitle": "<br/>", "commentBody": "McConnell and Ryan shamefully stand by to save their own skins. That's about it. They know Trump will blow his horn if they speak up, and they cravenly decline. They've weighed the risks and the short attention span of American voters. They know there will be no political price to pay. They will keep their jobs. <br/><br/>Wait-- weren't they hired to act in the national interest? They know full well that Trump and surrogates are lying and fomenting conspiracy theories designed to undermine the election. Wouldn't their job descriptions include upholding American democracy, and disavowing those who seek to destroy it?<br/><br/>Apparently not. McConnell and Ryan are just hiding in their caves until it's safe to come out. When Trump can't blast them anymore. And they can be the pretend purveyors of American values again.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476758115", "commentID": 20169075, "userID": 31637014, "recommendations": 1644, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169075}, {"approveDate": "1476775094", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476771494", "permID": "20169118", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 20, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Belmont MA", "parentID": null, "userDisplayName": "Diogenes", "commentTitle": "<br/>", "commentBody": "On this troubling issue, it is important to define how the word \"rigged\" is being used. One meaning is that the outcome of the election is being determined in advance, such as some popular game shows, e.g. \"The Sixty-Four Thousand Dollar Question,\" were in the 1950s. In this election, it would presumably be the government that is determining the outcome.  For several reasons, that is nonsensical.<br/><br/>It is also nonsensical that there is a conspiracy among the press and the media to determine or influence the election.<br/><br/>Nevertheless, it is evident that the press, the media, large sections of the business community, and the universities are independently alarmed by the possibility of Donald Trump becoming president, and they are doing what they can to diminish that. Every  major newspaper, with the exception of the Wall Street Journal, has urged its readers not to vote for him. While they try to maintain a strict separation of their editorial pages from their reporting, it is possible that some stories are slanted against him.<br/><br/>This controversy should subside after the election, especially if the result is decisive. It will take longer to restore the trust that people have in their political institutions.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476758602", "commentID": 20169118, "userID": 38816970, "recommendations": 194, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169118}, {"approveDate": "1476775118", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476771518", "permID": "20169119", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Peter K", "commentTitle": "<br/>", "commentBody": "Waiting for Paul Ryan and Mitch McConnell to speak out against Trump's pernicious lies about the rigged electoral system is just like the gasoline analogy cited in the editorial: the gasoline has already been poured, the fire is already ablaze, and even if the fire department gets there . . . eventually, the damage has already been done. We are burned, scorched, and irreversibly marred. <br/><br/>Ryan and McConnell and most of the Republican leadership have no interest in saving this country. They do not put the interests of the country above their own partisan and personal agendas. They already demonstrated this through eight years of obstructionism with Obama. <br/><br/>I don't see either politician taking a stand against these lies but maybe with the damage that Trump has and continues to bring forth on this nation, Ryan and McConnell will tap into their bag of hollow symbolic assurances and offer us, as they so often do in these times of carnage, their deeply felt \"thoughts and prayers.\" ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476758608", "commentID": 20169119, "userID": 27527795, "recommendations": 1067, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169119}, {"approveDate": "1476776612", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476773012", "permID": "20169195", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NC", "parentID": null, "userDisplayName": "PAN", "commentTitle": "<br/>", "commentBody": "If anything, it is \"rigged\" in the Republican's favor given all the shenanigans they have pulled with Gerrymandering, Voter ID and other voter suppression laws they have enacted.<br/><br/>It is not in the GOP's interest to disavow the absurdity of Trump's rigged election claims. They can't get away with making such a claim themselves, so why not let Trump do it for them? The party's top leaders are more than eager to have a Clinton presidency start with a cloud of illegitimacy and what better way than to encourage - in a backhanded, silent way - the notion that Trump lost to a rigged nefarious system.<br/><br/>Trump does not realize that he will lose the election due to a conspiracy of tens of millions of voters voting for his opponent.<br/><br/>The only rigging going on now is the GOP leadership looking to impede the will of the people's choice of POTUS and will do everything they can to sabotage a functioning Presidency, government and country for the sake of partisanship. Trump's real complaint is that it isn't rigged enough in his favor even if the media has continually reported false equivalences between Trumpisms and Clintonisms. <br/><br/>\"This is like standing back while an arsonist pours gasoline all over your house\" to evict you so a Trump building can be built in its place while Ryan and McConnell call it \"Eminent Domain.\" Actually, Trump is the arsonist and is burning down the GOP's own house along with Ryan and McConnell in it. Good riddance.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476759538", "commentID": 20169195, "userID": 582307, "recommendations": 1270, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169195}, {"approveDate": "1476777160", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476773560", "permID": "20169286", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Athens, GA", "parentID": null, "userDisplayName": "wildfyr", "commentTitle": "<br/>", "commentBody": "This may be the most damaging claim of Trump's legacy. It slices at the one of the most important threads in the fabric of our country: the peaceful transfer of power between administrations, and the graceful concession that essentially every losing presidential candidate in history has given. This grace by true statesmen has been instrumental each time in healing some of the inevitable wounds of presidential elections. It speaks to how opposition politicians used to be competitors, not mortal enemies. It would be one of the most selfish public acts in history to fight on after this election is decided on Nov 8th.<br/><br/>That Trump can make this claim with no evidence whatsoever, and it be picked up and run with by tens of millions of citizens strains my faith in our society.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476760637", "commentID": 20169286, "userID": 62109219, "recommendations": 975, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169286}, {"approveDate": "1476778154", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476774554", "permID": "20169456", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Julie W.", "commentTitle": "<br/>", "commentBody": "What I've always found interesting about dictators and demagogues of all stripes is not that they exist (there will always be sociopaths among us), but rather the fact that they so readily find enablers willing to do their bidding for them.  Paul Ryan and Mitch McConnell surely realize that Donald Trump is dangerously unfit to hold the office of President, yet they stand by and refuse to forcefully denounce him and withdraw their support. They are more concerned with maintaining their own positions than with the good of the country.  They are cowards, plain and simple. History will not judge these men kindly. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476762501", "commentID": 20169456, "userID": 46954653, "recommendations": 1672, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169456}, {"approveDate": "1476778725", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476775125", "permID": "20169565", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Wally", "commentTitle": "<br/>", "commentBody": "It is one thing for Trump to say \"the mainstream media is biased against me\". That conveniently omits Fox News which is biased for him and the daily WikiLeaks release of hacked emails from Democratic Party officials that certainly works to his advantage. But everyone can judge that claim as a matter of opinion. <br/><br/>To claim that there has already been massive voter fraud, and will be more from now until the election day, is a factual claim for which he and his acolyte Guliani offer NO evidence only racist insinuation that it happens in African-American communities in the inner-cities. <br/><br/>Republican leaders that fail to denounce this accusation -- demanding he \"prove it or shut up!\" -- are doing their country and party an enormous disservice. This is the core principle of democracies -- one citizen, one vote! Nothing can be more important than to preserve its integrity. No political accusation is more grave than for a candidate to claim, without evidence, that an election is rigged, or to state that, if elected, he will jail his opponent. This is far, far more serious than anything Trump has said or done thus far in his debased campaign. Leaders of the Republican Party, speak up!  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476763814", "commentID": 20169565, "userID": 18747164, "recommendations": 733, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169565}, {"approveDate": "1476779115", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476775515", "permID": "20169644", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 23, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lexington, KY", "parentID": null, "userDisplayName": "Bill Needle", "commentTitle": "<br/>", "commentBody": "I have worked as an election official in four previous elections.  Where I live, there are four officials - two from each party.  One from each party checks the identification of each voter, one is a sheriff who maintains order inside and outside the poling place, and the fourth works with the other three in a bipartisan resolution of issues that may arise.  At no time does any of the four poll officials work alone.  All four tabulate the results and all four must ensure that the voting machine code slips distributed equal the final tabulation when the polls close.  IDs are rigorously checked by an official from each party.  Officials have cell phones issued by the board of elections for questions needing answers.  At no time is any official alone with any voting apparatus and one official from each party must travel with an opposite party official when returning voting machines and tabulations to the board of elections.  As for intimidation, each voting machine is set up behind a barrier and at least twenty feet from the line of those waiting to vote and no individual is allowed past the check-in/voting code distribution table without a voting code slip.  No loitering is allowed in the polling place and the sheriff also checks outside the polling place for any irregularities.<br/><br/>Simply put, if Donald Trump thinks this system is vulnerable to fraud, he's stupider than he has shown thus far in his rapidly dying campaign.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476765007", "commentID": 20169644, "userID": 70055681, "recommendations": 1944, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169644}, {"approveDate": "1476779154", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476775554", "permID": "20169653", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WA State", "parentID": null, "userDisplayName": "Dairy Farmers Daughter", "commentTitle": "<br/>", "commentBody": "Ryan, and McConnell in particular, are the epitome of spineless, self-serving and cynical politicians.   Their failure to repudiate Trump essentially is an endorsement of the outrageous campaign that is currently being run by the nominee.  One can understand on some level the rationale these two have used in trying to skirt around endorsing Mr. Trump while not completely disavowing him -  their own political power depends upon the GOP holding Congress.  However, at some point the people who purport to be the leaders of this nation must take a stand.  By not forcefully addressing the assertions that if Trump loses the election it must be \"rigged\", they are no better than Trump.  The credibility of any democracy depends upon people believing that the process is fair, and that elections have not been manipulated.  After the GOP wing of the Supreme Court handed the 2000 election to S.W. Bush, the Democratic nominee and Party accepted the outcome, when they could have called Bush's election illegitimate.   The GOP's actions toward Mr. Obama have exacerbated the current situation.  They tacitly promoted that he was not legitimate, by their obstructionism and failure to forcefully reject the \"birther\" claims.  Does anyone think that Trump's followers will accept the election of HRC?  McConnell, Ryan and the GOP leadership have sowed the seeds for the current situation.   Now they will have to reap them.  Unfortunately, the damage done to our democracy will affect us all.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476765108", "commentID": 20169653, "userID": 65160147, "recommendations": 619, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169653}, {"approveDate": "1476781765", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476778165", "permID": "20169900", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arizona", "parentID": null, "userDisplayName": "seniordem", "commentTitle": "<br/>", "commentBody": "To actually rig the election, it would require an effort which is impossible, since it would require corrupting the processes on all levels, down to and including the local voting booths.  This sort of  fanciful idea comes from someone who seems to have less and less contact with reality each day. His motivation is suspect and seems to have little or no relationship to the false justification that it is to stop voter fraud. It seems that Mr. Trump is out promoting free coverage yet again. I wonder if he could be denied attention when he puts forth such nonsense?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476769754", "commentID": 20169900, "userID": 16358691, "recommendations": 278, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169900}, {"approveDate": "1476783077", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476779477", "permID": "20169916", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Michael", "commentTitle": "<br/>", "commentBody": "It is not beneath Ryan and McConnell to use every tactic in the book to secure a Republican majority, regardless of the absurdity. They are the ultimate obstructionists, voting in direct conflict of what's best for the nation. They do not pursue agendas that benefit Americans. They pursue what is good for retaining a majority Republican Congress that is not in step with the rest of us. To an overwhelming majority of Americans, is the election rigged? No. To Ryan and McConnell, heck yeah! Americans need to cleanse their stench from the Legislative body by voting Democrat up and down the ballot.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476770159", "commentID": 20169916, "userID": 72673510, "recommendations": 479, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20169916}, {"approveDate": "1476783547", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476779947", "permID": "20170020", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Mark", "commentTitle": "<br/>", "commentBody": "On the right, the GOP establishment created a straw man of voter fraud in order to suppress poor and minority voters in states previously covered under the Voting Rights Act that was effectively gutted by the Supreme Court in 2013. Add that to Trump voters who are pure conspiracy theorists who will believe anything and you get an entire political party that doesn't believe or will say that any election they lose is legitimate. On the left, disgruntled Bernie Sanders voters claim that internal bias by DNC staffers towards Hillary Clinton directly led to her \"fraudulent\" primary victor, which is not supported by any evidence whatsoever.<br/><br/>The lack of trust in our election process is shocking and should scare everyone. The press needs to call out those who claim voter fraud is rampant in this country what they are: liars. Unfortunately, most of these same people think the national media is part of the conspiracy and probably won't listen at this point anyways.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476773632", "commentID": 20170020, "userID": 35882549, "recommendations": 296, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20170020}, {"approveDate": "1476788131", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476784531", "permID": "20170131", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 19, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Oxford, UK", "parentID": null, "userDisplayName": "Krausewitz", "commentTitle": "<br/>", "commentBody": "By 'rigged' I'm not sure Trump means that the ballot boxes will be stuffed....I think he means that powerful forces in Washington and in the media pick favourites and do what they can to help them out. In this he is exactly right. The system is rigged against third party candidates whose ideas are deemed so dangerous by the establishment that they are not even allowed to take part in the debates. The system is rigged against populist liberals and outsiders like Bernie Sanders. Bernie didn't have the luxury of receiving debate questions ahead of time, didn't have the 'neutral' DNC launder money for him through state offices, and didn't have reporters in major news organisations who were happy to collide with his campaign....Clinton had all of these things and more. How is that a fair contest? How is that not 'rigged'?<br/><br/>To be frank: I'm not sure how anyone could have lived through the 2000 election and come out with any hope that our system is somehow legitimate. This is even before we get to Citizens United, gerrymandering and the simple fact that ~90% of elections in this country are won by whomever spent the most money.<br/><br/>We do not have anything like a functioning democracy (or 'republic', I know, I know!) in America.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476777849", "commentID": 20170131, "userID": 70226441, "recommendations": 121, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20170131}, {"approveDate": "1476790460", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476786860", "permID": "20170282", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Spain", "parentID": null, "userDisplayName": "Hamid Varzi", "commentTitle": "<br/>", "commentBody": "Of course it can be rigged. What about the 2000 presidential election in which huge numbers of voters were prevented by state troopers from reaching the voting booths and a recount was prevented by the GOP_dominated Supreme Court?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4709/2369/cropped-47092369.jpg?0.17691857718806725", "createDate": "1476782112", "commentID": 20170282, "userID": 47092369, "recommendations": 322, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20170282}, {"approveDate": "1476795919", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476792319", "permID": "20172026", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "jerry403w", "commentTitle": "<br/>", "commentBody": "The bully enjoyed the free publicity a year ago and now complains that he's being quoted and the media is paying attention to his words.  He has been lying for months and as the election gets closer his lies are now being noticed by the media and the populace.  <br/><br/>Ryan and McConnell are getting what they deserve.  They allowed him to climb to the top of the heap by ignoring what he was saying.  Now it's too late to try and put the ogre back in his cave.  <br/><br/>Long term, I think this will be good for the country as the Republican Party splits in two and we ultimately have three viable political parties.  Maybe then, we'll candidates we can support rather than look for the lesser of the evils!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476795721", "commentID": 20172026, "userID": 45338836, "recommendations": 89, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20172026}, {"approveDate": "1476796305", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476792705", "permID": "20171268", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "Russ", "commentTitle": "<br/>", "commentBody": "This is pure insanity. The Republican party has soiled itself enough by standing by Trump, now they stand silent as he pushes his theory that because things aren't going his way the system is rigged. The man is incapable of accepting criticism of any kind and lashes out like a cranky toddler when he doesn't get his way. This man is not a leader. He's a ringleader. The Republican party has 3 weeks to get it's head together or they will destroy themselves for good.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6811/3034/cropped-68113034.jpg?0.7413888828110804", "createDate": "1476792368", "commentID": 20171268, "userID": 68113034, "recommendations": 151, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171268}, {"approveDate": "1476796440", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476792840", "permID": "20171269", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Miriam", "commentTitle": "<br/>", "commentBody": "If anyone is even more despicable than Trump, it's Giuliani. Just when I think he can't stoop any lower, he makes the incredibly racist comment that inner city people are somehow more inclined to steal elections than people anywhere else. This is just one of many recent bigoted and racist comments of his. He should just crawl back into the hole he crawled out of, never to be heard from again.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476792372", "commentID": 20171269, "userID": 5881356, "recommendations": 454, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171269}, {"approveDate": "1476796581", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476792981", "permID": "20171495", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnati", "parentID": null, "userDisplayName": "Jimi", "commentTitle": "<br/>", "commentBody": "In Trump we have a candidate for (&amp; possible) president who claims elections are rigged, he wants to control our free press, and certain tv shows (SNL) should be removed.  He demonstrates total irresponsibility with these campaign points.  And leaders such as McConnell, Ryan and others are gutless in their lack of willingness to stand up &amp; defend the principles of this great country against this man.  Who knows what Trump will do next to drag down our great country to satisfy his weak &amp; sick egotistical needs.  I can't blame any voter for wanting change in leadership &amp; reaching outside the system - but Trump is a creation of the ugliness within people - he reflects little of the good.  Very sad..", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476793448", "commentID": 20171495, "userID": 58440454, "recommendations": 155, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171495}, {"approveDate": "1476796978", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476793378", "permID": "20171597", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Providence, RI", "parentID": null, "userDisplayName": "Mark", "commentTitle": "<br/>", "commentBody": "As usual, Mr. Trump is the pot calling the kettle black.  His rants about Democrats rigging the election are in all likelihood a smokescreen behind which he hopes to rig the election himself.  By deflecting attention away from himself, as he always does, he probably hopes to distract people from his own transgressions or planned transgressions.  Disturbingly, this succeeds with about 40% of the population, nearly all of whom are Trump-supporting Republicans.  The GOP leaders don't want to alienate these people by calling Trump out because they need these Republican votes once Trump becomes a shameful footnote  in American political history.  Profiles in Courage this is not!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476793878", "commentID": 20171597, "userID": 60255529, "recommendations": 125, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171597}, {"approveDate": "1476797014", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476793414", "permID": "20171330", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jersey City", "parentID": null, "userDisplayName": "Lionel Hutz", "commentTitle": "<br/>", "commentBody": "How can Mr. McConnell and Mr. Ryan continue to stand by while Mr. Trump delegitimizes the system to which they have dedicated themselves?<br/><br/>Trick question.  They're not dedicated to anything other than themselves.  They've proved that by destroying that system as much as they can, they reap the most benefit of anyone.  They're cynical, they're cowards, they're selfish; they're the worst of the worst.  It doesn't matter what happens in this country or elsewhere.  So long as they have their power, they're happy.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476792762", "commentID": 20171330, "userID": 66846215, "recommendations": 218, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171330}, {"approveDate": "1476797511", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476793911", "permID": "20171409", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Des Moines, Iowa", "parentID": null, "userDisplayName": "John Carter", "commentTitle": "<br/>", "commentBody": "To Donald's point there is rigging in play to sway the voters, no question that the media is playing a role here. That would be the same media that Donald used to ignite his  candidacy in June of 2015. He had hired extras at $50 a pop to stand and applaud while he defamed immigrants, minorities and our way of life.<br/>He played us and he knew it then, he just doesn't want to admit to it (or anything else) now. When you invite the press to come while you escalate down to the grand ballroom you did this to grab the spotlight.<br/> Then to blow through the competition in the primaries with vitriol and malice; picking on the other candidates like an 8th grade bully, and to say now the election is rigged?<br/>Donald doesn't care if there are riots, for him that's a good thing. They'll be screaming his name; shouting down anyone who wishes to point to his lifelong career of stepping on anyone in his path to build his empire and ego. <br/><br/>Donald, do what a good salesman is supposed to do when trying to close the sale, make your pitch and then shut up. But you can't, you just keep talking because you love the sound of your voice so much.<br/><br/>And the applause is like nectar. So when you call out that the election is rigged and the media is focusing way too much attention on your record of misogyny, racism, your taxes and your failures you can't be upset. They're only doing what you asked them to do.<br/><br/> Of course the election is rigged, I know it is, but you started it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476793104", "commentID": 20171409, "userID": 77113997, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171409}, {"approveDate": "1476798385", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1476794785", "permID": "20169565:20171149", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Wally", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Germany", "parentID": 20169565, "userDisplayName": "CMD", "commentTitle": "<br/>", "commentBody": "Don't hold your breath waiting for those \"leaders\" to speak up, or you will risk suffocation. They are all scared of Trump, of his insults and of his connections in the business world. all of which could severely impede their own plans. <br/><br/>I fear America will be in for another term or two of obstructionism, as well as - I hope not! - increased violence. Trump's supporters are the most fanatic people I have ever seen, and their lack of real information makes it even worse. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476791889", "commentID": 20171149, "userID": 41830608, "recommendations": 107, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171149}, {"approveDate": "1476799176", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1476795576", "permID": "20170131:20171450", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Krausewitz", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MI", "parentID": 20170131, "userDisplayName": "mj", "commentTitle": "<br/>", "commentBody": "Absolutely. Spot on. I mean Donald Trump is a perfect example of the rationality of letting the electorate pick the nominees. <br/><br/>I say go for it. Burn the place down. It's been 250 years. It's time for a change. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476793249", "commentID": 20171450, "userID": 29419789, "recommendations": 12, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171450}, {"approveDate": "1476799967", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476796367", "permID": "20171703", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "purpledot", "commentTitle": "<br/>", "commentBody": "Each time Trump mentions the election is rigged, less of his supporters will vote. By keeping silent, and in denial, that his statements only affect his defeat, Republicans have sealed their own losing fate with many other down ballot elections.  The fact they actually believe that this strategy is of no consequence to other local and state elections is elitist and myopic, as has been their support of their Presidential candidate for two years.  The Republican Party is beyond hope.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476794260", "commentID": 20171703, "userID": 56731844, "recommendations": 60, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171703}, {"approveDate": "1476800558", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476796958", "permID": "20171907", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tennessee", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "As a conservative I felt less and less at home with the GOP since they cowtowed to the evangelicals.  I understand the politics of the move, but the far right evangelicals, I believe, were the beginning of widening gap in national politics.  There was not ONE national leader who didn't bow at the evangelical altar.  That lack of leadership has continued with the cowardice in leadership in standing up to Trump and his Third World approach to politics:  simple answers to tough questions, lie, lie, and lie again, and propose insane conspiracy theories at every turn.  McConnell, Ryan, and the rest of the \"Leadership\" are now reaping what they have sown in their shameful silence.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476795166", "commentID": 20171907, "userID": 58433469, "recommendations": 189, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20171907}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1785, "api_timestamp": "1488822356", "totalReplyCommentsFound": 487, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}