{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 10, "totalParentCommentsFound": 142, "totalEditorsSelectionFound": 10, "depthLimit": 0, "totalRecommendationsFound": 213, "comments": [{"approveDate": "1464252608", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271729", "permID": "18645608", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Edmonton", "parentID": null, "userDisplayName": "Tom Barrett", "commentTitle": "<br/>", "commentBody": "Of course America's love affair with guns is a form of madness, but that's not the worst of it. The worst part is that even in the unlikely event that a solid majority demanded sane gun laws, what on earth are you going to do about the more than 300 million guns, many of them automatic weapons, already in private hands? Any attempt to get at least the most deadly of them back would lead to another Waco every other day. I don't know how you get from the crazy place that you are in to a sane place, but I wish you luck. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1464252159", "commentID": 18645608, "userID": 55101837, "recommendations": 117, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18645608}, {"approveDate": "1464256398", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271731", "permID": "18645777", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Phoenix", "parentID": null, "userDisplayName": "Michjas", "commentTitle": "<br/>", "commentBody": "Those who favor gun control don't do enough.  Most gun victims -- those targeted by the alogirithm -- are among the least empowered of Americans.  When gun violence ventures into better neighborhoods, the residents march to Washington, get nowhere and then go back to their daily lives.  The commitment to gun control is pretty much all bark and no bite.  The law of the land is that gun ownership is a fundamental right of the people.  Scalia told us that that is how the colonists thought of it in 1789, so that's the way it is.  Constitutional originalism dictates our gun laws, but not much else.  A sustained effort to overturn Heller or repeal the Second Amendment is called for.  Abortion foes work tirelessly to get rid of Roe v Wade and, despite the fact that they're in the minority, they are precious close to success.  By comparison, gun control advocates are not committed.   The real problem is in the slums and the real power is in the suburbs and never the twain shall meet.  Why isn't there an anti-NRA?  Can you name one national gun control group?  When's the last time you donated to a gun control group?  Self-righteous outrage about guns and two dollars buys you a cup of coffee and nothing else.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4814/7869/cropped-48147869.jpg?1475980521793890914", "createDate": "1464255466", "commentID": 18645777, "userID": 48147869, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18645777}, {"approveDate": "1464259615", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271722", "permID": "18645989", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hopewell Junction NY", "parentID": null, "userDisplayName": "Cathy", "commentTitle": "<br/>", "commentBody": "Overt racism is becoming OK again, but the quiet underlying racism is still more prevalent. <br/><br/>And nothing is more racist than our gun laws. You see it in comments over and over about black on black violence, as if it is not a problem as long as it is young black men killing other young black men, out of sight of more stable neighborhoods. That the victims are often collateral damage - kids on porches, or in living rooms, or playing basketball in a local park - well, that is something the black community should resolve. <br/><br/>We don't even, as a nation, try to limit illegal access to guns. We don't register sales. We don't manage gun inventories. We don't stop lax laws that allow interstate trafficking. Because, most likely those guns are just going to be used to have one gang member pick off another. <br/><br/>Just before Easter, a local young man - my son's age - was shot while standing with his friends, collateral damage when a group in a car demonstrated that they couldn't aim and didn't care. While I will get to see my son receive his diploma, this young man will most likely get a memorial at his high school graduation. And at least part of the reason is because a state like Georgia or South Caroline really didn't care if he ever made it to adulthood. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1464258239", "commentID": 18645989, "userID": 51087612, "recommendations": 111, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18645989}, {"approveDate": "1464264669", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271737", "permID": "18647000", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Clawson, Mich", "parentID": null, "userDisplayName": "Mark Thomason", "commentTitle": "<br/>", "commentBody": "It is a good thing that police use data to track patterns of violence, rather than racial profiling and community stereotyping to abuse whole groups.<br/><br/>It is more accurate, more effective, more fair, and actually legal.<br/><br/>What we need is more data based examination of our problems, starting with guns. <br/><br/>Yes, I mean he CDC ought to be allowed to do its oft-proposed work on gun violence. I suspect the data would discomfit both sides. That would be a good start, and the prospect may be the reason they don't do it.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3767/4938/cropped-37674938.jpg?0.41398809710517526", "createDate": "1464264631", "commentID": 18647000, "userID": 37674938, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18647000}, {"approveDate": "1464268510", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271736", "permID": "18648046", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kansas City", "parentID": null, "userDisplayName": "Bruce Rozenblit", "commentTitle": "<br/>", "commentBody": "People want power.  The lust for power exists inside all of us.  It may very well be a part of our biological programming.  Guns give everyone the ultimate power, the power to kill.  <br/><br/>Some say that guns are just a tool, like an electric drill.  What can you build with a gun?  The tool analogy does not stand up.  Guns exist only to kill.<br/><br/>Many gun owners claim that guns are \"equalizers\".  You bet they are!  Put one in your hand and anyone can kill anyone.  This is the allure, the intoxicating allure.<br/><br/>The so called right to not just own a gun, but the right to carry one anywhere equalizes the killing power of all.  That is exactly the kind of world we have created.  We are all made vulnerable by satisfying the lust for equal killing power.<br/><br/>Instead of making us stronger and safer, more guns just make us all weaker and more vulnerable.  The body count verifies that statement, especially when compared to the rest of the civilized world.<br/><br/>Trump and the others want more guns, guns everywhere.  That's like fighting forest fires by throwing gasoline on them.  <br/><br/>Guns everywhere has taken on the character of a fanatic religious movement.  It's spokespeople are the Mullas of the gun god.  Guns have moved from a right to a holy cause.  We worship guns.  We praise them.  We bow down to their power.  <br/><br/>Guns control us.  We no longer control them.  They are not our tools.  They have enslaved us by giving all the ultimate power to kill.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1464268463", "commentID": 18648046, "userID": 38331232, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18648046}, {"approveDate": "1464269710", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464271733", "permID": "18648409", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "A lot of Chicago’s problem stems from its identity as Chicago, not from the likelihood that this guy or that either will shoot someone or be shot by someone. Like so many northern metropolises of heft, they tolerate immense poverty which locks the most unable to compete gainfully in generational cycles of hopeless dependency and poverty that almost compels physical violence in response instead of being forced to scratch – possibly not even in Chicago, lessening the concentration there of the hopeless. It’s been fifty years now of a federal “war on poverty” that has done nothing to vanquish poverty or even substantially mitigate it in America, despite TRILLIONS spent on it. Chicago has one of the most intense social welfare frameworks in our nation, and one of the most unsustainable – that city is only NOT bankrupt because it says it’s not.<br/><br/>You’d think Chicago’s state would provide a useful lesson to Americans willing to open their eyes and see the truth.<br/><br/>But 462 dead and 1330 wounded? In a nation of 318-plus MILLION people with so MANY guns permeating our society? When 32,675 people DIED in 2014 as a result of auto accidents (Wikipedia)? Heck, the leading cause of deaths by accident in the home (6000 per year) is FALLS (U.S. News). And for this the editors clearly want to severely restrict the right of normal American citizens to lawfully own and use guns?<br/><br/>No wonder this argument isn’t developing legs: it’s not the N.R.A., guys; it’s just an unconvincing argument.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1464269654", "commentID": 18648409, "userID": 47123844, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18648409}, {"approveDate": "1464271349", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464267749", "permID": "18648024", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New England", "parentID": null, "userDisplayName": "Helium", "commentTitle": "<br/>", "commentBody": "Some people using illegally obtained guns are killing people therefore guns should be illegal. That makes no practical or logical sense. Stating this is not racist and not saying that black on black violence does not matter. It is saying that making guns harder/impossible to legally obtain will not alter or reduce this problem. Some proposals, background checks, are perfectly reasonable but the focus on \"the gun lobby\" is simply diversion (as is playing the racist card). It's always someone else's fault. Focus on the causes of violence not the tools.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6973/9789/cropped-69739789.jpg", "createDate": "1464268401", "commentID": 18648024, "userID": 69739789, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18648024}, {"approveDate": "1464271641", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464268041", "permID": "18647081", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "PA", "parentID": null, "userDisplayName": "Gerard", "commentTitle": "<br/>", "commentBody": "The problem is the lack of specificity. Every gun owner fears for their gun, and that is a too much fear to fight. We need a simple, clear proposal for the next Presidential term with a promise to stop ( legislation with no riders ). Make it part of the Democratic platform. Be clear: individuals have a right to own a gun, that right is not unlimited, these are the few limits we will enact this term - and no more. Make a start, but show restraint so as to earn trust.<br/>Then the gun owners fear will subside so that they can embrace reasonable change: no hunter needs an Uzi.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5288/6408/cropped-52886408.jpg", "createDate": "1464264970", "commentID": 18647081, "userID": 52886408, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18647081}, {"approveDate": "1464275890", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464275907", "permID": "18650275", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Ann", "commentTitle": "<br/>", "commentBody": "The word \"ordinary\" in the title says it all. Gun violence has become ordinary and systemic in America and seeing Trump at the recent NRA convention was chilling.  What are the psychological needs and imaginings behind gun ownership? What keeps us from looking at the results: murder, suicide, injuries, skyrocketing costs, and unabated public health crisis? The shattered lives, families, and communities? We need to find a better way to talk about this and stop seeing it as someone else's problem.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3171/3359/cropped-31713359.jpg?0.2981304870210938", "createDate": "1464275852", "commentID": 18650275, "userID": 31713359, "recommendations": 13, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18650275}, {"approveDate": "1464279479", "commentType": "comment", "userTitle": "NULL", "updateDate": "1464275879", "permID": "18651285", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Phoenix", "parentID": null, "userDisplayName": "CR Dickens", "commentTitle": "<br/>", "commentBody": "Rather than looking at the causes of the violence we look to the most easily identified solution  We’ll pick the tool.  I’m not in favor of gun control.  I support a realistic approach called personal responsibility.  Along with this unique approach, I prefer to look at the cause of the problem rather than a convenient solution that doesn’t work.<br/><br/>If we’re really interested in permanent solutions, we be working to resolve the problems with poverty, drugs, homelessness, and inequality.  There’s money to be made in each of these areas.  It’s like the cure for cancer.  It probably exists but no one in their right mind will kill a billion-dollar industry.  Poverty, drugs, homelessness, and inequality are worth billions of dollars a year as well.  No one wants to solve a problem that pays so well.<br/><br/>The problem with our society is greed.  As long as there’s a dollar to be made, the problems will continue…", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2160/4762/cropped-21604762.jpg?0.9020009574014693", "createDate": "1464279086", "commentID": 18651285, "userID": 21604762, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18651285}], "totalEditorsSelectionReturned": 10, "replyLimit": 3, "totalRecommendationsReturned": 10, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 296, "api_timestamp": "1488822351", "totalReplyCommentsFound": 154, "totalCommentsReturned": 10, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}