{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 10, "totalParentCommentsFound": 432, "totalEditorsSelectionFound": 11, "depthLimit": 0, "totalRecommendationsFound": 540, "comments": [{"approveDate": "1473235841", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473266135", "permID": "19712914", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "manhattan", "parentID": null, "userDisplayName": "minh z", "commentTitle": "<br/>", "commentBody": "There is a BIG difference between Trump University and the US State Dept.  The Sec. of State and and ex-President of the US, and other assorted officials that have the possibility of creating, changing or ignoring US law, using a charity to launder money and accept de-facto bribes from foreign officials and entities, among other \"donors\" is FAR more problematic.<br/><br/>Perhaps, when the NYT has run an exhaustive piece of news, that figures out the tainted and probably illegal relationships between Hillary, the Clinton Foundation, her employees, and assorted others, I'll take this seriously.  What has already come out isn't good for Hillary, or her record of making good judgement.<br/><br/>In the meantime, I'm more worried about a possible pay-for-play scheme by a major US government official, than a businessman's dealings about his for-profit school with a State AG.  Let's put things in perspective, NYT.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473211365", "commentID": 19712914, "userID": 65929609, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19712914}, {"approveDate": "1473252988", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249388", "permID": "19714611", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Iowa", "parentID": null, "userDisplayName": "painedwitness", "commentTitle": "<br/>", "commentBody": "Trump's use of the word \"university\" in the first place was illegal in New York.  It was not allowed to be used without state education department full and systematic examination of the program's quality, faculty, and accountability, etc.  A reputable college or university gives its student's credit that can be transferred to other institutions of higher learning. The real estate \"program\" used Trump's name, hype and misrepresentation to lure in students. Bondi's office had over 8,000 pages of records related to complaints about the \"program.\"  Since the press is treating Trump with kid gloves, it seems that voters are on their own to do the research using sources of information about Trump in recent books that have been written where one can find the references to document the information presented. Even in the reporting that has been done on the contributions to the attorney's general campaign funds, the press is skimming over the details.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473235069", "commentID": 19714611, "userID": 25530946, "recommendations": 331, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19714611}, {"approveDate": "1473253013", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249413", "permID": "19716351", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Venki S V", "commentTitle": "<br/>", "commentBody": "Congratulations on finally balancing out the coverage on Mrs. Clinton's woes with her mishandled email usage and the potential ethics issues with the Clinton Foundation!! Long over due. Your column has factually exposed the pay for play approach perfected by the \"Master of the Deal\" ! clearly, Mr. Trump popularised this term to hit Mrs.Clinton but he has been boasting about his exploits in this pay to get play game for quite sometime. Mr. Trump what's the difference between a Bahrain prince making a contribution and possibly seeking an audience with the then Secretary of State and his contribution to the Florida AG's campaign and gaining non pursuance of the cases against his defunct Trump University? There is indeed a big difference, the Clinton Foundation is engaged in worldwide philanthropy a fact that has been completely sidelined in the Effort to show this as a form of graft. Mr. Trump's giving is purely for business and political gain. This is quite possibly the tip of the iceberg and the Trump campaign is going to have a lot of explaining besides their usual hurling of vitriol or other clumsy finesse tactics. The pay for play culture is reeking through our system and those dwelling in glass houses including I suppose the Trump Tower should exercise care!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473250292", "commentID": 19716351, "userID": 75717905, "recommendations": 266, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19716351}, {"approveDate": "1473253200", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249600", "permID": "19714372", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Jim B", "commentTitle": "<br/>", "commentBody": "How very curious that the same Republicans who attack Clinton at the first hint of email 'smoke' are mute about Trump when the forest is aflame. There are plenty of conservatives who are certain, absolutely sure, that the media is so left-wing, so biased that Hillary is 'getting a pass on all her corruption...' Meanwhile, Trump's baseline behavior is so base, so vile, so mendacious that a little illegal campaign contribution, a little smoky appearance of 'quid pro quo' goes unremarked. No Republican House members are clamoring for a special prosecutor, or another, yet another, committee investigation into Trump's questionable activities. Even though in other states Trump's \"University\" has been indicted as the scam it was everywhere... When Republicans wonder, in their next 'post mortem' why the electorate has become so cynical that it selects Trumpism instead of another 'establishment' Republican, perhaps they should examine the mirror closely and look for rampant hypocrisy. The voters are tired of wealthy powerful people getting a different standard of behavior, a different set of 'rules of law' than the ordinary people. Clinton's trustworthiness is attacked for exactly this, whether there is evidence of it or not. Despite overwhelming evidence, Trump is getting a pass - he's so terrible that the merely unsavory, the ordinary 'way it is' corruption isn't even noticable by the press. Imagine the cronyism and venality of a Trump administration.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473228310", "commentID": 19714372, "userID": 59003930, "recommendations": 420, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19714372}, {"approveDate": "1473253383", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249783", "permID": "19715514", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland, OH", "parentID": null, "userDisplayName": "Peter Friedman", "commentTitle": "<br/>", "commentBody": "Bondi was merely doing what Chief Justice John Roberts, in Williams-Yulee v. Florida Bar, wrote that they are expected (and therefore legally permitted) to do--accept contributions from people to whom they then are \"appropriately responsive\" : \"Politicians are expected to be appropriately responsive to the preferences of their supporters. Indeed, such 'responsiveness is key to the very concept of self-governance through elected officials.'\" The day the Court equated money and \"speech\" was the day we accepted the sale of our democracy to the wealthy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473246534", "commentID": 19715514, "userID": 61691904, "recommendations": 352, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19715514}, {"approveDate": "1473253403", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1473249803", "permID": "19713868:19715524", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Alan Behr", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kentucky", "parentID": 19713868, "userDisplayName": "Wanda", "commentTitle": "<br/>", "commentBody": "Well, it WAS kind of obvious that Clinton had not paid off Comey, right? The Clinton Foundation's tax returns are posted online at the Foundation website, as required by law. Mrs. Clinton's personal tax returns are also available. Her speaking fees? In line with most celebrity politicians, including her husband, the Bushes, and (ahem) Mr. Trump. <br/><br/>Clean hands? Maybe not. But at least in most cases, they are outstretched so we can inspect the fingernails. So far Mr. Trump has been in the position of casting stones while the curtains to his own glass house are drawn and a wall at least metaphorically placed around his affairs.<br/><br/>Where are those tax returns? ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6259/8365/cropped-62598365.jpg?0.5856720004880508", "createDate": "1473246636", "commentID": 19715524, "userID": 62598365, "recommendations": 502, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19715524}, {"approveDate": "1473253514", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249914", "permID": "19714959", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "West Hollywood, CA", "parentID": null, "userDisplayName": "DK", "commentTitle": "<br/>", "commentBody": "If the press were ethical, this editorial would have been written months ago. The facts of these bribes have not changed. But the intellectually-lazy corporate media is wedding to its preferred evil Hillary narratives. So that means endless \"investigations\" into Hillary nonscandals leading nowhere. From Whitewater, to Benghazi, to emails, to the Clinton Foundation, Hillary has been exonerated over and again. Yet, \"liberal\" media hacks keep pushing right wing smears while actual incidences of Republican wrongdoing get merely a passing glance -- e.g the 3 million emails deleted Bush administration emails including *all* of Colin Powell's emails; or terrorist attacks under GOP Presidents that left far more dead; or Trump's bigotry, constant lies, debt to Chinese and Russian oligarchs, and endless scams.<br/><br/>Unlike the Bush and Trump family foundations, the Clinton Foundation is a real charity saving lives across the world. Hillary's life work -- from anti-segregation investigations for the Children's Defense Fund to securing health insurance for millions of kids to making support for gay rights worldwide official US diplomatic policy -- has actually saved lives. But media hacks want to talk carry water for right wing conspiracy theories about coughing and emails, so now voters think a orange thug who retweets racist neo-Nazi propaganda is more honest than Hillary Clinton. Shame on the American press and its dereliction of duty.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473241746", "commentID": 19714959, "userID": 60208644, "recommendations": 616, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19714959}, {"approveDate": "1473253552", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473249952", "permID": "19714282", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "chris", "commentTitle": "n/a", "commentBody": "Incredible that it's taken this long to report the obvious. All this \"pay to play\" innuendo about the Clinton foundation that has actually, verifiably donated millions of dollars to humanitarian causes, while there is readily available concrete evidence that Trump actively bribed a sitting state Attorney General and almost walked with 6 million in donations to veterans before the Washington Post called him out.  Where's the objectivity, hard reporting in this election? Sorely lacking for the sake of the horse race and ratings.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473226476", "commentID": 19714282, "userID": 67685221, "recommendations": 524, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19714282}, {"approveDate": "1473259122", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473255522", "permID": "19717604", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Georgia", "parentID": null, "userDisplayName": "Annie Dooley", "commentTitle": "<br/>", "commentBody": "The collusion of wealthy business people and politicians for their mutual benefit is nothing new, which is why we have laws against bribery, limits on campaign donations, requirements for competitive bidding of government contracts, and other anti-corruption laws. It is also a major reason respect for law by those on the lower rungs of society is lacking. While these high level, political white collar crimes are rarely prosecuted and even more rarely result in convictions and jail time, our jails are filled with the shoplifter, the petty thief,  the drug addict, and the welfare cheat.  We know there is a double standard of justice, one for the rich and well-connected and another for everyone else. What do we do with that knowledge? At the very least, we don't elect one of them who claims to be \"the law and order candidate\" to be our president. And we can stop according so much automatic respect to any wealthy business person. It should matter how they got their wealth. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473255302", "commentID": 19717604, "userID": 60072706, "recommendations": 111, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19717604}, {"approveDate": "1473259192", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473266090", "permID": "19717683", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "atlanta", "parentID": null, "userDisplayName": "DP", "commentTitle": "<br/>", "commentBody": "Just the latest example of how money pervades and degrades our political system.  Watch the recent HBO story about money in politics directed by Alexandra Pelosi. Lobbyists write legislation and donors contribute massive sums of money to both Democrats and Republicans. Our elected officials at all levels of government spend much of their time fundraising.<br/><br/>Nevertheless, Donald Trump's sleazy political contributions and history of fines and abuses connected to campaign contributions as a private businessman don't quite equate to a member of President Obama's administration and the Secretary of State engaging in borderline ethical behavior with those currying favor with the US State Department.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473255597", "commentID": 19717683, "userID": 27485914, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19717683}, {"approveDate": "1473264997", "commentType": "comment", "userTitle": "NULL", "updateDate": "1473261397", "permID": "19716097", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MI", "parentID": null, "userDisplayName": "mj", "commentTitle": "<br/>", "commentBody": "There is something fundamentally wrong with a system that allows a person as corrupt, crazy and complicit as Donald Trump run for President, imagining that \"the people\" will be clever enough to stop him. <br/><br/>Forget about everything else. How can a person with the ties Trump has to Russia actually be in the running for POTUS? There should be some check and balance to at least investigate the situation if not out and out stop him. He is a danger to not only national security for the security of the planet. <br/><br/>What exactly would he have to do for someone (CIA perhaps) to say, \"Hey this guy isn't fit. He's a criminal.\"?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1473249223", "commentID": 19716097, "userID": 29419789, "recommendations": 110, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19716097}], "totalEditorsSelectionReturned": 11, "replyLimit": 3, "totalRecommendationsReturned": 11, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 681, "api_timestamp": "1488822341", "totalReplyCommentsFound": 249, "totalCommentsReturned": 11, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}