{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 19, "totalParentCommentsFound": 494, "totalEditorsSelectionFound": 20, "depthLimit": 0, "totalRecommendationsFound": 514, "comments": [{"approveDate": "1470704588", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470756201", "permID": "19425930", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 116, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "The editors must have listened to a different speech than the one I heard.<br/><br/>Trump wants to cut taxes to spark an economic recovery, and specifically drop the corporate tax rate to 15%, which would make us hyper-competitive with ALL industrialized nations and likely would put an end to corporate inversions. Similarly, he wants to de-emphasize the excessive regulation we have imposed on our industry and commerce for the entirety of the Obama administration, that has cost us economic growth and middle-class jobs. Finally, he sympathizes with the arguments of labor that our trade arrangements are unbalanced to the favor of our trading partners while they damage our own vital interests.<br/><br/>He won't lose a single vote that was up for the taking for these positions, and may attract a ton of votes that without this speech might have gone to Mrs. Clinton.<br/><br/>Leave the country isolated from the world? In point of fact, no -- our corporate taxes are among the very highest in the industrialized world, make us uncompetitive and incentivize our companies to bolt; our regulation is stifling expansion and job-creation; and free trade policies have played their role, along with offshoring and automation, in hollowing-out our middle classes. And the rest of \"the world\" is hardly healthy -- their tax and regulatory frameworks have a great deal to do with their sorry state.<br/><br/>But I can understand the concern: whenever Trump talks sense rather than erupting over some sleight, his numbers go up.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1470704572", "commentID": 19425930, "userID": 47123844, "recommendations": 65, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19425930}, {"approveDate": "1470727117", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470723517", "permID": "19425749", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "Trump's first-day plans including ripping up existing trade agreements and putting a moratorium on any new regulations.  Both are alarming.  No one can honestly believe that tearing up paper will change the existing global economy, or that a symbolic act will revive lost jobs.  And how can a President declare no new regulations without even seeing what they are or what the need would be.  Today's speech in Detroit is more closed-minded Trump talk, highlighting how simplistic his thinking is, and how cynical he is to give false hopes to those suffering financially. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470703362", "commentID": 19425749, "userID": 40118532, "recommendations": 336, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19425749}, {"approveDate": "1470731848", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470728248", "permID": "19426155", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fort Worth, TX", "parentID": null, "userDisplayName": "nkda2000", "commentTitle": "<br/>", "commentBody": "For over a year, I have heard Trump preach to his followers that he is looking out for their interests.<br/><br/>Now that Trump has finally revealed the details of his economic plan, it is obvious that Eliminating the Estate Tax is another standard Bait and Switch Republican tactic.  Elimination of the Estate Tax helps the upper part of the Top 1% without any impact on helping the average middle class taxpayer.<br/><br/>As Trump gradually reveals more details of his economic plans, Trump demonstrates he is just another politician bowing to the demands of special interests, the rich and powerful.  More tax cuts for the rich and Trickle Down Economics hasn’t worked before and certainly won’t work to boost the economy or bring jobs back to the US.  <br/><br/>If Trump supporters can’t see this deception now, they will be devastated by a “President” Trump later.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470706160", "commentID": 19426155, "userID": 56845759, "recommendations": 433, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426155}, {"approveDate": "1470732031", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470728431", "permID": "19426188", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Aggieland, TX", "parentID": null, "userDisplayName": "Historian", "commentTitle": "<br/>", "commentBody": "Conservatives correctly point out that U.S. corporate tax rates are among the highest in the world, but they don’t tell the rest of the story. There are so many loopholes that 26 firms, among the Citigroup and AT&amp;T, paid more to their CEO alone than they paid in corporate taxes in 2011. In fact, our corporate tax revenue, 1.8 percent of GNP, is tied with Turkey for the lowest in the developed world. If libertarian models are correct, our current corporate tax structure manages to achieve the worst of all possible worlds: the least revenue and the most economic distortion from attempts to dodge it. We need to lower the nominal rate, but also to devise policies that assure it is actually paid. For starters, restore the old rule on offshoring that requires any corporation with less than 50 percent foreign ownership to be taxed as American.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470706444", "commentID": 19426188, "userID": 62428556, "recommendations": 484, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426188}, {"approveDate": "1470732359", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470728759", "permID": "19426251", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Dave S", "commentTitle": "<br/>", "commentBody": "For all the populist talk, its standard Republican trickle down fare that will NOT benefit typical workers.  Expanding low tax rates to \"pass thru\" taxpayers puts Trump himself right at the top of the list of beneficiaries.  if Trump had any substance he would propose comprehensive tax reform.  He's right the tax code should be simplified and regulations reduced where possible. But not by reducing brackets.  If he really were creative he'd suggest a Value Added tax to facilitate income tax reduction, deficit reduction and infrastructure spending.  The con continues.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470706887", "commentID": 19426251, "userID": 3559019, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426251}, {"approveDate": "1470735923", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470732323", "permID": "19426462", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westchester", "parentID": null, "userDisplayName": "M. Gessbergwitz", "commentTitle": "<br/>", "commentBody": "I love how the NYT Editorial Board tries to scare us about how Trump putting a 45% tariff on Chinese goods will start a trade war. The US is already in a trade war with China (and many other countries).<br/><br/>China steals our intellectual property, unfairly subsidizes numerous businesses, slaps steep tariffs on US goods, and forces US companies wanting to do business in China to start a 50/50 venture with a local Chinese venture.<br/><br/>What's worse is that those benefiting from this status quo refuse to acknowledge the ongoing trade war – why would a profiteer bite the hand that feeds? Meanwhile, millions of Americans have lost good jobs and are told by said elites to get an education and stop being so ignorant.<br/><br/>Trump is openly addressing unfair trade practices and the extreme frustration it has caused, and has been doing so since the 80s – coincidentally when the US income distribution started to become so unequal. That's why he struck a nerve with a significant amount of Americans, and will continue to have a large and loyal fan base no matter how many gaffes he keeps on making.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470708529", "commentID": 19426462, "userID": 67690668, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426462}, {"approveDate": "1470736123", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470732523", "permID": "19426477", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Glen", "commentTitle": "<br/>", "commentBody": "No one, other than Donald himself, has said that Trump is the brightest bulb in the GOP Theater marquee.  The brashest, yes.  But dim nonetheless, sputtering, sparking and making noise where a proper bulb goes silently about its work.  Besides, he was reading from script that was obviously written without his input.  It was, after all, in complete sentences...not a Trump trademark...and haltingly delivered instead of the rapid-fire, off-the-cuff stream of consciousness that his fans adore.<br/><br/>This is a man who bankrupted not one or two or even three but four, count'em, f-o-u-r casinos, which are private businesses all but licensed to print money.  In the long run, under even modestly competent management, there is no excuse for a casino to lose money, let alone so much it must declare bankruptcy.  Were Donald Trump such a good money manager, he wouldn't need so much of it.  If he were one percent as good as he says he is, he would have his tax returns printed, bound and junk-mailed to every valid address in the country.  This man is not proud of the truth about himself, only of the myth he has propagated, and wants you to believe he believes.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6760/7286/cropped-67607286.jpg?0.35638952255249023", "createDate": "1470708697", "commentID": 19426477, "userID": 67607286, "recommendations": 572, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426477}, {"approveDate": "1470736236", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470732636", "permID": "19426513", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dallas, TX", "parentID": null, "userDisplayName": "A. Stanton", "commentTitle": "<br/>", "commentBody": "I liked Mr. Trump a lot better when he was up there on his feet spouting lies and incoherent gibberish about Muslims, Hillary and Obama. The Trump I watched<br/>this afternoon reading somebody’s else’s words looked like he was reading straight out of the Detroit telephone directory -- lifeless, positively bored, wanting desperately to be in another place and as if his heart just plain wasn’t in it.<br/><br/>If you asked him to amplify on anything he had just said, he wouldn’t be able to do it if his life depended on it. Meaning, of course, there would be no way of holding him to account later for any of it,  He would, however, still be prepared to insult Mrs. Clinton profusely.<br/><br/>Somebody please give me back my old Donald -- the one who is all hell-fire, brimstone and rants -- and please spare me all this pious talk about his temperament and rationality. What I want and need from now until election day is the guy known as Mr. Entertainment, AKA Mr. Crazy.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3518/6053/cropped-35186053.jpg", "createDate": "1470708959", "commentID": 19426513, "userID": 35186053, "recommendations": 164, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426513}, {"approveDate": "1470740143", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470736543", "permID": "19426693", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new Jersey", "parentID": null, "userDisplayName": "Babel", "commentTitle": "<br/>", "commentBody": "Here is what people hear when Trump makes his economic and military proposals. <br/><br/>1.  I am going to get a nice tax cut.<br/><br/>2.  Our military will become even more powerful and that will solve our problems with terrorism.<br/><br/>3.  All our roads, bridges, and airports will drastically improve.<br/><br/>4.  Many regulations will be cut, because they hold us back from prospering.<br/><br/>5.  Medicare and social security will not be changed or have any reforms instituted. <br/><br/>If you wonder how Trump was able to lure in so many naive investors into his business projects and then leave them high and dry, watch how many people will be sky high enthusiastic about these unrealistic proposals.  The Master of Debt has struck again and this time it will not be a small group of investors left holding the bag, it will be the entire country. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470710335", "commentID": 19426693, "userID": 48307985, "recommendations": 422, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426693}, {"approveDate": "1470740335", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470736735", "permID": "19426751", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "Doug Terry", "commentTitle": "<br/>", "commentBody": "Trump's proposals are an idiotic combination of gifts to the multi-million dollar class and just plain silliness. People who buy into such a mishmash of \"bold\" proposals obviously don't take the time to understand them. Trump is gunning for a protest or a movement vote, perhaps better said as merely a movement of protest, people who look on the world with Fox News inspired discontent and say to themselves, \"There must be something better\", without knowing what that better might be.<br/><br/>Trump has uncovered the dark truth in American politics: having slept through civics class and been bored to tears in history, having failed to obtain the left/right education that the threat of communism forced on Europe, many, if not most Americans are infinitely ignorant of what it is government does and how stability in the world is obtained. He's trying to sell bananas to people who live on a banana plantation, telling them all the while it is something new, great, wonderful, unbelievable.<br/><br/>Bringing jobs back to America is a serious undertaking and, so far, the political establishment of both parties has been afraid to take on the task because their rich clients supporting them are raking in billions from outsourcing and downsizing. Trump has no more prospect of solving this problem than a sparrow does of flying to the moon. It will take hard work and dedication to rebuild America and a failed casino operator is hardly the guy for the job.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6545/5323/cropped-65455323.jpg", "createDate": "1470710800", "commentID": 19426751, "userID": 65455323, "recommendations": 297, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426751}, {"approveDate": "1470743425", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470739826", "permID": "19426839", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cologne, Gemany", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "Dear Donald:<br/><br/>The majority of your working-class supporters have moved past the tax cuts for the rich.  Unemployed miners and factory workers in Michigan, Pennsylvania, Ohio, Upstate New York and elsewhere really don't think that the 10%ers have it too hard.  Their biggest concern is not that people with more than $5 million can pass it along to their children tax free.<br/><br/>By the way, most of those 10%er Republicans aren't supporting you anyway.  (And the 10%er Democrats despise you.)<br/><br/>Time to move on.<br/><br/>Sincerely, <br/><br/>A reluctant, still tentative supporter", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470711583", "commentID": 19426839, "userID": 72599185, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19426839}, {"approveDate": "1470750953", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470747353", "permID": "19430284", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "IL", "parentID": null, "userDisplayName": "blackmamba", "commentTitle": "<br/>", "commentBody": "Donald Trump's is a businessman once again giving us the business. And Trump's business is the mass media entertainment selling of Trump.  Trump is a combination of a Master of Ceremonies and Ring Master who had the wisdom, merit and qualifications to be born a \"prince\" to a multimillionaire father.<br/><br/>Mr.Trump has resurrected the economic game plan of Republican Saint Ronald Wilson Reagan who promised that America can cut taxes, increase military spending and preserve government entitlement programs because neither deficits nor debt matter and this is America and we are Americans. The socioeconomic equivalent of going to Heaven without the inconvenience of either dying or living a morally accountable life. Trump lacks Ronald Reagan's acting, political and rhetorical talents or experience. <br/><br/>American tax policy provides deductions, credits and lower tax rates. But only for certain industries, transactions, sources of income, business entity structures, contracts and securities favored by special interests lobbyists and their compliant legislative and executive puppets. Thus, the nominal corporate tax rate is not the real effective corporate tax rate. Nor do plutocrat oligarchs pay their nominal tax rate. Moreover, America is not a business. America is a divided limited power democratic republic nation state. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470749732", "commentID": 19430284, "userID": 17374907, "recommendations": 43, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19430284}, {"approveDate": "1470750986", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470747386", "permID": "19428794", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florianopolis, SC", "parentID": null, "userDisplayName": "Uzi Nogueira", "commentTitle": "<br/>", "commentBody": "On the trade issue, Trump's protectionist proposal will certainly make America Great Again. That is, circa the 1930s. In fact, his proposal has failed again and again in Brazil. It is called import substitution. <br/><br/>Economic policy decisions create winners and losers. The winners in Trump's blueprint program will be hundred of thousands of (expensive) jobs created by trade barriers. <br/><br/>The losers will be economic efficiency and millions of consumers paying for high priced products or services.  <br/><br/>Besides, Donald's protectionist trade approach will make losers US multinational corporations. The main engine of wealth creation and prosperity since WWII. <br/><br/>US corporations main competitive advantage i.e., allocating resources efficiently in the global production chain will be lost.  Beijing welcome such a gift delivered from America.   <br/><br/>In sum, there are no magical solutions to maintain the current global integration model while raising wages to 1960s levels.     ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5996/0191/cropped-59960191.jpg?1553874359411832178", "createDate": "1470742437", "commentID": 19428794, "userID": 59960191, "recommendations": 32, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19428794}, {"approveDate": "1470752096", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470748496", "permID": "19430466", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Michigan", "parentID": null, "userDisplayName": "EB", "commentTitle": "<br/>", "commentBody": "I'm a college student. That puts me in a position to have a lot of expectations. I expect that I will be able to find a job and affordable housing will be available nearby. I expect that, when I am older, I won't have to fear for the future of young people on our planet. I know that America has always been able to engineer new solutions to our daunting problems, be they transcontinental transportation, world war, incurable diseases, racial and social injustice, or even climate change. I expect that our leaders see the magnitude of these challenges and face them head on, unafraid to unleash the American engine of progress and ingenuity to drive us further forward.<br/><br/>Here stood Donald Trump, in Detroit—the city that powered America through the 20th century with automobiles, bombers, pioneering medical breakthroughs; the city that rioted for civil justice, that later fell on hard times—in my state, and what said he? Cut corporate taxes! Repeal the estate tax! Revolutionize energy by returning to the 1950s! Wall ourselves off from the world!<br/><br/>This is the city that took in Greeks and Chinese, Poles and Chaldeans, Mexicans and blacks from the South. We have never looked inward, and never looked back. We opened our arms and said \"Together, we will make America. We will be America.\" America does not stand for what Donald Trump says. Detroit does not stand for what Donald Trump says. If he wants to Make America Great Again, he should ask Detroit how: by relentlessly looking forward.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470750460", "commentID": 19430466, "userID": 75000509, "recommendations": 101, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19430466}, {"approveDate": "1470752282", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470748682", "permID": "19428528", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Danbury CT", "parentID": null, "userDisplayName": "Izzy", "commentTitle": "<br/>", "commentBody": "I could not say it better than the Pope:<br/><br/>\"Some people continue to defend trickle-down theories which assume that economic growth, encouraged by a free market, will inevitably succeed in bringing about greater justice and inclusiveness in the world. This opinion, which has never been confirmed by the facts, expresses a crude and naïve trust in the goodness of those wielding economic power and in the sacralized workings of the prevailing economic system.  Meanwhile, the excluded are still waiting.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470740730", "commentID": 19428528, "userID": 39217228, "recommendations": 90, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19428528}, {"approveDate": "1470752664", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470749064", "permID": "19428790", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Oak Park, IL", "parentID": null, "userDisplayName": "Howard Larkin", "commentTitle": "n/a", "commentBody": "Of course the central proposal is huge tax cuts. Once done, nothing else will matter. There just won't be any money available for Social Security, Medicare, education, child care, infrastructure repair or enforcing any law or regulation. In other words starve the beast. Just the same old Republican same old from the \"revolutionary\" Donald Trump.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470742399", "commentID": 19428790, "userID": 42168445, "recommendations": 71, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19428790}, {"approveDate": "1470752684", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470749084", "permID": "19428665", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Petersburg, Michigan", "parentID": null, "userDisplayName": "Patrick Nedry", "commentTitle": "<br/>", "commentBody": "Anytime conservatives dust off a version of their supply side/trickle down tax theories to try to make a rickety old two-wheeled bicycle look like a Seqway needs to look at the experience in Kansas.  This isn't theory--it is application, big time.  And, businesses did not dramatically expand or uproot from the other 49 states in a 21st Century version of the land rush to move to Kansas.  The tax policies of the Governor Sam Brownback &amp; Company have been a complete failure--a failure that was finally rejected by the bulk of the electorate in Kansas last week.  <br/><br/>Mr. Trump and his handlers want to bring this experiment to a national level.  The funk of 2008-2010 will look like halcyon days of economic progress if that happens.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470741645", "commentID": 19428665, "userID": 76194887, "recommendations": 72, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19428665}, {"approveDate": "1470752702", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1470749102", "permID": "19429400:19430683", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Len Charlap", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "boyd", "parentID": 19429400, "userDisplayName": "tom", "commentTitle": "<br/>", "commentBody": "People do not have enough money to spend. That is one of the declarations that was made in the above. What can the government do? FDR saw a problem in the 30s with the farmers not getting anything for their crops. FDR actually did something about it. He advocated for an inflationary policy so farm commodity prices would rise. It worked.<br/>    Government can do something to put more money in people's pockets. It's not tax cuts, it's empowering the working class by being amenable to a higher minimum wage and also to encourage and recognize the good that collective bargaining can add to the workplace and the people who are in it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470751359", "commentID": 19430683, "userID": 65377990, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19430683}, {"approveDate": "1470752750", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470749150", "permID": "19430869", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "PA", "parentID": null, "userDisplayName": "Gfagan", "commentTitle": "<br/>", "commentBody": "Drumpf's big \"new\" economic agenda is to cut taxes and regulations.<br/>Sounds familiar, doesn't it?<br/>It's been the GOP mantra since Reagan and it helped destroy the economy and bring us to this feudal place of obscene income and wealth inequality. Turns out, when you cut rich people's taxes, they don't go on hiring sprees (at least not in the USA) -- they pocket the cash.<br/>Drumpf/the GOP's ideas have been put into full effect in Kansas, and the state is now ruined.<br/>Meanwhile in California, which rid itself of the Republican plague entirely, the economy is booming under the hideous \"tax-and-spend\" liberalism we've all been trained by decades of propaganda to despise.<br/>Drumpf's \"new\" economic agenda is more of the GOP same.<br/>Can the cause be the cure? I don't think so.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3911/6703/cropped-39116703.jpg?0.41520609939470887", "createDate": "1470752028", "commentID": 19430869, "userID": 39116703, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19430869}, {"approveDate": "1470759657", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470756057", "permID": "19431358", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": null, "userDisplayName": "Jim", "commentTitle": "n/a", "commentBody": "Has he announced when he will bring his own businesses back to the states?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470753832", "commentID": 19431358, "userID": 20624509, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19431358}], "totalEditorsSelectionReturned": 20, "replyLimit": 3, "totalRecommendationsReturned": 20, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 815, "api_timestamp": "1488822374", "totalReplyCommentsFound": 321, "totalCommentsReturned": 20, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}