{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 17, "totalParentCommentsFound": 570, "totalEditorsSelectionFound": 17, "depthLimit": 0, "totalRecommendationsFound": 594, "comments": [{"approveDate": "1438926366", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438966196", "permID": "15711477", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Conway, SC", "parentID": null, "userDisplayName": "Mr. Robin P Little", "commentTitle": "<br/>", "commentBody": "<br/>Nate, you  are a numbers guy, a facts guy. When it comes to debate performance opinions, anybody who saw it, or listened to it, can weigh in, and we will get saturated with opinions in the next few days. Everybody will see their favorite as either not scuttling their chances, or advancing the ball some small distance down the field in a game not over for 15 more months. Percentages of audience applause reactions to each candidate would be nice here, but not very meaningful.<br/><br/>That Jeb Bush has not found his voice after months of trying shows a real weakness in his candidacy, one more pronounced than I would have thought. But he is still the only candidate of the 17 with any real shot at picking off Hillary Clinton, and I'm guessing he won't succeed in his quest. <br/><br/>Rubio is the only other candidate who even comes close to having the sort appeal, decency and moderate views needed to be elected President, and even he falls far short in many of the necessary categories, including organization and money. Bush has both. What he doesn't have is enough fire in his belly, but this can be manufactured, at least to a point. The fact that his wife dislikes the game of politics may be the most telling flaw in his candidacy. In 2016, Presidential politics is still a family sport. This is part of what makes Hillary Clinton so formidable. His name is Bill. Hillary, in; Jeb, out.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2988/3919/cropped-29883919.jpg?0.8387338654138148", "createDate": "1438926359", "commentID": 15711477, "userID": 29883919, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15711477}, {"approveDate": "1438948854", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438945254", "permID": "15712802", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Fred", "commentTitle": "<br/>", "commentBody": "And the winner is... Fox News.  Can't recall a time when I watched that channel for more than 15 minutes.  On stage besides the Donald only Kasich came across as sincere and thoughtful and deftly yielded home field to his advantage.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438945302", "commentID": 15712802, "userID": 63428370, "recommendations": 346, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15712802}, {"approveDate": "1438949358", "commentType": "comment", "userTitle": "NULL", "updateDate": "1439660677", "permID": "15713226", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 34, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Norwalk, CT", "parentID": null, "userDisplayName": "historylesson", "commentTitle": "<br/>", "commentBody": "What is most disturbing about this column is the total lack of discussion about the horrific things a bunch of men said about women's lives and health. Mr. Cohn, do you have any idea what it is like to listen to these men pontificate about pregnancy termination, and women's right to live?<br/>Forget Trump's vicious remarks about the way women look. He's no physical prize himself, and ugly remarks about a woman's appearance may wound, but they don't kill.<br/>Last night a candidate said he believed in no exceptions for abortion, not even when the life of the mother is at risk. Do you have any idea of the enormity of<br/>that statement? What is says about Walker's humanity? Yet you pick him as a winner? Forget outrage for a minute -- where is your acknowledgement of this issue, and what those ten men said? Especially since you state the outcome of the debate \"depends a lot more on how the news media covers the debates than the performances themselves.\"<br/>Well, you're news media. You covered this debate by failing to mention that Walker prefers to let women die than end a life threatening pregnancy.<br/>Walker's answer re abortion was \"concise and sharp.\" Which seems to matter more to your analysis than the lives of women.<br/>What I saw last night was ten men thoroughly ill-equipped to run our nation.<br/>What you watched seems to be an entirely different show.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438947938", "commentID": 15713226, "userID": 47229657, "recommendations": 1734, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15713226}, {"approveDate": "1438949475", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438945875", "permID": "15713346", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "jpduffy3", "commentTitle": "<br/>", "commentBody": "It was a start on getting things out there for discussion in real terms.  Ideally, it will not be the end of the process which should continue in a robust manner.  Let the best ideas get before the public, and let the public decide what they want to have in their leaders.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438948491", "commentID": 15713346, "userID": 36458645, "recommendations": 12, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15713346}, {"approveDate": "1438949568", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438966689", "permID": "15713108", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Smithtown, NY", "parentID": null, "userDisplayName": "David H. Eisenberg", "commentTitle": "<br/>", "commentBody": "It depends on who is being polled. If you go to Drudge, Trump creamed everyone - 51% to Cruz next around 12% and everyone else a tiny fraction (I think almost everyone watching the earlier debate thought Fiorina stood out). But, if you take a poll of people across the political spectrum, you might find that he did not do as well. It certainly did not hurt him with his supporters, but, the question always is - how'd he do with swing voters? <br/><br/>In my own perspective, just looking at who I thought came across well and thinking I'm being fair (don't we all), I thought Christie and Kasich did best and Paul and Trump worst, but that may have be completely different than how it came across to most people. We'll know soon enough.<br/><br/>As for Trump, his style of frankly and refreshingly acknowledging what might seem to most of us as a bad position -  name calling, bankruptcies, buying favors and his refusal to stay with the party if he isn't treated with \"respect\" (in other words, it's about him, not the party) are sometimes amazing in their illogic but work for a lot of people because they see him as telling the truth. Sometimes, of course, he is just making stuff up (his so-called investigations into Obama's birth records and alleged evidence garnered about the border). That doesn't seem to matter to some are fed up with politics and politicians. <br/><br/>If you ask me - Kasich and Fiorina would be the best choices for the party right now. I thought they helped themselves the most. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5118/5127/cropped-51185127.jpg?0.06334015138636656", "createDate": "1438947300", "commentID": 15713108, "userID": 51185127, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15713108}, {"approveDate": "1438953431", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438949831", "permID": "15713961", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "Simon Sez", "commentTitle": "<br/>", "commentBody": "My husband and I watched the entire debate. He has sworn he would never vote for a Republican. I never have but you never know so I try to keep an open mind.<br/><br/>We both enjoyed the debate which, as another article in today's NYT headlined, showcased the Donald. Unlike this writer, I believe that Mr. Trump will and is already getting maximum media attention from his appearance and that it will only help him in polls and primaries. Witness today's above the fold adulatory article in this newspaper for starters.<br/><br/>As many have said and other candidates last night mentioned, he is tapping into a sea of untold anger with politicians, Washington, and political correctness ( btw, when he was asked about calling women “fat pigs,” “slobs” or “disgusting animals\" he immediately quipped, \" I was referring to Rosie O'Donnell.\" This was not mentioned in the NYT article today.).<br/><br/>I do not support any of the GOP contenders but I would not write the Ego off that quickly. The first Republican primaries are in February and I will closely follow the antics and polls between now and then. <br/><br/>Of all the speakers, Mr. Kasich came across to both of us as the most sincere and reasonable. We agreed that in the unlikely event we would vote Republican we would support him above the others.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438951280", "commentID": 15713961, "userID": 2838061, "recommendations": 175, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15713961}, {"approveDate": "1438957899", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438954438", "permID": "15715843", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlotte, North Carolina", "parentID": null, "userDisplayName": "JT NC", "commentTitle": "<br/>", "commentBody": "The same old Republican orthodoxy from all of the \"top tier\" candidates with the partial exception of John Kasich who tried to show some minimal degree of humanity.  Otherwise no diversity of views among ten candidates, except for the somewhat fake fireworks between Christie and Paul on the NSA programs.  Rubio just repeats the same old shopworn Republican talking points -- move on folks, nothing new here.  Walker is in favor of women being forced to carry fetuses which are the product of rape or incest --- or even die -- and the audience appeared to be OK with that!  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438957690", "commentID": 15715843, "userID": 69388449, "recommendations": 263, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15715843}, {"approveDate": "1438960071", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438956471", "permID": "15716232", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "U.S.A.", "parentID": null, "userDisplayName": "JL", "commentTitle": "<br/>", "commentBody": "I disagree with much of this analysis.  Trump was entertainment pure and simple and in his crude manner gave as good as he got-- he has reached the zenith of his appeal.  Bush had an average night but given his other mainstream advantages he remains the likely candidate.  Walker came across as a bit dim witted and will soon fall away.  Rubio had a strong night and the Bush-Rubio dynamic will be interesting to watch as the campaign unfolds.  Christie had a pretty good night but he is not candidate with national appeal.   Kasich had a very good night and should rise in the polls.  Huckabee, Paul, Cruz and Carson did not impress and should drop out soon.  I predict a Bush-Fiorina ticket. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438958855", "commentID": 15716232, "userID": 63594194, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15716232}, {"approveDate": "1438960402", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438956802", "permID": "15716341", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Potomac, MD", "parentID": null, "userDisplayName": "Lianna", "commentTitle": "<br/>", "commentBody": "By not running far to the right like many of the other candidates on stage, I think that John Kasich proved he was the only one that could appeal to moderate democrats, independents, and republicans; thus making him the most viable candidate for the general election, but the least likely to win the GOP nomination. By not getting caught up in the name-calling/Benghazi/e-mail foolishness that some of the other candidates were distracted with, Kasich was able to eloquently tell the American people of his accomplishments. His heartfelt response about gay marriage seemed to resonate with many. <br/><br/>The republican base is too caught up in hearing about what Hillary Clinton did and could care less about hearing what their candidates will do; which is why Kasich stands no chance unless he starts to call Hillary a pant suit wearing devil. The one who spews the most vitriol at Hillary will win. Issues are not of any importance to GOP voters easily distracted by shiny, new objects like Donald Trump. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438959226", "commentID": 15716341, "userID": 65368659, "recommendations": 156, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15716341}, {"approveDate": "1438961062", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438957462", "permID": "15716549", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "OrtoAzia", "commentTitle": "<br/>", "commentBody": "Had to look up FoxNews on my channel line-up for this debate. They didn't disappoint. While I will never vote Republican and some of the things the candidates said on women and God were shocking, the debates gave an average republican voter a pretty good sense of real candidates (not the headline versions of them). In my humble and outsider opinion Kasich, Rubio, Trump, and Bush looked like contender (Trump for less substantive and more 'struck the nerve' reasons, but nevertheless). Of these four Kasich helped himself the most. He looked like a relatable and sensible guy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438959977", "commentID": 15716549, "userID": 10739370, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15716549}, {"approveDate": "1438961958", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438958358", "permID": "15716512", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "dc", "parentID": null, "userDisplayName": "raramuri", "commentTitle": "<br/>", "commentBody": "Rubio a clear winner? Perhaps if zinginess is the only criterion -- he lied about his prior support for abortion exceptions (which this morning's \"clarification\" only serves to illustrate that he's more interesting in controlling other people's lives than in actually addressing the problem), and his 'zinger' about the godless Democratic candidates was distinctly more devilish than Christ-like.<br/>Walker? the only way he distinguished himself was by offering succinct answers which ended before his time was up. Not substantive answers, but succinct ones. His willingness to let mothers die over fetuses and to insist that there are \"many alternatives\" flies in the face of the facts and is not a winning strategy outside of the red meat partisan crowd.<br/>Kasich had one of the two substantive comments of the entire evening (on accepting gay marriage) by my count, and he was the only one besides Bush who did not place himself firmly to the right of Barry Goldwater (who warned us about the dangers of mixing uncompromising faith and politics, not that any of the GOP candidates appear to remember that). He did seem to make gains on the night; maybe he'll leapfrog into #7 in the polls or something -- but still underwhelming, as was the entire field, undercard included.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438959820", "commentID": 15716512, "userID": 53792050, "recommendations": 80, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15716512}, {"approveDate": "1438962137", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438958537", "permID": "15717002", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Mark R", "commentTitle": "<br/>", "commentBody": "Respectfully, Mr. Cohn's analysis sounds like a Democrat analyzing which Republican did the best job at appealing to Democrats.  He praises the candidates that spent their time calmly reciting the technical justifications for their conservative policies, like Rubio and Walker.  He gives the least credit to candidates that were more focused on giving the audience some \"red meat\" while pushing back forcefully against tough questions, like Trump, Christie, Walker and Huckabee.  And all that might make sense if the goal now were to win over independents in the general election.  <br/><br/>But in a primary, the central goal is to reassure your base that you will stand up powerfully for their views.  You don't need to explain to them the fine-grain technicalities of what policies will advance their preferences and how you've picked precisely the right policies.  As long as they know that you're an ally and a forceful leader, they'll trust you to take care of the details.  And on that front, I think some other candidates made a lot more progress than Rubio and Walker, who, frankly, seemed to be reciting policy points by heart, rather than speaking from the heart,", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438961619", "commentID": 15717002, "userID": 53792286, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15717002}, {"approveDate": "1438962248", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438958725", "permID": "15717122", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Diane", "commentTitle": "<br/>", "commentBody": "Can you really call it a debate if everyone sticks to the party talking points? <br/><br/>The entire event was simply a big love-fest to Republican modern ideals: oppose abortion with no regard to context, repeal Obamacare no matter what, kill the Iran deal at any cost, and so on. The closing question about God said everything that needed to be said regarding the Republican take on the separation of church and state. <br/><br/>I was shocked that this debate was not available to the general public. This fact alone makes it clear that this was more of an audition for the donors for who can sound presidential, rather than an event meant to inform the public. <br/><br/>To me, the winner was Kasich, who showed some humanity, something rare in the Republican party these days. The losers were the general public, who have to watch a field of candidates that might as well be an SNL sketch. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438962194", "commentID": 15717122, "userID": 68347043, "recommendations": 192, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15717122}, {"approveDate": "1438970747", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438967147", "permID": "15718460", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "NYer", "commentTitle": "<br/>", "commentBody": "I must disagree with your analysis of Trump.  I thought he was the star of the show, demonstrating far more on the spot in the limelight intelligence (OK maybe thats the wrong word) than any others.  He was funny, he was pointed, he connected with the audience consistently whether in a good or not so good way, but he was not boring, not predictable, not over rehearsed (understatement) and not flummoxed by anything anyone had to say.  CONTENT ASIDE a good performance effectively shoving the other 'front runners' towards the rear.  I would predict he will come out of this debate stronger, not weaker and it wont be as much based upon the content of what he said, but the strength with which he speaks.  People are so hungry for strength and a lot agree with his CONTENT on political 'correctness'.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438969329", "commentID": 15718460, "userID": 19888233, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15718460}, {"approveDate": "1438971091", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438967491", "permID": "15718778", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ithaca", "parentID": null, "userDisplayName": "Melissa", "commentTitle": "<br/>", "commentBody": "Ben Carson is intelligent and he thinks before he speaks.  He is not a politician by trade.  Neither was Lincoln. If he is willing to humbly learn and surround himself with experienced people who also care deeply for our country, he has my vote.  He worked his way to success, changed his family tree, encourages others to do the same and does not use the pity card.<br/>Donald Trump is blunt.  He is a bribing, manipulating bully.  He is a user and in turn, people use him.  How can that type of person lead our country?  Our country surely wouldn’t win another country’s friendship.  The comment about Mexico sending their thugs into our country is probably done by every country even ours.<br/>Chris Christie in the midst of a tragedy hugged President Obama.  So what!  From a human point of view can’t everyone relate to how one must feel in sorrow and trouble?  Shouldn’t they?  Christie has experienced firsthand the effects of dealing with terrorism after 911.  He “gets it” that we can’t hope for the best and make deals with Iran and get nothing in return.<br/>Mike Huckabee hit the nail on the head when he said, “Reagan said 'trust but verify,’ while Obama trusts but vilifies. He trusts our enemies and vilifies everyone who disagrees with him!” and his comment at the end about who is getting the most attention in this election was awesome!  Made me laugh.<br/>I wish I heard Carly Fiorina.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438970805", "commentID": 15718778, "userID": 69688873, "recommendations": 7, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15718778}, {"approveDate": "1438971980", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438968676", "permID": "15718856", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sheffield", "parentID": null, "userDisplayName": "Michael", "commentTitle": "<br/>", "commentBody": "Ted Cruz is very irritating to watch. His voice is disturbing; like a blowfly messing up a winter sleep. Mr. Trump cannot really be taken seriously. I think Jeb or Rubio does it for me - they appear (along with Mr.Rand) to have invested some time thinking about the issues.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438971215", "commentID": 15718856, "userID": 69882920, "recommendations": 7, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15718856}, {"approveDate": "1438979236", "commentType": "comment", "userTitle": "NULL", "updateDate": "1438975663", "permID": "15720475", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "\"Disgusted\"", "commentTitle": "<br/>", "commentBody": "To my mind Trump set off a nuclear weapon in the debate and no one noticed.  A question to him was along the lines of: \"you gave money to Democratic politicians in the past, so …\"  Trump's answer was : \"sure, I do it all the time!\"  He then opened his arms to right and to left and said:  \"I have even given to people here on this stage right now!\"  Can you imagine the mental incontinence problem this caused for the people he was talking about?  He then went on to say:  \"This is part of doing business - I give to people in both parties.  I give to them and when I need their help THEY GIVE TO ME!  (not the exact words)  Now, the super smart moderators missed this - completely over their heads.  What would have happened if just a couple of questions had been asked such as 1) What is an example of something politicians gave back to you in the past?  2) What would be an example of a give back for $100 million?  Trump exposed what we all know - if you are rich buy your politician and put him/her in your pocket for when you need them.  At this writing I have not seen one reference in national media regarding this bomb explosion - what a mess!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1438978815", "commentID": 15720475, "userID": 30111925, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15720475}], "totalEditorsSelectionReturned": 17, "replyLimit": 3, "totalRecommendationsReturned": 17, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 965, "api_timestamp": "1488822423", "totalReplyCommentsFound": 395, "totalCommentsReturned": 17, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}