{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 4, "totalParentCommentsReturned": 21, "totalParentCommentsFound": 458, "totalEditorsSelectionFound": 31, "depthLimit": 0, "totalRecommendationsFound": 752, "comments": [{"approveDate": "1482912494", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482912494", "permID": "20920729", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "Smokey", "commentTitle": "<br/>", "commentBody": "How can you sell a company that has your name on everything?  First of all, who would buy it?  And second, it would still say \"Trump\" on everything.  <br/><br/>So I guess he can sell the real estate with the agreement that the Trump name will be removed from everything,  But what can be done with the licensing business of \"Trump?\"  Dissolve it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482894083", "commentID": 20920729, "userID": 26469439, "recommendations": 181, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920729}, {"approveDate": "1482912757", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482912757", "permID": "20920762", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New jersey", "parentID": null, "userDisplayName": "Brian Barrett", "commentTitle": "<br/>", "commentBody": "Bravo NY Times. The only effective solution is total divestiture. It is the only way a Trump Administration can proceed without causing an immediate Constitutional Crisis involving conflicts of interest.<br/>Those Americans like myself who are not Trump supporters recognize the need for divestiture to make possible his success. I worry that he will fail anyway because his ignorance in so many areas is manifest. At least he should not be allowed shoot himself in the foot the moment  he has been inaugurated.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482894594", "commentID": 20920762, "userID": 31460080, "recommendations": 389, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920762}, {"approveDate": "1482912838", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482914752", "permID": "20920771", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 110, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": null, "userDisplayName": "TL", "commentTitle": "<br/>", "commentBody": "Ah yes, the sour grapes witch hunt is well underway.   Any ability for self made men (or women) to bypass the entrenched party system must be shutdown at all costs.   It is unreasonable for Trump to be asked to divest his business empire, which is why Democrats and the NY Times are demanding it.   They try to make it equivalent to Obama selling some publicly traded stocks.   Trump's situation is very different, representing a lifetime of work  that belongs to him and his family if he so chooses.   Democrats are only demanding it out of spite and bitterness.    Voters knew he had these businesses coming in, and he never committed to full divestment, nor should he.   The guy is already a billionaire and has said his focus is on the Presidency.  I truly believe he isn't doing this to line his pockets.   He's not Clinton, renting out the Lincoln bedroom.  What is the point of that for him?   That's why he was elected, because he has the means to be genuine and not use the White House as a money making scheme, unlike the Clinton's.   Let's give  a 70 year old guy who can't be bought a shot.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482894722", "commentID": 20920771, "userID": 63655446, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920771}, {"approveDate": "1482912935", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482912935", "permID": "20920781", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Beyond the Beltway state of mind", "parentID": null, "userDisplayName": "DOUG Terry", "commentTitle": "<br/>", "commentBody": "There is a problem with divestiture. A really big one. <br/><br/>Based on my experience in business (thankfully, a lot more limited than that of the president elect), I doubt that Trump could fully divest in less than a year or two at best. His company is involved in more than 100 deals in various places around the world and each of those deals is, very likely, highly complex, involving hundreds of pages of binding contracts. There are debts to be paid and participants have assumed responsibility for those debts based on those binding contracts. You can't just tear them up. Getting out of one hotel building deal would take a lot of work. Some properties would likely have to be disposed of at fire sale prices. <br/><br/>Then there are the many licensing deals. People paid big chunks of money upfront to get the Trump name on their hotel and building. How do you back away? Most likely, there are continuing payments due as well, which means there are forward looking years of mutual obligations. Trump is not one to give up income streams lightly and, after all, those streams are there so his family can take over and keep the whole thing pumping money for the next 100 yrs., or however long they can sustain it.<br/><br/>Trump should have started cutting his ties two yrs. ago and had an active plan to complete it if he were elected. Even in the last 2 weeks of the campaign, he acted like he expected to lose. Now, we are all losing because of his grotesque failure to figure out how to handle the businesses.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6545/5323/cropped-65455323.jpg", "createDate": "1482894936", "commentID": 20920781, "userID": 65455323, "recommendations": 504, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920781}, {"approveDate": "1482913196", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482913196", "permID": "20920830", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "the villages, fl", "parentID": null, "userDisplayName": "Sue Azia", "commentTitle": "<br/>", "commentBody": "Trump has to get rid of his businesses interests.  He knew it when he ran and that is the constitution rule that he can not profit.  If he were unwilling, he should not have run.  He can always quit but he can not be both.  The republicans know this and made so much out of Hillary's wonderful helpful foundation while allowing all this corruption and bad ties.  The news media has to start having the same ethical standards for both parties but they do not.  They bend over backwards to not go after the republicans in the same way as they do the democrats.  Look at this election and how differently it would be if the coverage had been equal.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482895870", "commentID": 20920830, "userID": 70322995, "recommendations": 497, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920830}, {"approveDate": "1482913275", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482913275", "permID": "20920848", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mt", "parentID": null, "userDisplayName": "Eskibas", "commentTitle": "<br/>", "commentBody": "Of course congressional republicans won't even give Senator Warren's divestment bill a passing glance, nor would they ever pass a bill requiring tax return disclosure of presidential nominees.  But they sure like to complain about it whenever it personally benefits them.<br/>Also everyone with a working brain in their skull knows how it's going to go-Potus signs their bills, while they in turn don't impeach him, and all the slime in D.C. Is happy all around.  Too bad though, how all the money in the world cannot even buy decent entertainment for their party.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482896302", "commentID": 20920848, "userID": 45942728, "recommendations": 304, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920848}, {"approveDate": "1482913313", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482913313", "permID": "20920855", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Butler, NJ", "parentID": null, "userDisplayName": "Kim", "commentTitle": "<br/>", "commentBody": "O Donald, Donald! wherefore art thou Donald?<br/>Deny thy father and refuse thy name;<br/>Or, if thou wilt not, be but sworn my president,<br/>and we'll no longer be a democracy.<br/><br/>'Tis but the name that is your enemy.<br/><br/>This is an issue that cannot have a solution like selling the company and placing the assets in an blind-managed form because the company is the brand and the brand is TRUMP, blonde hair and all.  While I agree there is a conflict of interest there is not a feasible way to separate the two without actually abolishing the companies under the name.<br/><br/>This also presents a separate issue -- as much as a foreign entity can enrich the president by spending at one of his properties, a different kind of entity can tarnish the name.  A terrorist attach on a Trump property would hurt the brand, attacks on multiple properties would define a pattern and people would fear being there.<br/><br/>It would be good for Trump, the Trump organization and the country to separate themselves but it is all in the name.  The best that should be expected and demanded is that Trump sell the DC hotel for that is where the conflict will be most obvious and used by those wishing to influence the president -- \"Nice to meet you.  I had a great night at your hotel.  Now to the business at hand...\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482896412", "commentID": 20920855, "userID": 63687, "recommendations": 74, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920855}, {"approveDate": "1482913427", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482961762", "permID": "20920882", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Rosemarie McMichael", "commentTitle": "<br/>", "commentBody": "\"what Mr. Trump must do to protect his presidency from damaging accusations of corruption.\"<br/><br/>The assumption is that this man cares what his administration looks like.  He's only in it for the prestige, the power and the ability to air his accumulated petty grievances, and was probably just as surprised as the rest of us that he won.  Nevertheless, he wouldn't recognize corruption if it slapped him in the face.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1270/6104/cropped-12706104.jpg?0.07645631837658584", "createDate": "1482896915", "commentID": 20920882, "userID": 12706104, "recommendations": 552, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20920882}, {"approveDate": "1482913819", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482945187", "permID": "20921067", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "florida", "parentID": null, "userDisplayName": "sbmd", "commentTitle": "<br/>", "commentBody": "Many people just don't realize the potential for conflict of interest in such high office. Just look at Putin and the kleptocracy he has instituted. One thing about billionaires - there's never enough money, that's why they're billionaires. How can any sane person think that Trump could separate his business ventures from politics or set up a viable firewall that would keep them apart? There are some very naive people out there who think that just because his kids are involved in the business the old man can be kept at a distance.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482900211", "commentID": 20921067, "userID": 22808724, "recommendations": 301, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921067}, {"approveDate": "1482914007", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1482945745", "permID": "20920945:20921107", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Oregon", "parentID": 20920945, "userDisplayName": "Sharyl", "commentTitle": "<br/>", "commentBody": "The need for him to divest of his business holdings has nothing to do with whether he is \"liked\" or not.  When he assumes the presidency - he will have glaring conflicts of interest.  The public isn't even aware of the scope of those conflicts of interest because he has refused to release his income tax records - something every other candidate for president has done for over 40 years.<br/><br/>Clearly, the Trump family DOES NOT understand the potential conflicts:  Coffee with Ivanka for donations to Eric Trump's charity - cancelled after exposed.  With Trump then tweeting how unfair that was.  Killing animals with Don Jr and Eric and an opportunity to spend time with Trump for 1 million dollars - cancelled after exposed.  Also should be noted that both Don Jr and Eric's names were listed as directors of the organization in the Texas filings that was offering the animal killing adventure - yet they denied they knew anything about it.  Ivanka sitting in on Trumps meeting with the Japanese Prime Minister when she is trying to license a clothing line with a Japanese company that is funded by a Japanese government owned bank.<br/><br/>Bottom line - Trump ran for president - he should have been 100% aware of the consequences of his conflicts of interest and the need to divest himself of his businesses if he were to be elected.  If he wasn't willing to do so - he should not have run for the office.<br/><br/>PS - not only don't I like him - I loathe him and everything he stands for.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482900875", "commentID": 20921107, "userID": 77036691, "recommendations": 840, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921107}, {"approveDate": "1482914107", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482914107", "permID": "20921130", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Jennifer Stewart", "commentTitle": "<br/>", "commentBody": "Trump never wanted this job, but when he 'won' the election he obviously thought he could carry on lying and cheating. Now that he and his posse of children are waking up to reality they're scrabbling around like crazy. Trouble is, he's made a lot of very smart, very informed people very angry. And they have the law on their side. <br/><br/>It's ironic. Trump craves constant approbation and to be able to do whatever he wants, and he only ran for president to pump up his profile so he could expand his businesses. Now he is despised by millions in America—he couldn't even bribe celebrity performers to play for his inauguration—and around the world; he's in a job that's virtual straitjacket for somebody like him; his charity foundation is under investigation; and he's having to divest! <br/><br/>Poetic justice.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6706/2587/cropped-67062587.jpg?0.07994573726318777", "createDate": "1482901292", "commentID": 20921130, "userID": 67062587, "recommendations": 402, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921130}, {"approveDate": "1482914146", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482945531", "permID": "20921133", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Andrew", "commentTitle": "<br/>", "commentBody": "As I suggested in a comment a couple of weeks ago on this same topic, if soldiers every day sacrifice life and limb - both infinitely more valuable than mere money - for their country, how can it possibly be too much to ask of the commander-in-chief that he divest himself from business operations?<br/><br/>How can trump have the moral authority to ask such a sacrifice of soldiers if he himself would not make what by comparison is such a paltry sacrifice. <br/><br/>One thing we know for sure: Trump values his businesses and money infinitely more than he values the lives (and limbs) of our men and women in service.<br/><br/>I hate to say it, but if I were in the armed forces, I would be tempted to disobey a Trump order that jeopardized my personal safety.<br/><br/>Trump has swaggeringly asserted the voters elected him knowing about his business entanglements; \"The president can't have a conflict of interestt; the law is totally on *my* [SIC] side.\"<br/><br/>This idiotic misunderstanding of a president's apparent exemption from conflict of interest law misses the law's assumption (clearly now disproved) that the president would himself be of such character and level of statesmanship that the benefits of trusting him outweigh the burdens of potential prosecution of a POTUS, clearly the intention was not to authorize running personal business as POTUS or financially exploiting the office.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482901305", "commentID": 20921133, "userID": 66964410, "recommendations": 297, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921133}, {"approveDate": "1482914623", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482914623", "permID": "20921295", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Robert", "commentTitle": "<br/>", "commentBody": "That no legal requirement exists to require a blind trust and the transparency that it provides is testament to other presidents observing historical precedent. Yet, virtually half of the voting electorate made clear to Donald Trump that they have no use for accountability of any sort; had it been otherwise, his well-documented prior actions/statements would have denied him the nation's highest office. He wrongly believes he has a mandate to do as he pleases on Fifth Avenue, or elsewhere.<br/><br/>We already know that planning is anathema given how poorly the incoming administration's transition vetting is going - and it's clear that Trump's plans for his businesses, if elected and despite having eighteen months to contemplate what he would do, are no exception to his brand of chaos theory.<br/><br/>These discussions now about what the NYT calls \"half-measures\" are nothing more than the usual minimalist middle-finger to historical precedent and the American people that he says he respects.<br/><br/>It is difficult to divest businesses you've grown and that your children are heavily involved in, no question. But the presidency demands a level of transparency and respect for ethical behavior that Trump has demonstrated no use for as he prepares to govern. The game of three-card monte continues with the American people as the loser.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482905471", "commentID": 20921295, "userID": 62266564, "recommendations": 208, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921295}, {"approveDate": "1482914656", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482945422", "permID": "20921310", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "<br/>", "parentID": null, "userDisplayName": "Joel", "commentTitle": "<br/>", "commentBody": "It is easy to write editorials and letters demanding that Mr. Trump put his family business in a blind trust so that the trustee can sell it, but it is not so easy to do it.  A securities portfolio or a block of stock in a public company can be sold that way on reasonable terms and the tax otherwise payable on gain from the sale may be eligible for deferral. A private business like Mr. Trump's -- particularly one that is based in large part on his name -- would take months to sell and, as anyone who has had experience with forced business divestitures knows, the price realized would most likely reflect an enormous loss of value.<br/><br/>I don't think it's reasonable to expect Mr. Trump to do that to himself and the family members who grew up in that business and there was no reasonable basis for the voters who elected him to have expected that he would do so. I think the best we can expect is that Mr. Trump remove himself entirely from management of the business and let someone else run in during his time in office, just as Mayor Bloomberg did with Bloomberg L.P. while he was Mayor.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482905901", "commentID": 20921310, "userID": 617387, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921310}, {"approveDate": "1482917631", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482917631", "permID": "20921564", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hawaii", "parentID": null, "userDisplayName": "Alan", "commentTitle": "<br/>", "commentBody": "Trump was asked during the campaign what sacrifices he has made in his life.  This was after his disparaging remarks about Khizar Khan, whose son died fighting for our nation in Iraq.  Trump said he had worked really hard, created jobs and built large projects.  Not mentioned was his inherited wealth, his marble-and-gold palatial homes, the private jet, or his shortchanging of working people, fraudulent activity like Trump University, and taking advantage of laws allowing him to stop paying taxes because of his business failures.<br/><br/>I don't begrudge enrichment.  But I do begrudge an assertion that equates working hard with laying down your life for your buddies.  Most of us work hard, and I would guess some Trump supporters who start without his advantages know that better than many.  It's not sacrifice.  We do it to provide for our families and give them hope.  We do it because personal honor and responsibility calls for it.<br/><br/>Trump is now at a defining moment.  He ran for president saying he knew what is best for America.  Divestment would clearly show he places his patriotism ahead of personal interest.  He will retain considerable wealth.  But he will leave no doubt that his actions are solely for the country, and not for self.  He says we knew he was a businessman.  Well, he knew that too when he chose to run.  And now that he has won, it's time to do the right thing.  To step up and be a man.  To put country and honor first.  To sacrifice.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482916872", "commentID": 20921564, "userID": 45820007, "recommendations": 340, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921564}, {"approveDate": "1482920941", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482920941", "permID": "20921654", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "El Jamon", "commentTitle": "<br/>", "commentBody": "I will press this once again, as it is not mentioned (for some odd reason) in this piece.  What happens when a crazed terrorist blows up a Trump property, somewhere in the world?  Mr. Trump's brand is now, without doubt, a target for nefarious forces. Who will provide security for Trump's global mark?  The moment a foreign government posts a single police detail outside a Trump property, he is in violation of the Emoluments Clause.  So, what then?  Will American troops be called upon to defend, or retaliate for a strike against one of his garish properties? This self professed \"counter-puncher\" has the impulse control of a sugar jacked teenager.  Lower income Americans cannot conjure and cure heel spurs.  Will Americans who could never afford a single night in a Trump resort be called upon to provide tax dollars or American lives to secure the global Trump trademark?  Will our intelligence assets be diverted to provide intelligence, whether preventative or forensic, for a Trump property?  Surely the Trump Organization cannot afford this level of security. Can their insurers and investors carry this kind of risk? Can their tenants? This is the most alarming conflict of interest that we face. I suspect that news organizations and government officials are not vocally raising this alarm because they know of Mr. Trump's famous need to levy blame. But, this is not a spontaneous concern.  In this case, Mr. Trump can hold the people who voted for him to account. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482920640", "commentID": 20921654, "userID": 75896568, "recommendations": 430, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921654}, {"approveDate": "1482928045", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482945690", "permID": "20921760", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "There", "parentID": null, "userDisplayName": "Here", "commentTitle": "<br/>", "commentBody": "\"No Title of Nobility shall be granted by the United States: And no Person holding any Office of Profit or Trust under them, shall, without the Consent of the Congress, accept of any present, Emolument, Office, or Title, of any kind whatever, from any King, Prince, or foreign State.\"<br/><br/>The emoluments clause does not apply to doing business with foreign governments, nor does it apply to elected officials.  Remember, it doesn't SAY what you want with respect to President Trump, and no court has said what you want it to say.<br/><br/>So, basically, you've learned a new word, even if you don't know its meaning. Participation trophies to follow.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482922739", "commentID": 20921760, "userID": 57595872, "recommendations": 13, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20921760}, {"approveDate": "1482930698", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482930698", "permID": "20922068", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chesapeake, VA", "parentID": null, "userDisplayName": "Douglas McNeill", "commentTitle": "<br/>", "commentBody": "A prominent theme in the article, the comments and the whirlwind surrounding Trump, his businesses and the presidency is sacrifice.  Ascending to the presidency requires sacrifice for all who held or wish to hold the office, whether it be the mundane loss of the ability to step out and buy a paper or the more difficult loss of privacy and the need, fully declared, to decouple your administration from your prior life.<br/><br/>Unfortunately, sacrifice is not a word in Donald Trump's playbook.  He has done what is good for him above all at every opportunity.  A presidential legacy is not something he values unless it can be monetized.  Self-enrichment is his North Star.  Why do we now express surprise at his feeble attempts to do the right thing?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2388/489/cropped-2388489.jpg?0.10247170923292104", "createDate": "1482927210", "commentID": 20922068, "userID": 2388489, "recommendations": 110, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922068}, {"approveDate": "1482930769", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482930769", "permID": "20922129", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "virginia beach, va", "parentID": null, "userDisplayName": "carla van rijk", "commentTitle": "<br/>", "commentBody": "Donald Trump is very similar to Dorian Gray in the short story by Oscar WIlde.  He is the embodiment of narcissistic greed and pure egotism.  What is most troubling is that he appears to have no sense of ethics or moral integrity as witnessed by his recent coercion of Kuwait's government to switch to his hotel in Washington DC for their upcoming visit.  To him, outwitting the Capitalist game is hard wired into his internal organs.  He takes pride in not paying any taxes, yet exploits everything the federal government provides for its citizens.  My only hope for the next generation is that there are indeed ethical politicians as shown in the good works of Elizabeth Warren and other Democrats.  They are willing to go out of their way to protect the country and the Constitution against monsters like President elect Trump, Paul Ryan, Mitch McConnell &amp; their ilk from destroying our nation's fabric one thread at a time.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5557/0583/cropped-55570583.jpg?0.38427486010834433", "createDate": "1482927900", "commentID": 20922129, "userID": 55570583, "recommendations": 179, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922129}, {"approveDate": "1482930807", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1482930807", "permID": "20920696:20922163", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Susan", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Melbourne, Florida", "parentID": 20920696, "userDisplayName": "Robert Leudesdorf", "commentTitle": "<br/>", "commentBody": "Well said.  Regrettably these situations will not change with a spineless congress drunk with power, most of who will support the madness.  Trump's cabinet choices are already a demonstration of his governmental ignorance and reluctance to educate himself and understand he is now a servant of the people, not of his Brand.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482928187", "commentID": 20922163, "userID": 64651805, "recommendations": 95, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922163}, {"approveDate": "1482930907", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1482930907", "permID": "20920771:20922483", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "TL", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Haven", "parentID": 20920771, "userDisplayName": "joel88s", "commentTitle": "<br/>", "commentBody": "Oh, you 'truly believe' his focus is on the Presidency he isn't doing this to line his pockets. How comforting. <br/><br/>The question is *why* you believe this, when everything the man has ever done has been solely to enrich and glorify himself, the opposite of a public servant. Except that he keeps telling you himself - which is the definition of being conned. <br/><br/>You are correct that he doesn't need to do this. The problem is that he wants to, because he is a childish person addicted to the constant adrenaline high of ''winning' and being able to say he is richer and more powerful than anyone. If he were the richest man in the world he would need to be the richest man who ever lived, or will live. The tendency of rich, powerful people to crave more money and power than they could possibly need has been observed for thousands of years. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2088/860/cropped-2088860.jpg?0.9972781273536384", "createDate": "1482930426", "commentID": 20922483, "userID": 2088860, "recommendations": 154, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922483}, {"approveDate": "1482931052", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482931052", "permID": "20922506", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "East Coast", "parentID": null, "userDisplayName": "Mike B.", "commentTitle": "<br/>", "commentBody": "Anyone who has followed Donald J. Trump's life over the recent past will quickly come to the realization that this is a man whose vision doesn't extend beyond his own nose and his wallet. To him, what's good for Donald is good for the nation and if he can somehow manage to profit from the presidency, I'm sure he won't resist. If Trump University and his other countless conquests haven't proved anything, they've proved that this is a man with no principles other than, of course, to \"maximize profits\" regardless of how it is accomplished. In his case, the end (profits) justifies the means. <br/><br/>Given his background, I doubt very much that this man will go down in history as one of America's finest. More than likely, he's more apt to go down in \"infamy\". He is the epitome of selfishness in the extreme. After watching him in the primaries and in the general election, it's clear that he'll say and do whatever it takes to get what he wants. And if that means lying, cheating, and stealing, well, so be it. <br/><br/>So, hang on America (and the rest of the civilized world). We're in for a rough ride over these next four years. (Unless, of course, he is impeached beforehand...which wouldn't surprise me, either.)", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4882/0267/cropped-48820267.jpg?0.9182498189468751", "createDate": "1482930593", "commentID": 20922506, "userID": 48820267, "recommendations": 161, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922506}, {"approveDate": "1482931237", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1482931237", "permID": "20922006:20922412", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Cornflower Rhys", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Somewhere in New Jersey", "parentID": 20922006, "userDisplayName": "Frau Greta", "commentTitle": "<br/>", "commentBody": "It's interesting that he and his supporters use the excuse of \"everyone knew he had all of these businesses\" when they elected him, so it should just be okay. Ironically, since he knew he had all of these businesses, he should have been aware they would be a problem.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482930019", "commentID": 20922412, "userID": 74391740, "recommendations": 131, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922412}, {"approveDate": "1482931359", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482931359", "permID": "20922482", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maine", "parentID": null, "userDisplayName": "Ann", "commentTitle": "<br/>", "commentBody": "Where are the tax returns? Still waiting.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482930408", "commentID": 20922482, "userID": 67128337, "recommendations": 101, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922482}, {"approveDate": "1482931673", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482961861", "permID": "20922632", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island", "parentID": null, "userDisplayName": "Steve", "commentTitle": "<br/>", "commentBody": "Nice to see that the NY Time's editorial Board are concerned about conflicts of interest. Where were you when Hillary was selling access for 250K a speech to foreign entities across the globe? Where were they when Bill was getting a million dollars a speech for selling access to the US when her wife was secretary of State? The difference is that Hillary is a democrat and the NY Times would never be as critical with her as they now are with Trump. But this issue with Trump was baked in the cake. It was on the ballot. America knew they were electing a President with world wide business interests. Election have consequences. The President has immunity anyway from these so called \"conflicts.\" President Trump has already said he is divorcing himself from the day to day operations of the business. That is enough for me and most Americans. Whatever he does, this page will never be satisfied, so why try? You people lost. Get over it. You ran an inept campaign of negativity. He is not fit, blah, blah, blah. It is time to support our President and wish him great success as he leads our nation back from the abyss Obama has wrought upon us for 8 years. We have the Senate. We have the House. You are impotent. Enjoy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1482931302", "commentID": 20922632, "userID": 74604008, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20922632}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 976, "api_timestamp": "1488822363", "totalReplyCommentsFound": 518, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}