{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 3, "totalParentCommentsReturned": 14, "totalParentCommentsFound": 260, "totalEditorsSelectionFound": 17, "depthLimit": 0, "totalRecommendationsFound": 505, "comments": [{"approveDate": "1462345642", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462373274", "permID": "18415582", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Mr. B.", "commentTitle": "<br/>", "commentBody": "This is a very thoughtful essay by Nate Cohn and the links are very valuable.<br/><br/>I think that the presidential election season that begins after the conventions this summer will favor Hillary Clinton in that an electorate energized by Donald Trump's candidacy will - paradoxically - work to his harm. <br/><br/>There's the cliché that \"a rising tide lifts all boats\" and it applies in a Clinton-<br/>Trump contest  in that there will be a much higher turnout among all voters in November with Trump as the Republican candidate, rather than Ted Cruz - or any other of the Republicans in the race for the presidency so far. <br/><br/>An election in which Clinton faced off against anyone else but Trump would have been unexciting.  But with the sharp contrast between Clinton and Trump, and Trump's tendency to shoot his mouth off - thereby shooting himself in the foot - will continue to stymie him. <br/><br/>Voters will \"vote against\" presidential candidates in the coming national election more than in any contest since the Goldwater-Johnson one of 1964.<br/>Our bifurcated political system in itself incentivizes \"voting against\"  much more so than in a parliamentary system.  <br/><br/>Higher voter turnouts typically favor Democrats, and that historical fact portends that voters who dislike Clinton but who dislike Donald Trump even more will vote for Clinton in order to strike a blow at \"Trumpism.\"<br/><br/>So right now it seems obvious that Hillary Clinton will be our next president - barring unforeseen circumstances, of course.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/937/8307/cropped-9378307.jpg", "createDate": "1462334430", "commentID": 18415582, "userID": 9378307, "recommendations": 114, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18415582}, {"approveDate": "1462345804", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1462373229", "permID": "18415020:18415938", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "Phil", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SF Bay Area", "parentID": 18415020, "userDisplayName": "Jonathan Koomey", "commentTitle": "<br/>", "commentBody": "Hillary has already beaten Bernie.  Her delegate lead is insurmountable and the remaining contests split delegates proportionally.  There's no way for him to catch up. Just like there was no way for Hillary to catch up in 2008 when she trailed Obama by half as many delegates as her lead over Sanders now is.<br/><br/>Trump will have a hard time convincing the many groups he's alienated that he didn't mean it.  All it will take to sink him is a \"Trump channel\" playing his many offensive statements over and over again, with voice over in various languages.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462336478", "commentID": 18415938, "userID": 85845, "recommendations": 102, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18415938}, {"approveDate": "1462365871", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462372926", "permID": "18415205", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Earth", "parentID": null, "userDisplayName": "CityBumpkin", "commentTitle": "<br/>", "commentBody": "I think Cohn may be underestimating Trump. After all, Trump doesn't need women, minorities, or young people to vote for him if they stay home and not vote at all. In American elections, where voter turn-out usually barely tops 50%, a candidate can win if enough of his opponent's voters fail to vote.<br/><br/>It remains to be seen whether Clinton can energize Democratic voters enough to win in November. She is not the most lovable or charismatic candidate, and carries a lot of baggage. <br/><br/>Even though Bernie Sanders himself has gone on record as saying he WILL NOT run as a third party candidate and will back Clinton over any Republican nominee, there is still a vocal element of Sanders supporters will say they will not vote for Hillary come November. Add this to Republican Party's on-going strategy of voter suppression, particularly among low-income minorities, and you may have the recipe for a Trump victory in November.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462332727", "commentID": 18415205, "userID": 60909833, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18415205}, {"approveDate": "1462368941", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1462372784", "permID": "18414789:18416050", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "F. T.", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, DC", "parentID": 18414789, "userDisplayName": "Brian L", "commentTitle": "<br/>", "commentBody": "Agreed completely... but first, the Democratic party needs to unite behind a single candidate. The Republicans now have a head start, regardless of whether or not Trump was the establishment's first pick. It's (unfortunately) remarkably smart of them to unite behind him... I just hope Dems manage to unite sooner rather than later.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462337218", "commentID": 18416050, "userID": 72869269, "recommendations": 50, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18416050}, {"approveDate": "1462368941", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462372753", "permID": "18416052", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Iowa", "parentID": null, "userDisplayName": "Mary", "commentTitle": "<br/>", "commentBody": "Whoa there, Nate. Those opposed to a Trump presidency had better not get too confident about beating the Donald. His appeal does not fall within any party lines. I know plenty of Bernie supporters who plan to vote Trump if Hillary is the Democratic nominee. Remember, too, that many Americans do not care about credentials or ability, nor do they think critically about anything a candidate says.  Instead they gravitate toward tough talk about sticking it to those who are other. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462337228", "commentID": 18416052, "userID": 67959084, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18416052}, {"approveDate": "1462373658", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462372496", "permID": "18420919", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Pasadena, CA", "parentID": null, "userDisplayName": "Iver Thompson", "commentTitle": "<br/>", "commentBody": "It at least looks for now, one thing is for sure - there won't be a genuine Republican elected to the White House come November.   As a Democrat, I suppose I should be glad about that.  <br/><br/>Since Trump is not really Republican, Bernie not really Democrat, Hillary too much of everything; so as long as none of them come close to being anywhere near like the \"True Republican\" himself, Ted Cruz, I should feel relieved after last night's announcement by Cruz.<br/><br/>Just thought of Cruz's finger on the SCOTUS selection button was an even more scary thought than Trump's on the red one.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3747/5504/cropped-37475504.jpg", "createDate": "1462373100", "commentID": 18420919, "userID": 37475504, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18420919}, {"approveDate": "1462375083", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462371483", "permID": "18421117", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Centennial, Colorado", "parentID": null, "userDisplayName": "Diana", "commentTitle": "<br/>", "commentBody": "Last night saw the exit of the most dangerous candidate running for the Presidency. I breathed a huge sigh of relief when Cruz announced he was suspending his campaign.  It seems that for awhile at least, the country will not be in imminent danger of sliding into a fascist/theocratic regime. Now we are faced with a real estate tycoon/entertainer buffoon versus (presumptively) a political savvy, well informed socially progressive woman.  While I see the polls show Clinton favored over Trump, right now she is hamstrung by Sanders who wants to change a Party he has not been a part of until last year when he declared as a Democrat in order to run for the Presidency (he has already registered as an Independent this year).  So, not only does Trump have a clear field, Clinton has to still battle for her Party's nomination and spend funds that could be spent for the general election.  The RNC and Fox News and conservative talk show hosts are already beginning the attacks in full force against her.<br/>If Sanders wanted the Democratic Party to champion more liberal values, he should have become a Democrat many years ago, and worked toward that goal. His challenge to Clinton is turning some voters against her so vehemently, many have declared they will sit out the election if she is the nominee. That is not benign, it is the same thing as voting for Trump.  Sanders is becoming the Ralph Nader of 2016.  We all know what happened when Al Gore lost the Presidency.  Imagine Trump as President.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462373996", "commentID": 18421117, "userID": 22629813, "recommendations": 158, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421117}, {"approveDate": "1462375352", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462372406", "permID": "18421129", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Coolhunter", "commentTitle": "<br/>", "commentBody": "Since Trump has no real values, those that will vote for him are voting for 'change'.  That maybe enough to get him elected. Hey, we did that we Obama. Mx. Hillary will be the same old, same old candidate. Take your choice, either way you will be conned. Best to do a 'write in' in November.  If that does not work, you will be able to vote for the Libertarian candidate.   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6256/9741/cropped-62569741.jpg?0.8629316648956288", "createDate": "1462374063", "commentID": 18421129, "userID": 62569741, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421129}, {"approveDate": "1462375743", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462372143", "permID": "18421402", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Houston", "parentID": null, "userDisplayName": "Kane", "commentTitle": "<br/>", "commentBody": "First of all there is way too much emphasis put on what polls and pundits say. They have been consistently wrong about this election.<br/><br/>I have been a Bernie supporter because I think that he offers what this country needs to reset its policies to benefit the 99% over the 1%. By the way he is a Democratic Socialist like many of the most prosperous and equitable Northern European countries not a socialist.<br/><br/>The Clintons and the Democratic Party have done everything possible to keep Bernie from becoming the Democratic nominee and I am sure that they will be successful in getting Hillary the nomination. Bernie would have a lot more votes and delegates if so many Democratic primaries had not made it impossible for independents to vote. Over 40% of the electorate define themselves as independents so this was a bad decision except for Hillary and the Democratic machine that she controls.<br/><br/>I am scared of Hillary becoming President since I think that she could easily get us into another war in the Middle East or with Russia and once she has the nomination she will triangulate back to the center and pursue policies that benefit her large corporate and financial sponsors. Follow the money.<br/><br/>Trump is an incredible loud mouth who has insulted many people, but I do not believe he is a fascist. He will spend the next six months moving back to the center and pursuing independents. He is against more wars and wants to focus on saving US jobs by preventing bad trade deals. He will get my vote.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462375268", "commentID": 18421402, "userID": 69376761, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421402}, {"approveDate": "1462377356", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1462373756", "permID": "18416186:18421588", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Stephen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palm Beach, FL", "parentID": 18416186, "userDisplayName": "Tim Smith", "commentTitle": "<br/>", "commentBody": "Trump's poll numbers throughout the Republican primary season were pretty accurate.  But so are the other poll numbers that show him to be very disliked by huuuuge majorities of Americans.  I'm not a fan of Mrs. Clinton, but I know what I'm getting there.  Trump spoke for about 15 minutes last night and sounded like one of those befuddled beauty contestants he likes to hang around with.  He seriously has no clue about how the world works.  He's going to put \"the miners\" (or did he mean \"minors\") back to work?  How?  Artificially inflate the price of natural gas, artificially turn the global weather colder, and roll back the Clean Air Act and EPA regulations on coal emissions?  Nothing.  I say again, NOTHING, I've heard him utter can be done.  And while we're at it, I'm a veteran who was career military.  First, I haven't been treated horribly, and second the US military does win, and we win frequently.  But since The Donald doesn't know jack about foreign policy, national security, or the military, he thinks he can just snap his fingers and ISIS will be \"taken out.\"  That a guy who graduated from an Ivy League school is so clueless and lacks any situational awareness should be cause for Penn to sue to rescind his degree for smearing their image.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462376273", "commentID": 18421588, "userID": 73625515, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421588}, {"approveDate": "1462377816", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462374216", "permID": "18421639", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "J.D.", "commentTitle": "<br/>", "commentBody": "It's clear that any reasonable person, i.e. Democrat, wants to have Hillary or Sanders win the presidential election.  For goodness sake, there's a supreme court swing seat in play.<br/><br/>However, when it comes to the November election, Hillary or Sanders will have a challenging time with Mr. Trump.  Regardless of the present polls, Mr. Cohn is wrong not to worry.<br/><br/>As H.L. Mencken stated: \"No one in this world, so far as I know—and I have researched the records for years, and employed agents to help me—has ever lost money by underestimating the intelligence of the great masses of the plain people. Nor has anyone ever lost public office thereby.\"<br/><br/>The Clintons have a lot of baggage for the GOP and even with independents and Reagan Democrats.  Many people will be wary of that.  <br/><br/>In a year of the outsider, i.e. Sanders and Trump, many voters will be drawn to pull the lever for someone new and different and to send a non-politician to DC rather than to send a seasonable, experienced, informed, wise politician.  <br/><br/>Democrats should be afraid.  Very afraid.  And hopefully motivated to get out the vote.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462376580", "commentID": 18421639, "userID": 927853, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421639}, {"approveDate": "1462378007", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462374407", "permID": "18421669", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Patrician", "commentTitle": "<br/>", "commentBody": "Nate: you, and all the pundits (who have been proven wrong countless times this election cycle) need to be careful in extrapolating what the impact of the \"unfavorability\" numbers is and whether the question is indeed a good proxy for behavior on Election Day. If not, this will end up being the Democratic version in 2016 of what was memorably described in 2012 as \"math you do as a Republican to feel good about yourself\".<br/><br/>That number (unfavorability) is meaningless to project actual voting outcomes. Peel the onion and explore what's missing. A 70 percent unfavorability rating does not fit in with the 55 to 60 percent of the vote Trump has recently started to churn out in the primaries. Factor in the proportions of the electorate that are independent and Democrat (rust belt) that will vote for Trump and you will start seeing how understated Trump's support is when comforting yourself with the unfavorability metric.<br/><br/>Voting decisions are about (1) enthusiasm; (2) choice. Trump has inspired people to turn out in record numbers, you can see that from the primaries and how more Reoublicans are turning out. In terms of choice: many Republicans who find him offensive will, over the next few months as the party unites, get around to voting for him.<br/><br/>I don't support Trump. As a liberal Democrat, I can't stand him and shudder at the menace he represents to American values. But, these are extraordinary times, and so don't comfort yourself by looking at simplistic metrics.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462376707", "commentID": 18421669, "userID": 70240953, "recommendations": 58, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18421669}, {"approveDate": "1462380655", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462377055", "permID": "18422078", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "nj", "parentID": null, "userDisplayName": "j", "commentTitle": "<br/>", "commentBody": "First, I am no Trump supporter but Nate, you have vastly underestimated Trump for a long time, to say nothing of Bernie Sanders.  This is an unpredictable election because there is so much anger.  Yes, unemployment might stand at 5 percent but many employed people don't make enough to feel secure about the future.  Many cannot afford medical insurance, even with subsidies.  Workers in their 50's and early 60's are deemed unemployable.  They cannot find work and cannot afford to retire.  However, the very wealthy continue to do just fine.  Our country has been pulling apart at the seams, we seem less interested in our collective fortunes, instead, it's all me, me, me.  So I do not think we can assume anything.  These are not ordinary times and anything can happen.  We are moving into uncharted territory.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462378913", "commentID": 18422078, "userID": 26556077, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18422078}, {"approveDate": "1462381014", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462377414", "permID": "18422081", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "U.S.A.", "parentID": null, "userDisplayName": "B.F.", "commentTitle": "<br/>", "commentBody": "Not sure why everyone is calling Trump's candidacy in the general election an uphill battle.  Can't any of them see the general public is fed up, tired with the \"politics as usual\" fanfare.  I'm talking about both the democrats and the GOP.  I think Trump is going to win by a landslide in November; because of peoples disgruntlement with the \"politics as usual' ideology.  I'm not necessarily a Trump fan.  But I think this is what's happening.  And I am confident that if Trump was running as a democrat, the outcome would be the same.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462378926", "commentID": 18422081, "userID": 72392663, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18422081}, {"approveDate": "1462381417", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462377817", "permID": "18422433", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Amy Anderson", "commentTitle": "<br/>", "commentBody": "We talk about wanting a candidate who can start 'on day one.' How about someone who can start now? The idea that Trump can be taught how to run the United States by January is absurd! The man is absolutely, positively, without a doubt unqualified. His supporters are thumbing their nose at the political system. Fine, but we can't elect someone who doesn't have a clue, and who will just be faking it in January. <br/><br/>I am much more comfortable with a candidate who has been planning and preparing for this job for years. Hillary could have started eight years ago, but as it turned out, President Obama has been a pretty darned good president. We stand to get the best of both: Obama and now Hillary. <br/><br/>Hillary in '16!!!", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462380910", "commentID": 18422433, "userID": 42538743, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18422433}, {"approveDate": "1462381835", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462378235", "permID": "18422187", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": null, "userDisplayName": "aunshuman", "commentTitle": "<br/>", "commentBody": "A 10 point lead that Clinton has can be easily overcome. It is wrong to assume that majority of the Minority voters will vote for Clinton. One solid positive campaign overture (policy shift) from Trump, and many will be ready to give him a benefit of doubt. Unfortunately Clinton doesn't get that benefit as her opportunistic policy flip flops are too well known even among the moderate Non White voters. On foreign policy, she is more in step with Neo-Con republicans than democrats. Her embrace of Obama is merely to attract his supporters than out of genuine conviction. In fact, under her watch, none of the bold initiatives were possible, Not even Cuba. She would vote for regime changes before voting against them when things go wrong. With Trump, at least we know that he is bluffing and nobody knows what his real policies are going to be. All we know is that he is a businessman and a TV Shock Jock who is out to secure higher ratings(Support) with sensational bombast. On some issues he is more democratic than Clinton, on others he his outright ridiculous. So the real choice is between someone who you know and don't trust (Clinton), and someone who you don't trust but don't know well either (Trump). Again, now that he has almost secured the nomination, if Trump changes his offensive rhetoric, his support will increase manifold.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2750/8855/cropped-27508855.jpg", "createDate": "1462379483", "commentID": 18422187, "userID": 27508855, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18422187}, {"approveDate": "1462381925", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462378325", "permID": "18422453", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Mexico", "parentID": null, "userDisplayName": "Doug", "commentTitle": "<br/>", "commentBody": "Why am I, an almost lifelong democrat, voting for Trump?<br/><br/>\"We can't solve problems by using the same kind of thinking we used when we created them.\" Albert Einstein<br/><br/>Hilary, Bernie, Ted, etc, etc., have been party to the decisions that have gotten us to the point where a Donald Trump looks good even if only because he brings fresh ideas to the table (albeit not fully thought out). Do we really expect HRC, who urged Obama into wars, to suddenly reverse course. Do we also expect her to mitigate the effects of trade agreements on our middle class?<br/><br/>Does Trump scare people? I'm sure he does. But he will have to operate within the constraints of the executive, legislative and judicial checks and balances and will probably be the candidate most amenable to compromise (there's that four letter word again) to get things done. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462381048", "commentID": 18422453, "userID": 46171259, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18422453}], "totalEditorsSelectionReturned": 17, "replyLimit": 3, "totalRecommendationsReturned": 17, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 558, "api_timestamp": "1488822411", "totalReplyCommentsFound": 298, "totalCommentsReturned": 17, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}