{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 3, "totalParentCommentsReturned": 17, "totalParentCommentsFound": 318, "totalEditorsSelectionFound": 20, "depthLimit": 0, "totalRecommendationsFound": 345, "comments": [{"approveDate": "1468614231", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468610631", "permID": "19162363", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "Joe", "commentTitle": "<br/>", "commentBody": "Oh the fascinating things Pence did in Indiana! The new formula, under Indiana's educational budget, slowly but surely, gives wealthier schools (and student) more money, while trickling away funds from poorer districts (and students). Student from poorer districts are also now required to fill out extra forms to prove, in fact, they are poorer. Conservatism is fascinating! ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468608949", "commentID": 19162363, "userID": 72314408, "recommendations": 437, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19162363}, {"approveDate": "1468673775", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670175", "permID": "19166109", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Glen", "commentTitle": "<br/>", "commentBody": "Assuming Trump wins the election in November, Mike Pence will become the 46th President of the United States.  Pence will not be elected to that honor in 2020 or 2024; it will be handed to him when Trump vacates the office, probably sooner rather than later.<br/><br/>Trump is no more capable of handling the duties of the office of POTUS than a chihuahua is capable of diving into freezing water to retrieve a downed Canada goose more than 5 times its size.  Picture, if you can, the golden-haired and orange-skinned one delivering a eulogy following a mass killing.  Keep trying.  The picture just won't come into focus?  Your glasses are not the problem.<br/><br/>Next, imagine Donald at a world summit.  Two of the attendees are Angela Merkel and Theresa May.  The first rates a 1.5 on Trump's Babe-O-Meter, the second ekes out a 3.  Neither of them will have anything to say that interests Donald Trump, even if they kneel as they speak.<br/><br/>Now, put Mr. Pence in the same situations.  Mr. Ted Cruz-Lite may deliver a more believable performance on the former, if a little heavy on the hellfire and brimstone vs redemption side.  But evangelicals aren't real supportive of women outside their god-given places in the kitchen and the delivery room.<br/><br/>If there really is a God, can we blame Him for putting us in this situation?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6760/7286/cropped-67607286.jpg?0.35638952255249023", "createDate": "1468632559", "commentID": 19166109, "userID": 67607286, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19166109}, {"approveDate": "1468673846", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670246", "permID": "19168872", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "RMC", "commentTitle": "<br/>", "commentBody": "The choice of Pence displays not only the utter bankruptcy of the Trump campaign but also the utter bankruptcy of the entire Republican party.  This piece is completely accurate when it states that, “having the Indiana governor on the ticket does little to convince a struggling middle class that Mr. Trump aims to force the party into its corner”, if, and only if, that struggling middle class is observant enough to realize that fact.  <br/><br/>While workers in Indiana are worrying about jobs, Pence focuses on the smokescreen Religious Freedom Restoration Act.  This is a classic “rabbit out of a hat” establishment Republican tactic to distract white middle class and working class voters from the issues that concern them the most: jobs, wages and the economy.<br/><br/>Emulating the entire Republican establishment, Pence espouses fraudulent Conservative concern with social political agendas regarding all who are not white and Christian and fulfilling of his definition of “normal”…blacks, gays, transgenders, Muslim, Hindu, Hispanic…the list never ends for racists like Pence.<br/><br/>Meanwhile the jobs in Indiana will keep disappearing but those radically important social issues will be there to console all those whose income falls and can no longer pay the mortgage.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468671898", "commentID": 19168872, "userID": 61059251, "recommendations": 94, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19168872}, {"approveDate": "1468673868", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1468670268", "permID": "19164083:19165328", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tucson", "parentID": 19164083, "userDisplayName": "EricR", "commentTitle": "<br/>", "commentBody": "Pence knew he'd lose his upcoming bid for reelection so there's no down side. Obscurity is fine by him since he's spent his political career struggling to overcome irrelevance and mediocrity. I agree he shouldn't get into any debates, unless it's with a montessori vegetarian. In fact I'd suggest he just say nothing, as any emphasis on his established positions puts him at odds with the majority of Americans. Will he open the coffers of the evangelicals? Maybe, but not a lot, I think. The same will go for the brothers Koch, who have more money than god, let alone the Donald, and it's real money, unlike his. I think they find him reprehensible and there's some things even they won't do.<br/>Pence is as reliably boring and non-descript as Trump could hope for, no headlines or attention will be grabbed away from him for the duration of \"Who wants to ruin the country\". What I think is most likely to happen is Donald will lay low and appear to assimilate into the party until the convention is over, the commitments made and the checks are written, then he will revert to his particular brand of misogyny, xenophobia and paranoia. He'll fan the flames of his base and probably get 40 to 45% of the vote, as would a ham sandwich or a cartoon character if either party put them on the ticket.  Beyond that I hope someone more knowledgable than I can explain what happens when a president elect is convicted of multiple felonies. Please tell me he can't pardon himself.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2643/9795/cropped-26439795.jpg", "createDate": "1468626118", "commentID": 19165328, "userID": 26439795, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165328}, {"approveDate": "1468673921", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670321", "permID": "19168308", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Philadelphia", "parentID": null, "userDisplayName": "JD", "commentTitle": "<br/>", "commentBody": "Here's the way I see it. <br/><br/>This bonehead play of selecting an anti-LGBT, anti-reproductive rights, evangelical zealot wakes up any and all undecided Bernie supporters and sets them scurrying to Hillary. <br/><br/>A convention with no substance or positive message, starring a bunch B-List athletes and celebrities (Make America Mediocre Again) and Trump progeny propels Hillary to a commanding lead in the polls coming out of the Democratic convention the following. <br/><br/>Trump, growing increasingly desperate as summer moves into fall, becomes more volatile, humiliates himself by being totally unprepared in the debates and tries to \"fire' Pence in favor of a running mate with more zing.<br/><br/>November is a landslide for the Democrats.<br/><br/>The world breathes a sigh of relief.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468666239", "commentID": 19168308, "userID": 17116811, "recommendations": 89, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19168308}, {"approveDate": "1468673961", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670361", "permID": "19167928", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Tom", "commentTitle": "<br/>", "commentBody": "Mike Pence's most infamous accomplishment as governor of Indiana was to sign a bill that legalized discrimination against gay people. The Pence pick means that the Trump campaign is willing to throw gay Americans under the bus. The Pence pick (and the GOP platform) are an open declaration of war against gay Americans. It bears repeating: The Republican Party Has Declared War Against Gay Americans. Do not be deceived by Donald Trump calling himself a \"friend\" of the gay community. Trump and Pence have pledged to overturn marriage equality. Pence has endorsed anti-gay conversion therapy. What Pence has tried to do in Indiana is make fundamentalist Christianity the law of the land in all its homophobic misery. Women need to be wary of Pence too for the obvious reasons, the primary one being Pence and his Church of White Patriarchy want to control your uterus. In the same way they want to control what any two consenting adults do in the privacy of their bedroom. They want to extend their powers into every American home and into every American bedroom. If we Americans value our freedoms and constitutional rights, we simply can't put Mike Pence one heartbeat away from the presidency.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4015/6850/cropped-40156850.jpg", "createDate": "1468657259", "commentID": 19167928, "userID": 40156850, "recommendations": 91, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19167928}, {"approveDate": "1468673998", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670398", "permID": "19168665", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "No one, of course, usually votes based on the Vice-Presidential candidate, but when you have two very dislikable and untrustworthy candidates running for President, it may be different this year.  Mike Pence helps unite the Republican Party and its conservative base thus helping Donald Trump.  I hope Hillary Clinton, who is now tied with Trump in the latest polls, takes this lesson to heart and picks either Bernie (yes, I still \"Feel the Bern\") Sanders or Elizabeth Warren as her running mate.  Sec. Clinton needs a strong, energetic and charismatic Vice-President to help unify the Democratic Party and overcome her trust-challenged, and frankly (by her own admission) lackluster and uninspiring campaign style.  For Democrats to win and have any chance to take back the Senate they need a record turnout, and either Sens. Sanders or Warren would do that as none of the others who've been mentioned can.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468670025", "commentID": 19168665, "userID": 57715665, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19168665}, {"approveDate": "1468674018", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670418", "permID": "19165501", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Between Alpha &amp; Omega", "parentID": null, "userDisplayName": "Nemo Leiceps", "commentTitle": "<br/>", "commentBody": "Does anyone outside of Indiana know that Pence could not win an election for the office he currently has?   Commonplace are yard signs saying:  Pence has to go\" and \"Get rid of Pence before he gets rid of your rights\"<br/><br/>Pence is nothing more than an insider who only says to power, how far do you want me to bend over.  This works out well for Trump and the GOP but is bad news for working people.<br/><br/>Pence has never met with the coalition of public health providers in the state, year after year refuses to even meet them.  Because he signed a new law (similarly to the way he signed the one repealed allowing refusal to serve LGBT customers) tightening control of abortion that women are sending him their used tampons because the law easily defines spontaneous abortion during menses must be checked by government officials that the procedure was legally performed.<br/><br/>The guy is as much a bum as Trump.  Ask most Hoosiers.  They'll tell you the same.  Evidently that is the new GOP criteria for executive office.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5950/3817/cropped-59503817.jpg?5441659221458807950", "createDate": "1468627705", "commentID": 19165501, "userID": 59503817, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165501}, {"approveDate": "1468674052", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670452", "permID": "19166266", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Barnesville, OH", "parentID": null, "userDisplayName": "rareynolds", "commentTitle": "<br/>", "commentBody": "When I came to seminary a few years ago in middle age, Pence was \"my\" representative. Indiana is a beautiful state ful of beautiful small towns, almost all going to wrack and ruin. People like to talk about Kansas, but do come to Indiana to see the Republican wrecking ball in full play. It's pitiful and not what we want for the rest of the country. Pence a heartbeat from the Presidency would be a worse disaster than Trump as president. It gets scarier by the moment. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1272/5850/cropped-12725850.jpg?0.08734734216704965", "createDate": "1468633737", "commentID": 19166266, "userID": 12725850, "recommendations": 100, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19166266}, {"approveDate": "1468674216", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1468670616", "permID": "19163245:19165465", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "david", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Omaha", "parentID": 19163245, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "Without any specifics of how he will carry out his promises, it should be easy to do. <br/><br/>He's already backed out of releasing his tax returns (see above), self-funding his campaign so that he can't be corrupted and stopping all Muslims from entering the country. <br/><br/>If he is ever pressed for specifics, he is going to have to admit that there is no way to compel the Mexican government to pay for a wall. Without that funding source, he will either have to use money borrowed from China (assuming they are still willing to buy our debt) or renege on this promise as well. He is most likely to label the questioner a 'Trump hater' and just avoid answering altogether.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468627390", "commentID": 19165465, "userID": 11868412, "recommendations": 33, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165465}, {"approveDate": "1468674472", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468670872", "permID": "19164634", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "durham, nc", "parentID": null, "userDisplayName": "winthropo muchacho", "commentTitle": "<br/>", "commentBody": "Now that the GOP ticket is set it is of signal importance that the American public know if Mr. Trump's business acumen is as advertised.<br/><br/> In this regard the best objective measure is what Mr. Trump submits on a yearly basis to the Internal Revenue Service of the United States under penalty of perjury. These are called in common parlance tax returns.<br/><br/>He has thus far refused to disclose his tax returns and as the Notorious RBG pointed out so acidly in her remarks about Mr. Trump, the media, including the Times, has thus far given Mr. Trump a free pass of his nondisclosure.<br/><br/>This deafening silence from major media is curious and extremely troubling.<br/><br/>The Times Editorial Board rightfully called out Justice Ginsburg. It's now time they call out Mr. Trump, over and over again if necessary, until disclosure is had or a legitimate reason for nondisclosure  is supplied ( and being under current audit is not one of them).", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468621533", "commentID": 19164634, "userID": 33997311, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19164634}, {"approveDate": "1468674605", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468671005", "permID": "19165068", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new hartford, ny", "parentID": null, "userDisplayName": "upstate ny", "commentTitle": "<br/>", "commentBody": "Thanks, New York Times for your timely background reports on Mr. Pence. I just wonder if his conciliatory approach to his opponents will wither in Mr. Trump's harsh shadow? I seemed to find more common ground between the two than you did. At least Trump realized the other guys had plenty of strikes against them (a half dozen divorces between Trump &amp; Gingrich, for example). <br/><br/>As a Republican turned Independent (where, oh where has Bernie gone?), I abhor Pence's endorsement by the NRA and the charade-debacle over Planned Parenthood. You noted that even some conservatives were appalled by Pence's attempted ban against abortion of fetuses which were determined to have \"disabilities.\" <br/><br/>Trump's VP choice might have made the Republicans more repugnant to some, but still not enough to sway me to the Democratic ticket with its questionable leader (dozens of strikes against her) Clinton. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468624402", "commentID": 19165068, "userID": 11139244, "recommendations": 6, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165068}, {"approveDate": "1468674667", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468671067", "permID": "19165190", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Ancient Astronaut", "commentTitle": "<br/>", "commentBody": "Trump's playing it safe now, and that will be his downfall. His core base won't be pleased with this conservative, establishment choice. Moreover, I don't see Trump getting along with Pence, and I won't be surprised if this marriage doesn't last. Christie is a more natural choice for someone like Trump. This will be fun.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468625110", "commentID": 19165190, "userID": 56534644, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165190}, {"approveDate": "1468674769", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468671169", "permID": "19165375", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florida", "parentID": null, "userDisplayName": "MBC", "commentTitle": "<br/>", "commentBody": "So, Donald told us he is running against Washington insiders, political elites, those who supported the Iraq war and the TPP.   He is self funding his own campaign so he won't owe lobbyists or Washington elites anything.<br/><br/>Sounds good in a stump speech but, nowhere near reality<br/><br/>Mr Pence has a history of doing all the \"bad things\" Trump is running against so, now he is on the ticket.   Trump is raising money for his self funded campaign??   <br/><br/>Can't people see through this charlatan?<br/><br/>Wake up America before it's too late ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468626513", "commentID": 19165375, "userID": 61043115, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165375}, {"approveDate": "1468674833", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1468671233", "permID": "19162620:19165403", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Mary Scott", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Omaha", "parentID": 19162620, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "I don't know under what theory you can 'demand' a trade for Trump doing what every recent candidate has done. <br/><br/>The private Wall Street speeches are, as you said PRIVATE. What do you think entitles you to transcripts? <br/><br/>There is no proof that her foundation is illegal, that is just a RWNJ talking point. <br/><br/>She has not been charged with perjury therefore, there is nothing to plead.<br/><br/>Your 'deal' sounds more like a GOP fantasy and is actually nothing but a smokescreen attempting to keep Trump from having to release his tax returns. <br/><br/>The canard that he can't release them until the audit concludes is a red herring. First of all, there is no law or regulation requiring that he NOT release the returns. There is nothing in those returns that the IRS doesn't already know so, there is no risk of changing the outcome of the audit. His lawyers can drag the audit on for basically, as long as they want. Since the IRS can't talk, the public has no way of knowing whether the audit is ongoing or not. <br/><br/>The ONLY reason Trump has for not releasing them is POLITCAL; he isn't worried about the IRS here, he is worried about what his current supporters and undecided voters will see in the returns. <br/><br/>He brags about how well he 'works the system' but, he is afraid to show how he does it. It appears that he is a coward which, is not an uncommon trait among bullies. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468626767", "commentID": 19165403, "userID": 11868412, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165403}, {"approveDate": "1468674881", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468671281", "permID": "19165512", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, IL", "parentID": null, "userDisplayName": "LaylaS", "commentTitle": "<br/>", "commentBody": "Pence also shepherded through legislation that criminalized women who seek abortions if their fetuses are genetically abnormal.  Or if they had miscarriages because their fetuses were genetically abnormal.  Of course anti-women, anti-abortion legislation does not receive the same national outrage or attention that anti-LGBT legislation does, but both are heinous.<br/><br/>#periodsforpence", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468627787", "commentID": 19165512, "userID": 2692255, "recommendations": 45, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165512}, {"approveDate": "1468675741", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468672141", "permID": "19165804", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "heartsny", "parentID": null, "userDisplayName": "MIMA", "commentTitle": "<br/>", "commentBody": "Isn't it great that the second highest potential position in this land was announced by Twitter?<br/><br/>Now doesn't that show real American class?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468629856", "commentID": 19165804, "userID": 51905269, "recommendations": 39, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19165804}, {"approveDate": "1468675889", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468672289", "permID": "19166558", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "R1NA", "commentTitle": "<br/>", "commentBody": "I think Trump blew it with this decision.  He took the safe bet but consequently risks important votes from Democrats like me that were supporting his anti-establishment self-funding platform. I'd have been far happier had he picked Marsha Blackburn.  I might have to abstain from voting this round as Hilary is totally unpalatable.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468635732", "commentID": 19166558, "userID": 75700093, "recommendations": 3, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19166558}, {"approveDate": "1468676251", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468672651", "permID": "19167674", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "TMK", "commentTitle": "<br/>", "commentBody": "What's obvious about this opinion and related anti-Pence comments is the lack of any real mud to swing at Pence.  Everyone agrees though: Pence will help Trump get elected.  The rest is basically a list of his positions on various issues and spinning them as negatively as possible.  <br/><br/>Hey, he signed legislation against gender-based discrimination.  One would expect that would at least make the NYT happy, concede as much.  Who cares how he got there?  What matters is that he's demonstrated the ability to listen and compromise in favor of liberals, despite his own personal convictions.  A rare quality on both sides of the aisle these days. <br/><br/>This has got to be the most grudging endorsement of any candidate in NYT history.  It almost feels like high hopes were placed on Trump messing-up his Veep choice and dooming his campaign.  Aka wishful thinking, now confirmed dashed.  To the contrary, worst fears have been realized: a VP choice unquestionably smart, one who'll pick apart the opposition both in debates and also in office, one who'll propel Trump to the WH and much more beyond that.<br/><br/>In other words, Pence appears to have reinforced on the NYT, the long-denied inevitability of Trump getting elected.  All the say-it-ain't-soing aside, a endorsement is what this opinion really is, for both Pence, and by extension, his boss, for picking him.  Finally, even the NYT has gone from anti-Trump roar to polite squeak!  Go Trump!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468648785", "commentID": 19167674, "userID": 37192798, "recommendations": 1, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19167674}, {"approveDate": "1468677058", "commentType": "comment", "userTitle": "NULL", "updateDate": "1468673458", "permID": "19169279", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "HRM", "commentTitle": "<br/>", "commentBody": "Pence has a purpose. He brings in a lot religious conservatives. He will still be a vice president and as such, not much power. He does have experience in congress and as the executive in the state's political makeup as governor. He understand how governments work Trump will need help and guidance with the mechanics of governing, especially with a divided and in some cases, hostile senate and house.  He doesn't own the majority of shares. He is a business person. He knows negotiation an compromise are needed in making a deal. So he will know when to hold the line and when to bend.  He knows that the court had authority concerning such things as abortion and gay rights. So he wont waste a lot of time on agendas he knows he can't change and more time on things like the economy and trade. We will see. None of this speculation means anything if he loses.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1468674728", "commentID": 19169279, "userID": 50437790, "recommendations": 2, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19169279}], "totalEditorsSelectionReturned": 20, "replyLimit": 3, "totalRecommendationsReturned": 19, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 485, "api_timestamp": "1488822358", "totalReplyCommentsFound": 167, "totalCommentsReturned": 20, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}