{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 15, "totalParentCommentsFound": 374, "totalEditorsSelectionFound": 15, "depthLimit": 0, "totalRecommendationsFound": 482, "comments": [{"approveDate": "1476432207", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476428607", "permID": "20133967", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "Trump treats the media as if they exist to give him unconstrained airtime, and he becomes pugilistic when they do their job.<br/>During the first primary debate, he got into a sexist, nasty attack on Megyn Kelley who dared hold him to his own words.  There was the time he ejected from a forum Jorge Ramos, who was roughed up, for daring to ask a pointed question.  Then there was the horrific mocking of a disabled NYT reporter.  When Trump's tough talk on China did not square with his proposed trade tariffs, as he explained to the NYT in person, he pretended the paper was wrong as always.  Threats of cutting off media access are instinctive for Trump.  And of course Trump was caught so flat-footed with the release of his old tax returns, Trump had to fault the Times for the static he got.<br/>If Trump is irate, you are doing a great public service, first by showing us the truth of the matter (which does not square with Trump's own talk) and second, by showing what a budding dictator Trump is for fighting a free press.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476416372", "commentID": 20133967, "userID": 40118532, "recommendations": 791, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20133967}, {"approveDate": "1476432330", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476428730", "permID": "20134047", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Rand", "commentTitle": "<br/>", "commentBody": "As someone from Europe watching this disaster unfold I just want to thank the New York Times and its reporters for their courage and their service to the United States. You are true patriots, not the fake GOP kind that talk of patriotism but actively work to undermine the US by further riling up their base with lies about its president and the state of the country.<br/><br/>I live much much closer to Russia than Americans. I can tell a Putin trajectory when I see one. And it is clear to me that Trump is on his way to become America's Putin. He has already coarsened your national discourse and harmed your unity and forever tarnished your reputation abroad. Even if he loses, he has fulfilled every FSB dream by causing lasting damage to the United States and the relationship with its allies. And he will do everything to derail Ms. Clinton's presidency, starting with sowing doubts about the legitimacy of her election. As I said: He has delivered on everything his advisers with their Kremlin ties ever dreamed of.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476417976", "commentID": 20134047, "userID": 73210063, "recommendations": 1296, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134047}, {"approveDate": "1476435786", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476432186", "permID": "20134552", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ramat-Gan", "parentID": null, "userDisplayName": "Joshua Schwartz", "commentTitle": "<br/>", "commentBody": "I wish I had a dollar (price up from a nickel) for every threatening letter sent by lawyers with no basis in law and reality.<br/>One pays lawyers, inter alia, to threaten to sue so that they do not have to.<br/>There are countries in which the losing party in a lawsuit has to pay his or her opponent's law fees. That tends to cut down on nuisance lawsuits, the next step after the threatening letter. While Mr. Trump may not care about the money, paying the lawyer of one's opponent is somewhat embarrassing. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476433298", "commentID": 20134552, "userID": 53713809, "recommendations": 151, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134552}, {"approveDate": "1476438963", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476435363", "permID": "20134706", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Other Left Coast", "parentID": null, "userDisplayName": "dpr", "commentTitle": "<br/>", "commentBody": "Mr Trump would have to be a fool to actually sue The New York Times. As the plaintiff in a civil suit, Mr Trump would be subjecting himself to being deposed by the Times' lawyers. The 5th Amendment does not apply in civil suits, and no judge would allow the plaintiff in such a suit avoid being deposed when his own conduct is at issue. The subject of the allegedly libelous article would allow Times lawyers to question Mr Trump about very personal matters he would undoubtedly prefer to leaved unprobed. Even though his fury at the article is palpable, it's hard to believe that he would ever voluntarily submit himself to that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476436727", "commentID": 20134706, "userID": 13799373, "recommendations": 754, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134706}, {"approveDate": "1476439007", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476435407", "permID": "20134757", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dover, NJ", "parentID": null, "userDisplayName": "George N. Wells", "commentTitle": "<br/>", "commentBody": "Mr. Trump's behavior on the campaign trail has been one of libel, slander, and defamation towards many individuals and groups. He and his followers are satisfied that their rights are preserved under the concept that all \"political speech\" is protected. <br/><br/>At the same time Mr. Trump is outraged that anyone would attack him with facts that tarnish his self-image. This behavior looks a lot like that of a sociopath to me, and perhaps others. <br/><br/>Typical of the \"Bully\" Trump can dish it out, but cannot \"take-it\" and he simmers and boils over whenever his persona is critiqued. <br/><br/>That the tape of Trump with Billy Bush is what finally rile up the RNC bothers me more. Mr. Trump's campaign has been one of smear, lies, bias, innuendo, slander, defamation, and libel from the start. Only now do we hear from the RNC establishment when they feel they must protect their daughters, sisters, wives and mothers. What about protecting all the other Americans that Trump has maligned since he opened his campaign? Perhaps the RNC should declare moral bankruptcy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476437973", "commentID": 20134757, "userID": 3017703, "recommendations": 1059, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134757}, {"approveDate": "1476440873", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476437273", "permID": "20134904", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Miami Beach", "parentID": null, "userDisplayName": "Aurace Rengifo", "commentTitle": "<br/>", "commentBody": "An empty threat does reflect on the bully. He is not only ignorant about the Constitution but also about the premise of a modern State: the separation of powers along with the most powerful enabler of checks and balances, the free press.<br/><br/>Donald hallucinates of being a king, not a president, back when kingdoms did not have legislatures or courts. So if he was President and Congress would not approve the Executive budget, he would think that he can switch the approval to the Supreme Court.<br/><br/>Donald thinks that the Constitution he ignores, it is optional. Like, Maduro.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3060/7067/cropped-30607067.jpg?0.8467663380294262", "createDate": "1476440399", "commentID": 20134904, "userID": 30607067, "recommendations": 268, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134904}, {"approveDate": "1476440897", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476437297", "permID": "20134909", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tennessee", "parentID": null, "userDisplayName": "KJ", "commentTitle": "<br/>", "commentBody": "Most spoiled brats flop down on the floor and scream and beat their fists on the ground when they don't get their way.  But Donald Trump is very rich and has a collection of expensive attorneys to cater to his whims.  I can just hear him yelling, \"This is unbelievable!  Do something!\"  So they put their collective heads together and threatened The Times.<br/><br/>I see Trump cheerleader Billy Bush has gone into defense mode also.  Did Trump lend him a lawyer? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476440438", "commentID": 20134909, "userID": 63446969, "recommendations": 345, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134909}, {"approveDate": "1476441129", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476464083", "permID": "20134990", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 23, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "The editors shouldn’t have sought to wage this legal fight in the paper itself: it’s unseemly.<br/><br/>Moreover, it has the cess of self-interested desperation. If Trump can demonstrate that the Times has embraced an objective of denying him the presidency (hardly a stretch) and that its publication of the charges at question was done without minimal vetting of authenticity, then he may well have a case. There have been enough instances where even public figures have proved knowing libel in court by news organizations that a Trump win of such a claim isn’t unthinkable. Freedom of the press is not the same as license in the name of ideological interest.<br/><br/>So, perhaps it’s time again to focus on Black Lives Matter, and not on a legal dispute where the New York Times is a party.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1476441079", "commentID": 20134990, "userID": 47123844, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20134990}, {"approveDate": "1476448035", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476463904", "permID": "20136313", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Ed", "commentTitle": "<br/>", "commentBody": "Trump will not win his lawsuit... and shouldn't.  The Times has not reported on anything that isn't newsworthy.<br/><br/>But, let's not pat ourselves on our backs for self-righteous indignation with the thought, \"How dare he!\" in our heads. The Times isn't objective. It is clearly in the tank for Hillary.   This morning's Op-Ed columns are proof: The GOP, after Trump; Donald versus the Free Press; How Dictatorships are Born (It's time to tell Trump to go back where he came from...); Clinton Agenda (A Large margin will be necessary for an effective presidency...); Burning Down the House (Evil Trump... blah, blah, blah...)<br/><br/>If America responds to any portion of Trump's self-indulgent nonsense, that will be it. Until the mainstream Press goes after both candidates with equal scrutiny, then the Press is part of the problem in politics.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476448020", "commentID": 20136313, "userID": 55384043, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20136313}, {"approveDate": "1476448568", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476463936", "permID": "20136458", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Longmont, Colorado", "parentID": null, "userDisplayName": "Nick Metrowsky", "commentTitle": "<br/>", "commentBody": "This editorial would be true, if The New York Times was reporting the campaign without any bias. But, for months, this newspaper has, in editorials, and articles (which were more or less opinion pieces), how it has gone out of its way to support Hillary Clinton. The bias started with the Democratic primaries, when this newspaper endorsed Hillary Clinton, in January. From that time, through the primaries, Bernie Sanders was mostly reported with a negative bias, if he was mentioned at all. The same tactic has been used on Donald Trump. The Clinton supporters, in these blogs were allowed great freedom to attack anyone who supported anyone, but Clinton; it continues to this day. <br/><br/>As for Trump, legally he has no case, because there is clear evidence thanks to a video released last Friday. And, proof, that he was involved in other lewd incidents, have been verified. So, in the letter of the law, The New York Times did not commit libel, and Trump's accusers did did not commit slander.<br/><br/>But, what The New York Times is guilty of is bias, and sensationalist journalism. During the past week, while Trump continues to sink into the mire, to glee of this newspaper and Clinton supporters, more and more is coming out about Clinton and her e-mails. This has been reported, by this newspaper, as more of an afterthought.<br/><br/>We get it; Trump should not be near the White House. But, if the GOP chose a better candidate, right now we will be talking about getting Clinton out of the race; not Trump.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4320/06/cropped-432006.jpg?0.9859529515459333", "createDate": "1476448559", "commentID": 20136458, "userID": 432006, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20136458}, {"approveDate": "1476449289", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476463958", "permID": "20136657", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ohio", "parentID": null, "userDisplayName": "J.", "commentTitle": "<br/>", "commentBody": "Trump's supporters are now lashing out at the press, as demonstrated by the angry mob at his rally in Cincinnati last night. We are living in dangerous times when too many in the electorate do not understand or value the absolute necessity of a free, unfettered press.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476449234", "commentID": 20136657, "userID": 52197876, "recommendations": 166, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20136657}, {"approveDate": "1476450976", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476463990", "permID": "20137111", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Rita", "commentTitle": "<br/>", "commentBody": "Trump''s assault on Freedom of the Press goes hand in hand with his assault on other Constitutional provisions  like the protection of religion, freedom from torture, right to due process (\"lock her up\") etc.  <br/><br/>He wants to run the country like his business. Like a dictator.  Free from constitutional restraints. Free from Congress.  Free from the courts. Free from the press.<br/><br/>Yes, the NY Times has been unrelenting in its editorial pages against the Trump candidacy.  As it and news media should be.  The man is dangerously unprepared, mentally, emotionally and intellectually, for the Presidency.  To stay silent in the face of this danger to the country would be wrong.<br/><br/>Yes, The NY Times reporting has been too often one-sided and frivolous.  Trump's ascendancy can be partially attributed to the endless reporting of Trump as spectacle, rather than as candidate.  For every four daily stories about Trump, or his drama with his campaign staff or the RNC, there was one story about Clinton, usually about emails or her lack of rapport with the media.  <br/><br/>We depend on the news media and the respective parties to research the candidates before they win the nomination.  Both the Republican Party and the news media gave Trump's history a pass until recently.  <br/><br/>The NY Times and other news media are now trying to make up for this dereliction.  It looks like piling on Trump only because the news media is doing now what they should have done earlier.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4734/9721/cropped-47349721.jpg?0.17552296142093837", "createDate": "1476450944", "commentID": 20137111, "userID": 47349721, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20137111}, {"approveDate": "1476460625", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476464096", "permID": "20136784", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "CFD-Dr.", "commentTitle": "<br/>", "commentBody": "Donald Trump is a flawed candidate. But NYT, guilty of libel or not, did irreparable damage to its own reputation during this election cycle--turned itself into a biased, tabloid paper brushing its expertise in yellow journalism. I have been a regular reader of NYT for last 30 years, and I barely glance this newspaper now a days. What is the mission? Get Hillary elected at any cost?   Get Trump defeated at any cost? Even at the expense of NYT's own reputation? It is always easy to ruin reputation, not so easy to gain it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476449705", "commentID": 20136784, "userID": 65246367, "recommendations": 11, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20136784}, {"approveDate": "1476461016", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476464127", "permID": "20139053", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington", "parentID": null, "userDisplayName": "Texas voter", "commentTitle": "<br/>", "commentBody": "Trump publicly bragged about how easy it was for him sexually assault women. You reported it. Women came forward to show how easy it actually was for Trump to do it. You reported it. That is good journalism - keep it up. Trump will crash and burn soon - we cannot let the same happen to our country, our constitution, and our democracy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476457807", "commentID": 20139053, "userID": 160389, "recommendations": 89, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20139053}, {"approveDate": "1476461787", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476458187", "permID": "20136987", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Middle America", "parentID": null, "userDisplayName": "D.A.Oh", "commentTitle": "<br/>", "commentBody": "This is his knee-jerk reaction to anything that looks at him funny: sue, sue, sue.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476450528", "commentID": 20136987, "userID": 57609397, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20136987}], "totalEditorsSelectionReturned": 15, "replyLimit": 3, "totalRecommendationsReturned": 15, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 668, "api_timestamp": "1488822331", "totalReplyCommentsFound": 294, "totalCommentsReturned": 15, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}