{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 5, "totalParentCommentsReturned": 20, "totalParentCommentsFound": 480, "totalEditorsSelectionFound": 33, "depthLimit": 0, "totalRecommendationsFound": 502, "comments": [{"approveDate": "1442992507", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443016796", "permID": "16165113", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland, OR", "parentID": null, "userDisplayName": "usa999", "commentTitle": "<br/>", "commentBody": "In a country where most people who self-identify as \"Christian\", including self-identified evangelicals or fundamentalists are \"cafeteria Christians\" who are selective and sporadic adherents to those elements of their faith that are acceptable or convenient at the moment, I find it puzzling that public sentiment assumes Muslims are any different. Just as with Christians there are some who deeply observant in their religious beliefs and traditions, many who are casual or convenient, and some whose perspectives or behavior have nothing to do with the faith they presumably hold. Ms. Kim Davis has performed a public service by asserting she is a Christian while demonstrating a wide range of behavior and attitudes inconsistent with Christianity. Yet for some reason political leaders, public figures, and pundits imply all Muslims demonstrate a deep religiosity and  promotion of their faith that threaten the rest of us. By that test the United States is doomed as the country is overrun by Christian fanatics, not populated by people nominally identified as Christians but who are also Rotarians, engineers, Texans, scout leaders, skiers, soccer fans, stockholders, ex-felons, birders, etc. Why is it that our multiple identities convey an acceptable pluralism  but one segment is identified solely on religious grounds in a way seen as unacceptable. Would we identify Jews as a threat because the most observant among us foster beliefs and behaviors others find repugnant and threatening?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442992451", "commentID": 16165113, "userID": 41855254, "recommendations": 214, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16165113}, {"approveDate": "1443004640", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006565", "permID": "16163754", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Newton, Ma", "parentID": null, "userDisplayName": "Mo M", "commentTitle": "<br/>", "commentBody": "Protestants have overwhelmingly dominated in this country as far as being elected to our two highest offices.<br/>We have had only one Catholic Vice-President, Biden, and one Catholic President, Kennedy, and he was assassinated. Astounding for a country as old as ours, but not surprising with \"quiet\" prejudice that still exists against Catholics. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6826/0433/cropped-68260433.jpg?0.9578941753134131", "createDate": "1442971492", "commentID": 16163754, "userID": 68260433, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16163754}, {"approveDate": "1443004852", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006600", "permID": "16163771", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "ATL", "parentID": null, "userDisplayName": "mford", "commentTitle": "<br/>", "commentBody": "Recently, Salman Rushdie was asked what he thought about the current role of religion in world affairs. He said, quite simply, that he is bewildered by the fact that it has become so important again. Fifty or 100 years ago, world affairs were driven by other ideas and religion had faded into the background, into private and social life, where it belongs. Now, rather suddenly, religion has made a huge comeback in both national and world affairs, and it's not a welcome change if you ask Mr. Rushdie (or me). <br/><br/>As for Ben Carson, it is important to keep in mind that he is an avowed Creationist who believes, quite literally, that the theory of evolution is the devil's handiwork. He sees the human brain and all its trillions of synaptic connections as a perfectly ordered system. Since, in his view, the universe is already perfectly ordered, he must believe he has a defined (divined?) place within that order, and evidently this place involves joining a highly elite club including some of the most powerful humans in history. Whether he wins or loses is, of course, is dependent on the will of God, like all things. <br/><br/>I cannot relate in any way to this mindset. I do not understand how a neurosurgeon can believe any such thing, but evidently some do. I think his beliefs are absurd and I am concerned that such absurdity influences the laws of society. <br/><br/>But I also know one other thing: Ben Carson is still qualified to be president. That's the American way. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442971624", "commentID": 16163771, "userID": 46918499, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16163771}, {"approveDate": "1443004901", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006610", "permID": "16163788", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arizona", "parentID": null, "userDisplayName": "Chris", "commentTitle": "<br/>", "commentBody": "The only appropriate response to anyone who claims President Obama is a Muslim:<br/><br/>\"Actually, he is a Christian, but what difference does it make if he is Christian, Jewish, Muslim, Buddhist, Hindu, another religion or a non-believer?  We don't live in a theocracy.\"", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5821/3233/cropped-58213233.jpg?0.6062000496312976", "createDate": "1442971803", "commentID": 16163788, "userID": 58213233, "recommendations": 503, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16163788}, {"approveDate": "1443004932", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006633", "permID": "16163790", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Illinois", "parentID": null, "userDisplayName": "Hz", "commentTitle": "<br/>", "commentBody": "This is a much-needed piece which hits all the right points.<br/><br/>Growing up, I thought overt racism and bigotry could never return to the levels depicted in history class textbooks. But ever since 9/11, it has been open season on Arabs and Muslims. It is wholly acceptable in some sections of American society openly bash and discriminate against these groups. Even worse, supposedly progressive elements (including the White House) stay silent and allow this behavior to fester.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442971822", "commentID": 16163790, "userID": 57101500, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16163790}, {"approveDate": "1443005767", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006683", "permID": "16165785", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": null, "userDisplayName": "Gene", "commentTitle": "<br/>", "commentBody": "I am sure there are Muslims who accept American values and the Constitution.  I am also sure that there are Muslims who do not.<br/><br/>The issue is how to tell the difference.  When the leaders of a Mosque advocate violence and the members don't throw them out or resign, the members are telling us how they feel.  When their family members advocate violence against the US, go to a Muslim country to join ISIS, etc. and they don't report it, they are supporting Muslim violence.<br/><br/>It doesn't matter what Muslims say.  it is what they do to clean up their own house that counts.<br/><br/>Of course, it is not easy.  Freedom has never been free.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4182/2569/cropped-41822569.jpg?0.5850894991295603", "createDate": "1443005718", "commentID": 16165785, "userID": 41822569, "recommendations": 144, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16165785}, {"approveDate": "1443006886", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006301", "permID": "16163902", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles, CA", "parentID": null, "userDisplayName": "Paul Frommer", "commentTitle": "<br/>", "commentBody": "So the good Dr. Carson states, “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”<br/><br/>Let's take that same statement and make one small substitution: “Evangelical Christians feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”<br/><br/>I wonder how Dr. Carson would feel about that, given that he supported Kentucky's Kim Davis when she stood in the way of issuing marriage licenses to same-sex couples, in defiance of the Supreme Court and the law of the land. Apparently it's fine to \"make religion very much a part of your public life and what you do as a public official\" if you're a Christian, not so much if you're a Muslim.<br/><br/>Double standard, anyone?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442972859", "commentID": 16163902, "userID": 62324919, "recommendations": 668, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16163902}, {"approveDate": "1443008648", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443006161", "permID": "16166158", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Mary Scott", "commentTitle": "<br/>", "commentBody": "I was recently admitted to the hospital for a brief stay and the care was excellent and the professionalism and expertise of the entire staff, at all levels, was quite remarkable. What was most striking was the diversity of the staff, how well they performed together and how little country of origin, religious and cultural differences matter when all are engaged in the same mission, in this case, caring for the sick and saving lives.<br/><br/>Disrespect for non-whites and people from different cultures &amp; class is a current that runs through enough Republican voters and even some Democratic ones, that it's become  the most divisive and unjustified element  of our political system and indeed, our civic duty to work together, despite our differences, in moving our country forward to the benefit of all of us.<br/><br/>There should be no acceptance of the obnoxious rhetoric being advanced by Trump and Carson and  other political leaders that unfairly target specific groups  as somehow not worthy to be considered as fully American as they and their supporters perceive themselves to be.<br/><br/>As I observed and benefited from diversity in action, it occurred to me I was seeing America at its best and it reinforced in me my long held belief in the inherent truth in the notion of \"E Pluribus Unum\"  and how its embrace is one of our greatest assets as a country. The ugly rhetoric we've been subjected to, especially in the last decade, has no place in our political discourse nor our civic engagement.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443008600", "commentID": 16166158, "userID": 43644377, "recommendations": 276, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16166158}, {"approveDate": "1443014565", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1443010965", "permID": "16166158:16166992", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "Mary Scott", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Stamford, Ct.", "parentID": 16166158, "userDisplayName": "Conservative &amp; Catholic", "commentTitle": "<br/>", "commentBody": "What seems to be lost here is the context. When someone mentions Muslim in a question it isn't interpreted as \"moderate Muslim\". Just as when someone mention immigrants they are not talking about legal immigrants who entered the US and are present here because they followed an approved process. I would not vote for a radical Muslim and more than I approved of the idea of providing a path to legal residency for people who have broken our laws to be present in this country. Citizens, citizenship, requires conformance to our laws. If you don't like the law here you can follow the proscribed process to change it or you can leave.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6242/2606/cropped-62422606.jpg?0.7682710848076022", "createDate": "1443013150", "commentID": 16166992, "userID": 62422606, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16166992}, {"approveDate": "1443015702", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443012102", "permID": "16164102", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles, California", "parentID": null, "userDisplayName": "Matt", "commentTitle": "<br/>", "commentBody": "I'm sure a good portion of the coastal, 'enlightened' Americans found Ben Carson's comment about not advocating a muslim for the US presidency reprehensible. As do the NYT editors, apparently. And of course it is not a constitutional requirement that one adhere to any religious position.<br/><br/>However, merely voicing the idea that Islamic beliefs are not amenable to western, democratic values (like those in the US Constitution) is not crazy, nor bigoted, nor racist. It is simply the intelligent recognition that Islam carries with it a different view of the way in which religion and the state interact and relate to one another.<br/><br/>Bernard Lewis, formerly professor of Near East Studies at Princeton University, famously wrote in 1990:<br/><br/>\"This is no less than a clash of civilizations—the perhaps irrational but surely historic reaction of an ancient rival against our Judeo-Christian heritage, our secular present, and the worldwide expansion of both. It is crucially important that we on our side should not be provoked into an equally historic but also equally irrational reaction against that rival.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442974950", "commentID": 16164102, "userID": 62544129, "recommendations": 90, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164102}, {"approveDate": "1443017904", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1443014304", "permID": "16163609:16164402", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "David Underwood", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "ATL", "parentID": 16163609, "userDisplayName": "mford", "commentTitle": "<br/>", "commentBody": "There are secular Muslims just as there are secular Christians and it is possible to identify as \"faithful\" without adhering literally to every line of one's preferred Holy book. You could ask the same exact types of questions to a Pat Robertson or Falwell, whose fundamentalist tendencies Americans (on a national level) have soundly rejected in the past and will continue to do so. <br/><br/>Granted, many politicians may claim to be fundamentalists of one stripe or another, but in practice they cannot function as fundamentalists because we have a secular society and a relatively well-oiled system of checks and balances.<br/><br/>So, your questions are moot. A US president, Muslim or whatever, cannot undo our economic system. It does not matter if he \"opposes paying interest.\" Unless elected along with a Congress in 2/3 agreement and 5 SCOTUS votes (not to mention a mandate to start WW3) this hypothetical fundamentalist president will be powerless to impose such beliefs on US society. <br/><br/>This is why our system is the way it is and why it really does not matter what one wing of the party believes right now. They cannot change the foundations of the American legal system without massive political upheaval and revolution, and many (including myself) will gladly fight and die to prevent any such thing. But it won't come to that, because no matter how loud they are, they're still a minority. My guess is that minority will get even louder in the near future, but it won't grow.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442978227", "commentID": 16164402, "userID": 46918499, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164402}, {"approveDate": "1443018232", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443014632", "permID": "16166621", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Saint Augustine, Florida", "parentID": null, "userDisplayName": "Carolyn", "commentTitle": "<br/>", "commentBody": "I'm generally in agreement with the NYT Editorial Board, but not this time. Of course, Carson made bigoted remarks, and we don't want to see that in a president or for that matter, a presidential candidate.  But we also need to clarify the difference between former immigrants and the immigrants that are flooding Europe, and would flood America as Kerry and Obama have encouraged.  <br/><br/>Radical Islam is a fact that we must face, and there will be a number of terrorists that will infiltrate the ranks of displaced people seeking asylum.  Those terrorists will reek havoc in Europe and the U.S., and as we know, are capable of horrific crimes against innocent civilians.  We have yet to hear of any program or programs that will be in place to make sure that Muslim immigrants - a group in which terrorists can use a shield or disguise - are properly vetted before entering the country.  And Ben Carson is right about Sharia law, like it or not.  It is a law that fuses - not God - but a tribal interpretation of God into the law of the land along with all its own extreme biases.  We are already fighting that battle in this nation with regard to women's rights as they are interpreted by a segment of religious extremists that want to impose their own beliefs on everybody else.    Unfortunately, Ben fits that description, and hence, we certainly don't want him in the top office either.   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6733/4363/cropped-67334363.jpg?0.139570734036513", "createDate": "1443011292", "commentID": 16166621, "userID": 67334363, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16166621}, {"approveDate": "1443018460", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443014860", "permID": "16165779", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westlake, OH", "parentID": null, "userDisplayName": "Barbara", "commentTitle": "n/a", "commentBody": "I find I am unexpectedly grateful to be living in a community that has changed rather substantially in the 25 or so years I have been here, as it now has a significant Arab population that my children were fortunate to have grown up knowing as individuals. Many are Muslim, some are Christian, and it never really seemed to be an issue. Well, it did surface briefly when Ramadan occurred during the peak of pre-football season two- and three-a-day practices, with concerns about what physical stress that might place on some of the players. But they didn't ask for excessive accommodation, and to my knowledge it hasn't been noticeable in other meaningful areas of social engagement. From what I have seen, these kids deserve the same opportunities as any others, and if that means some of them will one day aspire to public office, well, more power to them. It's how America is supposed to work.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443005673", "commentID": 16165779, "userID": 28040900, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16165779}, {"approveDate": "1443018747", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1443015147", "permID": "16163609:16165181", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David Underwood", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson, MS", "parentID": 16163609, "userDisplayName": "David L, Jr.", "commentTitle": "<br/>", "commentBody": "Islamic Modernists do not accept that bank interest is the equivalent of Riba (usury), nor is there a consensus on the issue -- there have been many fatawā issued permitting interest. As for this being a strictly Islamic precept, do see the Pentateuch and the Gospels of Luke and Matthew. In Christendom, interest was forbidden to clerics in 314, to laymen in 1179. The interdiction only began to fall apart in the sixteenth century. That interest itself was not usury, that there was a distinction, wasn't decided upon by the Church until the nineteenth century.<br/><br/>As for the golden age of peaceful coexistence in Spain before the Alhambra Decree, it's a nice story, but largely untrue -- which is not to say that it can't happen and hasn't happened before, only that that particular example, though often cited, is largely mythological.<br/><br/>It'd be nice to have a Muslim president, assuming I agreed with the platform and admired the man (or woman). It'd be good for moderates around the world. Though we aren't at war with Islam, too many Muslims see themselves as at war with us. Of course, some of our progressive intellectuals will tell you that is due to our predatory military ventures and support for autocrats in the region; but they don't know what they're talking about.<br/><br/>The essentialism in amateur \"analyses\" of Islamism (e.g., Glenn Beck's book) is dangerous. The worst thing we can do is shut Islam out of the modern world. Let's shun both naïveté and ignorance-induced Islamophobia.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6688/9060/cropped-66889060.jpg", "createDate": "1442995050", "commentID": 16165181, "userID": 66889060, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16165181}, {"approveDate": "1443023181", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443019581", "permID": "16168449", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "As a neurosurgeon, Dr. Carson ranks among the very best. But as has become more obvious since the good doctor has morphed into the poor candidate, being a master in one field does not automatically translate into mastery of another. Great businesspersons do not become great politicians because they equate business with government declaring that they will bring their corporate acumen to the world of politics. Again, it's often a terrible mix because the two are completely different species. <br/><br/>We tend to decry the political pro, the career politician. They are easy targets and we love to make fun of them. They are walking contradictions and that's because in the Real World there are no easy answers, no simple solutions to complex problems, especially in a democratic republic. Never has been, never will be. Politics is a muddled mess, a long slow slog, a mass of legalese and bureaucratic red tape. It is not for the faint of heart, or the thin-skinned. It takes a massive ego to withstand the constant onslaught from the public and the press. In a world where everything goes viral, it is amazing anyone would want the job. But they do, and they are far from perfect, but they have a most difficult if not impossible task. They have to please all of the people all of the time. Honest Abe couldn't do that.<br/><br/>Doctor Carson may have a perfect success rate in the operating room. Candidate Carson will be gifted, and lucky, if like a baseball player he can manage to bat .300. <br/><br/>DD<br/>Manhattan ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443020010", "commentID": 16168449, "userID": 22528152, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16168449}, {"approveDate": "1443024712", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443021112", "permID": "16165649", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "BillOReits", "commentTitle": "<br/>", "commentBody": "Republicans just love to pick the low hanging fruit. They hammer away at gut wrenching issues and lean on the anger buttons of a class of people who thoroughly enjoy having someone famous giving them excuses for their failures while reveling in spurious justifications for their hate. \t\t\t\tIt’s also a lot easier to pander to a misinformed base than trying to come up with and defending good policy. Republicans have done this for years with overblown side issues like abortion and immigration. Notice that once in power, Republicans quickly shelve these issues for the next campaign. Few if any Republican leaders really care about them in terms of policy but they are critically aware that the existence of their party depends on this gimmickry and the ability to con people into voting against their own economic interests.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443004459", "commentID": 16165649, "userID": 30625437, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16165649}, {"approveDate": "1443025578", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1443021978", "permID": "16163609:16164232", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David Underwood", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cranford, NJ", "parentID": 16163609, "userDisplayName": "Sue K", "commentTitle": "<br/>", "commentBody": "Why assume that a Muslim candidate would have any more conviction to place his/her beliefs over the rule of law than, say, a Catholic candidate?<br/><br/>The Catholic church stands four-square against abortion, yet several Catholic lawmakers have declared that while their personal beliefs are consistent with church teachings, they would not stand in the way of laws which allow abortions. As moderates, they contend that their beliefs are theirs alone, not to be imposed on the citizenry at large.<br/><br/>Why would we assume that no Muslim candidate or office holder could be as moderate?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442976386", "commentID": 16164232, "userID": 25737924, "recommendations": 35, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164232}, {"approveDate": "1443026038", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443022438", "permID": "16164299", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ near NYC", "parentID": null, "userDisplayName": "Jim inNJ", "commentTitle": "<br/>", "commentBody": "Muslim are people.  Individuals.  They don't deserve the remarks Carson directed at them, or wholesale precluded from the Presidency.<br/><br/>But Islam is a religion and social system that frightens many of us.  The fear is of the totalitarian nature Islam often takes.  In almost all Islamic majority nations the rights of people of other religions to practice their religion are curtailed.  In the worst cases, they are subject to violence.  Women's rights are sharply curtailed.  The religious rights of Muslim themselves to leave or alter their religion are curtailed.  Hash and immoral punishments are meted out.<br/><br/>The editorial's statement that:<br/>\"As for Shariah law, Catholicism has canon law and Judaism has the Halakha and nobody is painting them as threats to the republic — at least not this year.\"<br/><br/>But neither cannon law or Halakha is enforced in _any_ nation.  The same is not  true of Sharia.<br/><br/>Is Sharia a threat to the US. No, but that is partly because the country is not nearly majority Islamic.<br/><br/>The discussion of Islam in the US is a mess.  Those on the right come near to a racial prejudice in many cases.  But, the left and a part of the middle close their eyes hard to the real dangers of a often extreme religion. We need to find a middle way and a real dialog with Muslims, and about the future of Islam.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442977100", "commentID": 16164299, "userID": 7281054, "recommendations": 41, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164299}, {"approveDate": "1443026077", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1443022477", "permID": "16163609:16164301", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David Underwood", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SF", "parentID": 16163609, "userDisplayName": "Jesse", "commentTitle": "<br/>", "commentBody": "You do recognize the leap you're making? Nobody is nominating Islamists for President. I'm Jewish, and I'd hardly vote for an ultra-Orthodox settler type who believes racist things about Arabs and won't sit next to a woman on a plane. But that doesn't mean I'm going to therefore tar myself, or any other Jewish person, with those beliefs. Why then make that leap with Muslims and make assertions about what \"Islam\" believes? What does \"Judaism\" believe? What does \"Christianity\" believe? And note that Carson was not in any way making any distinctions; for him, any and every Muslim is apparently thirsting to impose shari'a (as the editorial notes, quite the irony, given the Kim Davis situation) at a moment's notice.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442977103", "commentID": 16164301, "userID": 3795840, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164301}, {"approveDate": "1443026253", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443022653", "permID": "16164365", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "AK", "commentTitle": "<br/>", "commentBody": "Ben Carson is not wrong - if you hold many verses of the Quran to be true, you aren't fit for civil society, let alone civil service. The problem is it's equally true of other religions. So either renounce those tenets (which amounts to renouncing your faith - word of God, no?) or don't get involved in policy-making that affects large numbers of people. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442977867", "commentID": 16164365, "userID": 68089116, "recommendations": 35, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164365}, {"approveDate": "1443026303", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443022703", "permID": "16168912", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Centennial, Colorado", "parentID": null, "userDisplayName": "Diana", "commentTitle": "<br/>", "commentBody": "I am a liberal, but I must confess that I wrestle with worrying about how women would be treated should a person who embraces Islam be elected President.   I also have the same worries about those who are orthodox Jews and evangelical Christians.<br/><br/>While I certainly believe everyone has the right to worship according to his or her beliefs, I also strongly believe that religious convictions have no place in a workplace nor in becoming an elected official.  I am a staunch advocate for separation of Church and State.  For some who belong to certain religious faiths, is this possible?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443022154", "commentID": 16168912, "userID": 22629813, "recommendations": 52, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16168912}, {"approveDate": "1443026427", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443023885", "permID": "16164405", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bloomington IN", "parentID": null, "userDisplayName": "Jonathan", "commentTitle": "<br/>", "commentBody": "The attacks against Ben Carson are essentially unfair. It is true that he should have spoken with more nuance, but it is also essentially true that a Muslim cannot profess Islam and defend the Constitution, a secular document, at the same time. The same can be said of any person practicing any religion that pretends a theocracy rather than a secular democracy.  Evangelical Christians in the US--Kim Davis included-- are wrong on this account as well.  One hopes the press illuminates the issue of islam, sharia law, theocracies, and their relationship to Western secular democracies, rather than to fall in unsubtle \"political correctness\".  Freedom of religion does not translate to freedom to practice your religion instead of defending the Constitution.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442978237", "commentID": 16164405, "userID": 20526596, "recommendations": 41, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164405}, {"approveDate": "1443026766", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443023166", "permID": "16166094", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Branford, Florida", "parentID": null, "userDisplayName": "Thomas", "commentTitle": "<br/>", "commentBody": "The good thing here, and now, is that people recognize this form of hate much more readily.  Many of us recall the suspicion about John F. Kennedy being Catholic and a potential  pawn of the Vatican. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1443008142", "commentID": 16166094, "userID": 63573784, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16166094}, {"approveDate": "1443027863", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443024263", "permID": "16166346", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "boston, ma", "parentID": null, "userDisplayName": "daddy mom", "commentTitle": "<br/>", "commentBody": "No religion is consistent with Constitution.  <br/><br/>Catholics don't allow women into the priesthood, Evangelicals uphold 'God's law' over US law (ask Mike Huckabee), Quakers are pacifists, most religion practice 'seperate and not quite equal' when it comes to gender equality. It's a long list of practices that are not consistent with the Constitution.<br/><br/>There is one group that is consistent with the Constitution, atheists....meanwhile, they are the only group lower than Muslims when Americans were polled about preferences for presidential candidates and religion.<br/><br/>Ironic.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6254/4492/cropped-62544492.jpg?0.38770558568648994", "createDate": "1443009677", "commentID": 16166346, "userID": 62544492, "recommendations": 116, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16166346}, {"approveDate": "1443028755", "commentType": "comment", "userTitle": "NULL", "updateDate": "1443025155", "permID": "16164595", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Anna Jones", "commentTitle": "<br/>", "commentBody": "The Republicans attack on Muslims is totally out of line but they are playing into a real fear that Islam is not compatible with western values. And are they right?<br/><br/>Over the past year, Boko Haram and ISIS has launched terrifyingly violent attacks on non-Sunni Muslims, Iran's Ayatollah Ali Khameneil urged Islamic unity against the US and Israel, and an unprecedented level of rape has been used in the name of Allah against women. Saudi Arabia treats women like children and in Pakistan a young girl can't go to school without being shot. <br/><br/>Americans are understandably scared and shocked at the rise of a religion that seems to support this violence and discrimination. In order to help ease these fears, it is not productive to discount them or write them off as racist. <br/><br/>We need a moderate Muslim and American voice raising these issues in a productive way to help us better understand how our cultures can fit together.  What we don't need is hyperbolic political rhetoric or op-eds like this that dismiss the concerns of millions of Americans without taking a serious look at where they come from. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442980718", "commentID": 16164595, "userID": 66124275, "recommendations": 39, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16164595}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 902, "api_timestamp": "1488822362", "totalReplyCommentsFound": 422, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}