{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 13, "totalParentCommentsFound": 288, "totalEditorsSelectionFound": 14, "depthLimit": 0, "totalRecommendationsFound": 442, "comments": [{"approveDate": "1466592622", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466589022", "permID": "18911268", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "FDK", "commentTitle": "<br/>", "commentBody": "It is burdensome and difficult to become a refugee. They are the most vetted, questioned and scrutinized immigrants you will find. As a lawyer, I have worked on asylum applications, which take years and are successful only for the most deserving. As an immigrant, lucky enough to have married a US citizen and gotten my green card and citizenship with relative ease, I can appreciate the difficulty of immigration proceedings for people fleeing war. As the mother of a 9-year-old who has spent the last year learning about what it means to be a refugee thanks to his excellent public school teacher, I say all third graders should learn about the refugee crisis. That may turn out more informed and engaged citizens who can live up to the ideal of \"the welcoming nation of immigrants\" that the USA is supposed to be. <br/><br/>It is shameful to let down the most vulnerable among us. My son was inspired to start a petition to as the President and Congress to welcome more of them: <a href=\"http://petitions.moveon.org/sign/help-refugees-come-into\" title=\"http://petitions.moveon.org/sign/help-refugees-come-into\" target=\"_blank\">http://petitions.moveon.org/sign/help-refugees-come-into</a>. I am proud of him. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466565014", "commentID": 18911268, "userID": 55170772, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18911268}, {"approveDate": "1466594640", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466591040", "permID": "18911572", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "MC", "commentTitle": "<br/>", "commentBody": "For a country that bills itself as the \"Home of the Brave\" we are very easy to succumb to the politics of fear, even when those fears are irrational. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466572386", "commentID": 18911572, "userID": 15926510, "recommendations": 128, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18911572}, {"approveDate": "1466594703", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466591119", "permID": "18911607", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bronxville NY", "parentID": null, "userDisplayName": "JR", "commentTitle": "<br/>", "commentBody": "The U.S. historic record of receiving refugees is not always great, although the Afghan translators and the small number of Syrian refugees seem to be new lows. There are hundreds of thousands of Syrian refugees in Germany today. In the 1930s my wife's family fled Germany. Her grandparents found refuge in Iran (!). Of two great uncles, one stayed and was murdered in Auschwitz. Another came to the United States, only to be deported (fortunately to Italy and not Germany), We have a Holocaust museum on the Mall, but we don't honor the Holocaust victims when we do little for today's refugees.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2293/084/cropped-2293084.jpg?0.7311336428834486", "createDate": "1466573845", "commentID": 18911607, "userID": 2293084, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18911607}, {"approveDate": "1466601298", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466597698", "permID": "18911941", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Planet Earth", "parentID": null, "userDisplayName": "thewriterstuff", "commentTitle": "<br/>", "commentBody": "How about we just enforce the laws that are already in place.  An illegal immigrant has committed and illegal act and should be deported, period.  I am an immigrant, it was a long, hard process, but I would no more stay in a country without proper documentation than break into your house and expect to stay in the spare bedroom. By enforcing the laws, I would also include anyone that employs an illegal without proper documentation or fake documentation: the factory worker, the nanny, the housekeeper, the gardener, the laborer, the roofer, the person who cuts your toenails.  Fine the employers, jail them if they do it twice.  And finally, get rid of the H-1B and H-2A program that employers regularly abuse to employ cheaper workers from other countries.  Lots of American jobs have been lost as employers have abused this system. Finally, students who abuse visa privileges and overstay should not be allowed back in.  This is not 1880 and quoting the Statue of Liberty, is a little outdated.  Importing groups of people en masse that take resources away from citizens who are already overstretched is neither xenophobic or racist, it's realistic. And how about a discussion of the exploding populations in these countries, which is leading to mass migrations.  But no, we can't have a sensible conversation about what we really need in this country, which is sensible immigration policy and border control or we're splitting up families..there has to be middle ground. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6078/7691/cropped-60787691.jpg?6390556551073557905", "createDate": "1466588871", "commentID": 18911941, "userID": 60787691, "recommendations": 175, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18911941}, {"approveDate": "1466601798", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466598198", "permID": "18912093", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Stuart", "commentTitle": "<br/>", "commentBody": "As usual, position is framed as either/or.  Wouldn't it be great if the NYTimes could author an Op/Ed with some balance on the discussion?<br/><br/>Our immigration policy can be neither open nor closed.  The immigration that we cite, Ellis Island, was supported (and restricted) by an ocean.  It was not made of porous \"guest worker\" migrants, and it was not the result of a resettlement policy born of genocide.  We are in uncharted waters, so it is fair and reasonable for people to disagree with approach.<br/><br/>If we are to continue to thrive as a nation, we need to agree on a few principles.  First, we will never be able to accommodate as many displaced people as our hearts ask of us.  As the world's richest nation, that supply will be inexhaustible.  Second, America continues only when an immigrant sheds a certain amount of \"independence\" and becomes part of the \"melting pot\".  The voguish hyphenation trend is anathema to that requirement.  Finally, the country has no responsibility to \"enable\" any policies that work against assimilation.  Immigration must be founded on integration, language acquisition, and expectation of immediate contribution to the common good.<br/><br/>We are a country of open hearts.  However, we do our current citizens, going through tectonic economic shifts, no favors when we treat immigration as some parlor game among the intellectual class.<br/><br/>Immigration is our future.  People like Donald Trump do not articulate a future.  But it is a debate we must have with each other.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466591066", "commentID": 18912093, "userID": 43645449, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912093}, {"approveDate": "1466606649", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466603049", "permID": "18912221", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chapel Hill, NC", "parentID": null, "userDisplayName": "Lindybelle", "commentTitle": "<br/>", "commentBody": "This is issue is taking a great amount of energy out of our country.  We spending time and energy on this when we could be focusing in on pressing issues facing the people who are already living here, including citizens who have deep roots and commitment to this country.  Why are we importing workers when we have plenty of people.  Is it because our schools are not good enough?  Let's focus on that.  Why are drugs such a problems in so many communities, especially in places where the economy is struggling.  Let's focus on that.  Why are our prisons filled with young people?   Have they no hope?  Let's focus on that.  Our philosophy on immigration was founded in the early years of our nation as a way to get more people here to build a country.  What goes unsaid is how much money this costs American citizens.  The Boston bombers came here on a tourist visa and received welfare.  Americans worked to support them!  and look at the appreciation we received.  We provide schooling, food, housing, medical care.  That is costly!  This country is built now and we did it, our ancestors, and yet we seem intent on giving it away.  This planet can not continue to support more people and more people.  The future for our children and all future generations  will be compromised.  This issue is not about any one group of people but about who owns this country and do we have the right to determine our destiny. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466592564", "commentID": 18912221, "userID": 49754702, "recommendations": 74, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912221}, {"approveDate": "1466607264", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466603664", "permID": "18912399", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Louisville, KY", "parentID": null, "userDisplayName": "Girish Kotwal", "commentTitle": "<br/>", "commentBody": "I agree we cannot slam shut America's door to the refugees. If we do we sink the values that the statue of liberty symbolizes. At the same time we need to do everything possible restore the homelands of those who are escaping the miserable conditions resulting from the cross fire and brutal attempts at regime change. We cannot mistreat the refuges and herd them like cattle. Five years ago some of the Syrians seeking refuge were well settled in the cradle of civilization and would never have thought they would meet this desperate fate. Western powers changed their plight by supporting and arming the rebels in an attempt to depose the Syrian dictator Assad, I met a Swiss citizen during my recent visit to the Nordic countries and he was upset about the large influx of North African refugees in his country and he blamed the invasion of Iraq by Bush as a cause for refugee influx. I agree that invasion of Iraq was a blunder but to associate the current epic refugee migration cannot be linked totally to the Iraq invasion. Instead it can be associated with the Arab spring in Libya, Yemen, Syria fueled by the then secretary of state Sec. Clinton and members of US congress. President Obama admits his mistakes in letting things go out of hand during his watch. So it is not just a moral responsibility to not slam shut the door but it is responsibility we need to take for our Middle East and North Africa foreign policy blunders in this century.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466594280", "commentID": 18912399, "userID": 69024476, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912399}, {"approveDate": "1466607335", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466603735", "permID": "18912411", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Summit", "parentID": null, "userDisplayName": "Rick", "commentTitle": "<br/>", "commentBody": "There's a difference between slamming the door and inquiring whether people felt gay people and Jews should be killed. Can we at least keep the haters out? Maybe each immigrant should require the approval of a gay man, a rabbi and a feminist. If they want to kill us, why let them into the country?<br/><br/>We spend $7 billion a year on the TSA to stop people from blowing up planes; we are now considering repealing the Second Amendment and yet in other countries people use suicide vests, car bombs and knives. Wouldn't it be more effective to keep the haters out?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466594438", "commentID": 18912411, "userID": 643009, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912411}, {"approveDate": "1466609657", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466606057", "permID": "18912674", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "Pallas Athena", "commentTitle": "<br/>", "commentBody": "A thought. If we keep our nose and special ops out of their country, then we have no reason to accept their immigrants.  But, the same people (no names) who favor continued military intervention and war are the same ones who then complain about poor refuges from those same nations. <br/><br/>About 1% of the population of the US is muslim. That would be about 3,000,000 individuals. Out of that number, how many 'American born' children of immigrant parents have committed these atrocious acts like the ones in Orlando and San Bernardino.  Two? Three?<br/>And, the reason these acts were so heinous is because these deranged individuals were able to get their hands on assault weapons. <br/><br/>What's the excuse for the tragedy that killed nine people in a church or the unspeakable events in Newtown, where 26 children were killed in a classroom.  Where were those shooters from? How about their parents? <br/><br/>It is interesting to note that Canada has accepted far more muslim immigrants than the US and has not experienced any of the horrible events that have taken place here. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4963/4231/cropped-49634231.jpg?0.5606321383684771", "createDate": "1466596479", "commentID": 18912674, "userID": 49634231, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912674}, {"approveDate": "1466613000", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1466609400", "permID": "18911626:18912915", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "William. Beeman", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Indiana", "parentID": 18911626, "userDisplayName": "scott_thomas", "commentTitle": "<br/>", "commentBody": "Emma Lazarus' sentimental poem, written in 1883, was for a different nation in a different world. It was of a nation with an industrial base the growth of which can only be termed explosive— factories were going up even in very small towns, and all those people were needed to crew them. The USA was rapidly developing into the manufacturer to the world.<br/><br/>Now we are the world's customer, not its provider. We have enough people here now, and we don't need mobs of illegals entering our workforce and further depressing wages.<br/><br/>Ideals are nice, but are they always reality? Doubtful at best.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4687/1648/cropped-46871648.jpg?8877846701819934059", "createDate": "1466597978", "commentID": 18912915, "userID": 46871648, "recommendations": 32, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18912915}, {"approveDate": "1466613172", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466609572", "permID": "18913066", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "EastCoast25", "commentTitle": "<br/>", "commentBody": "Immigration reform is needed.  Governing and making decisions is act of balance. All views must be taken into consideration, compromise is necessary.  This polarized political climate we're living is getting (all of us) nowhere.<br/><br/>Waves of immigrants in decades past coming to America assimilated and acculturated to western values. Does making that statement make me xenophobic even though I have a good friend who is Moslem (albeit secular)? If I'm concerned about the 50 million Americans living below the poverty level, rampant income inequality and food insecurity in America vs. increasing immigration right now does that make me xenophobic? <br/><br/>Our hearts aren't closed to the suffering of refugees, but this must be a balanced conversation and dialogue to advance towards real immigration reform where many variables are taken into account and there is compromise.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466598791", "commentID": 18913066, "userID": 64651096, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18913066}, {"approveDate": "1466613266", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466609666", "permID": "18913071", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Luxembourg", "parentID": null, "userDisplayName": "Marie", "commentTitle": "<br/>", "commentBody": "Taking the example of Afghanistan it is only fair and right to let people in who helped the US and/or other countries military, as they are being seen as traitors in their countries and we know what that means. Also, doors should not be closed for all other refugees.<br/>However - while, hopefully, most of the refugees may feel some gratitude (although there are refugees who do not hide their sense of entitlement) for finding a new life in the receiving countries, this article fails to mention their offspring. What about the next generation's possible frustration, their anger of not \"having it all\", what if, due to a conservative muslim upbringing, they disagree with open, free societies so strongly that they feel the urge to turn to violence or terror? This will probably be a minority, but we see in Belgium, France, the US ... to what it can lead. To describe this as home grown terror is, in my opinion, too easy and incomplete.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466598824", "commentID": 18913071, "userID": 60119483, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18913071}, {"approveDate": "1466614726", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466611126", "permID": "18913277", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "jpduffy3", "commentTitle": "<br/>", "commentBody": "Maybe the Editorial Board should have studied the NYT article How Do You Stop a Future Terrorist When the Only Evidence Is a Thought?\" that appeared elsewhere in today's NYT and addressed it in their editorial.  The \"Future Terrorist\" article makes some very good points.  They should have been addressed rather than ignored.  <br/><br/>Both Mateen and Abballa were on the radar of the relevant authorities in the US and in France, respectively, yet they both killed in the name of ISIS.  Given a choice between being politically correct or dead, most of us would likely not choose dead.  We do not understand what makes a terrorist, and it does not seem likely we will learn any time soon.  Monitoring potential terrorists is not a workable solution, and, in fact, it does not work, as Mateen and Abballa clearly show.  So, what are our realistic choices?  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466599850", "commentID": 18913277, "userID": 36458645, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18913277}, {"approveDate": "1466614778", "commentType": "comment", "userTitle": "NULL", "updateDate": "1466611178", "permID": "18913340", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Johnstown, PA", "parentID": null, "userDisplayName": "wco0436", "commentTitle": "<br/>", "commentBody": "\"The impulse to slam the door shut on some of the world's most vulnerable people is not new\".<br/>I work part time in a free medical clinic and I can tell you that the good old US already has plenty of vulnerable people.<br/>Far from ending America's healthcare problems, the Affordable Care Act seems to have created as many problems as it has solved.<br/>Charity begins at home. Before we begin importing more vulnerable people, let's take care of the one's already here with jobs, healthcare (including adequate addiction treatment services) and housing.<br/>Providing welfare and Medicaid to millions of legal and illegal immigrants will put additional strain on a social services system which already doesn't work for many of our disadvantaged.<br/>Let's return to a policy of controlled immigration.<br/>Conservatives aren't the only one's capable of abandoning common sense for adherence to ideological orthodoxy.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1466600177", "commentID": 18913340, "userID": 21449933, "recommendations": 60, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18913340}], "totalEditorsSelectionReturned": 14, "replyLimit": 3, "totalRecommendationsReturned": 14, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 551, "api_timestamp": "1488822328", "totalReplyCommentsFound": 263, "totalCommentsReturned": 14, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}