{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 595, "totalEditorsSelectionFound": 35, "depthLimit": 0, "totalRecommendationsFound": 606, "comments": [{"approveDate": "1440071664", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440089731", "permID": "15842748", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas and Las Vegas", "parentID": null, "userDisplayName": "Greg", "commentTitle": "<br/>", "commentBody": "Donald Trump is smart enough to know the networks have a problem in that Hillary Clinton is already vetted and a known quantity to Americans. But TV still needs campaign content and buys, and who better than true American opportunist Donald Trump to step into that void and help out. Trump is focused and cutting a wide path on some issues which are important to Americans for Hillary Clinton to become President and achieve more mainstream, bi-partisan support from Congress for action on those same issues. Nobody believes what Trump is postulating (send everyone home, only the good return, big expensive wall- what about the CANADIAN border?) is going to happen, but Trump is sounding the horn to push for \"something\" to happen during the next four year term. Which is well and good.  Likewise he is out front for women's issues and funding. Which is well and good. He is now speaking up for funding for war veterans. Which is well and good. Donald Trump's heart is in the right place on some important things, and nowhere is that more apparent than his going after Jeb Bush, for example, because few want another Bush in the White House. Trump gets it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440066418", "commentID": 15842748, "userID": 56798246, "recommendations": 90, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842748}, {"approveDate": "1440071690", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068090", "permID": "15842749", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "benjamin", "commentTitle": "<br/>", "commentBody": "The Republican candidates as well as those already in office. long ago decided to play to the the inherent prejudices and xenophobic urges of the base.  They sound the drum beat of hatred and anxiety about immigrants,  homosexuals, and the poor. What is incredible ,  frightening  and the height of hypocrisy is that at the same time they are preaching \" Christian values\" and we need to be  more God Fearing  while talking about eviscerating programs designed to help the less fortunate and children in need.  Yet as the polls show a significant portion of the  American electorate buys into this and supports them. When did America , a nation of immigrants , a nation built on religious tolerance and freedom of expression turn into a nation full of angry frightened know nothings?  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440066446", "commentID": 15842749, "userID": 28570285, "recommendations": 506, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842749}, {"approveDate": "1440071820", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068220", "permID": "15842759", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bradley Beach, NJ", "parentID": null, "userDisplayName": "Jim Davis", "commentTitle": "<br/>", "commentBody": "Mr Trump is clearly articulating the ideals and the ideas of the Republican Party.  He is giving his fellow candidates a chance to reveal themselves and state what they stand for.  I am appalled at what is being revealed, but also grateful that Mr Trump has created the circumstances that allows us to see what his party really represents.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440066527", "commentID": 15842759, "userID": 59831007, "recommendations": 505, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842759}, {"approveDate": "1440071923", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068323", "permID": "15842784", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new jersey", "parentID": null, "userDisplayName": "terry brady", "commentTitle": "<br/>", "commentBody": "Me thinkest the EB is stirred up and boiling about Mr. Trump.  Your perfectly paved out logic is indisputable and watching the GOP Presidential wannabes align behind \"The Donald\" like a flying goose formation is stunning.  Honest debate about immigration moved from a middle Right \"Fox News perspective\" to an \"in the ditch dystopia\" or (far Right fringe) nutcase proposals.  This is beginning to appear that the GOP is unhinged and spinning into an irretrievable orb never to be reassembled again.  American fundamentals are strangely good and economic conditions improving to underpin this unhappiness and hate for undocumented immigrants and their children.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440066949", "commentID": 15842784, "userID": 57063965, "recommendations": 101, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842784}, {"approveDate": "1440071985", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068385", "permID": "15842793", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Diego, CA", "parentID": null, "userDisplayName": "Gilman", "commentTitle": "<br/>", "commentBody": "Immigrants come here in search of livelihood, and to take up low-skilled service jobs that many Americans will not do. They toil through long hours in agricultural fields especially in California’s Central Valley fields of produce, which sustains much of the nation. They keep the hotel industry running, washing dishes and cleaning rooms and toilets. They take up risky jobs in construction. I personally know of immigrants who have toiled well into their seventies, permanently disabled through many years of farm work. Employers hire them for the low wages, long hours and lack of benefits that they are willing to put up with. As Cesar Millan once said “We come to give everything we have..we don’t feel entitled. We feel privileged to be in the country”.  Blaming them for the erosion of the middle class, and crime rates is pure wrong. Erosion of middle class has come from offshoring of manufacturing jobs, stagnating wages, and destruction of unions. Trump would rather seize the remittances that poor migrants send to their families, than the billions of dollars invested outside or stashed offshore by corporations without being reinvested in the country. The atrocious claim that immigrants are criminals is massively belied by facts. The country and the world would have lost the enormous contributions from Cesar Millan or Dr. Alfredo Quinones-Hinojosa, neurosurgeon at Johns Hopkins, and countless other immigrant workers like them from Mexico, had we followed GOP’s extreme immigration policies.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440067072", "commentID": 15842793, "userID": 64910284, "recommendations": 627, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842793}, {"approveDate": "1440072115", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068515", "permID": "15842809", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "nyc", "parentID": null, "userDisplayName": "Beth Reese", "commentTitle": "<br/>", "commentBody": "Listening to Donald Trump's \"policies\" on immigration is depressing, but the cheers from his audiences is horrifying. These Republican voters have been conditioned by over 30 years of the GOP \"Southern Strategy\", right-wing radio and Fox News to blame anything wrong in their lives on \"the Other\", be it labor unions, gun control advocates, pro-choice activists, a black man in the Oval Office who's not the butler, or undocumented workers. Perhaps Donald Trump wants to be the star of a new reality series where undocumented families are frog marched across the southern border past stands of cheering \"real\" Americans. Unfortunately he'd probably fill all the spectator seats very quickly. Just think, a 21st century version of the Roman Coliseum \"bread and circuses\". And it's close to happening in the USA. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440067305", "commentID": 15842809, "userID": 65225965, "recommendations": 560, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842809}, {"approveDate": "1440072542", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440068942", "permID": "15842869", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island, NY", "parentID": null, "userDisplayName": "Lorraine Huzar", "commentTitle": "<br/>", "commentBody": "What we are seeing is a resurgence of the anti \"foreigner\" mania that followed World War I into the 1920s. The Immigration Quota Acts sought to severely curtail if not eliminate immigration from places and people that were not wanted here.  In the the 1920s ti was Eastern and Southern Europe ( Read Jews and Catholics) Once again the party of exclusion has chosen a group that they blame for many of America's problems. How convenient that these politicians forger that each and every one of them benefited from either America's period of open immigration, when their ancestors came here, or that they belonged to groups that America welcomed in the 1960s.  The inscription on the Statue of Liberty says \" Give me your your tired, your poor, your huddled masses yearning to breath free....\" The Republican Party's motto should be \"I got mine, the hell with the rest of you\"  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440067741", "commentID": 15842869, "userID": 60998173, "recommendations": 597, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842869}, {"approveDate": "1440072664", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440069064", "permID": "15842886", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Crete, Illinois", "parentID": null, "userDisplayName": "soxared04/07/13", "commentTitle": "n/a", "commentBody": "A marginal but dangerous demagogue has hijacked the Republican party. I disagreee that Donald Trump's appeals to racism are \"subtextual;\" they are blatantly obvious. When one singles out a specific group as owning many or all of the worst characteristics to be found in the human condition, that \"one\" is making a definitive, blanket statement: one size fits all. Our immigration problem with Mexico turned mean because of our historic land-grabs from them and from Spain. The ancient grievances were exacerbated by our finacial and material prosperity. Americans have been encouraged to think of the people south of our borders not as neighbors but as enemies, intrusive and secretive. Contrast these stereotypes with Canada; is there an anti-Canadian crusade abroad in the land to limit their comings and goings? Donald Trump is the current poison in the kool-aid, but it was poured into the well of national debate by right-wing zealots whose misplaced idea(s) of patriotism long ago paid its wages to blind xenophobia. The party's hierarchy of old money and grudging reluctance to modern realities created a vacuum into which sinister reactionary forces found, at first, a harbor, then a beachhead from which to stage and marshal their forces of hate. Mr. Trump's value, so far, anyway, has been to reveal the ugly core at the center of our immigration issue. His panicked rivals see how successful division is; they're caught up in the anti-immigration whirlpool from which there's no rescue.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6633/2358/cropped-66332358.jpg?0.4549111335899837", "createDate": "1440067902", "commentID": 15842886, "userID": 66332358, "recommendations": 265, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842886}, {"approveDate": "1440073055", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1440069455", "permID": "15842526:15842973", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Renaldo", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Nebraska", "parentID": 15842526, "userDisplayName": "Hjalmer", "commentTitle": "<br/>", "commentBody": "I live in a State that has been losing population in 75 of its 93 counties for decades.  As towns shrink and schools close for want of people, it's clear to me that immigrants are a precious resource that we haven't made the best use of.  This feckless band of Republican candidates pedal the notion we'd be better off without our immigrants.  It's laughable.  Who do American think in putting that abundant inexpensive food supply in their grocery stores?  Who picks and ships our fruit and vegetables?   Who do Americans think slaughters the hogs and cattle that stock our meat cases with pork and beef?  Who milks all those cow that end up stocking the dairy case?  You can bet that none of my neighbors are hoping THEIR grandchildren end up in those occupations!  Trump has revealed the utter moral cowardice of the Republican candidates for President in far more stark terms than any Democrat ever could.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440068774", "commentID": 15842973, "userID": 27587377, "recommendations": 539, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15842973}, {"approveDate": "1440079140", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440075540", "permID": "15843030", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "LindaP`", "commentTitle": "<br/>", "commentBody": "So now we really see it. This is what it takes to truly pander to the heart of the GOP base. This is how far down a pol has to go to win the primary for the leader of the free world--the win secured by xenophobic, homophobic, ill-informed, low-information, racist, bigoted, working-against-their own-interests voters. This small slice of the American electorate is now in charge of the topics featured on every news cast, the front page of the NYT, and every other outlet out there giving voice to the political platform they salivate for and crave made manifest by by Donald Trump. The host of other GOP now predictably racing to the bottom with him.<br/><br/>We really do have Mr. Trump to thank for finally stripping the GOP bare to its core and showing us the totality of the kind of country we would be living in under their rule. Don’t like the 14th amendment? Just get rid of it. Love the fetus, leave the child in despair. Bombing is answer to everything worldwide, and let’s allow guns absolutely everywhere. It is a dystopia beyond my wildest imaginings. You can’t make this stuff up, but I wish we were. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5577/4376/cropped-55774376.jpg?0.06288681339079605", "createDate": "1440069210", "commentID": 15843030, "userID": 55774376, "recommendations": 365, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843030}, {"approveDate": "1440079618", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440076018", "permID": "15843955", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Horsham, PA", "parentID": null, "userDisplayName": "Grandpa Scold", "commentTitle": "<br/>", "commentBody": "As a twenty-two year-old woman from Colombia, my wife came to this country earnestly eager to assimilate into a culture she greatly admired. For her, this was a land of promise for the hard working, looking for opportunities and equal justice under the law. She believes in the mythical American Dream and its offer of a level playing field, where merit not birthright, is the determining factor in one's success.<br/><br/>She attended a local college at night to learn English while working the day shift at a convenience store. From there, she continued her advancement throughout the years, eventually becoming a successful businesswoman and educator.<br/><br/>She and I are grateful to live in this country and people who know my wife are grateful to her for the values she brought with her from Colombia. Immigrants bring a new prospective in our melting pot of cultures. It's what makes America exceptional.<br/><br/>These calls for keeping the immigrants out is just a rehash of what The No Nothing Party of the 19th century was saying to my Irish ancestors. We ignored them as we should with the calls we're hearing today.<br/><br/>A call that doesn't \"appeal to our better angels\" as Lincoln would have it, but to fear and small mindedness. My wife and I still believe in the America of inclusiveness .", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6576/8738/cropped-65768738.jpg", "createDate": "1440074997", "commentID": 15843955, "userID": 65768738, "recommendations": 217, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843955}, {"approveDate": "1440079784", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440091338", "permID": "15844695", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, DC", "parentID": null, "userDisplayName": "DCBarrister", "commentTitle": "<br/>", "commentBody": "As a Black man, a millennial in Washington DC, I find this fascinating.<br/>My parents didn't even like each other when the Civil Rights Movement was happening in America, but as an attorney with a degree in American History, what we are witnessing with Donald Trump resembles the classic American social movements that changed our nation for the better.<br/><br/>The establishment (i.e. the corporate news media/political parties) clearly want Donald Trump out of the 2016 race.  But in a grassroots swell of support, the American people want Trump to stay.<br/><br/>Illegal immigration is a profitable commodity for the establishment. The news media gets a new demographic to advertise to, the liberal establishment gets new voters (who aren't citizens, but I digress) and the GOP establishment gets favors from corporations who hire illegals to cut costs and maximize profits. So this is a win-win for them.<br/><br/>The American people are fed up. Any sane, decent person realizes that allowing the law to be broken, is at the very least unfair to those of us who obey the law and at worse an abdication of Constitutional duty as a public official. <br/><br/>I understand the personal stories, so do millions of Americans. But if personal hardship and family issues don't allow ordinary Americans to rob banks, drive drunk, attack innocent people or avoid paying taxes, then violating federal law on entering the United States should not be allowed either.<br/><br/>It's common sense. Trump has seized on this, and he's winning for it.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4285/0188/cropped-42850188.jpg?0.8073964922914212", "createDate": "1440078317", "commentID": 15844695, "userID": 42850188, "recommendations": 79, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15844695}, {"approveDate": "1440079946", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440076346", "permID": "15843549", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jersey City", "parentID": null, "userDisplayName": "SteveS", "commentTitle": "<br/>", "commentBody": "Trump is removing the pretence of decency from a large segment of the Republican base revealing them for the racists that they are.<br/><br/>The only difference between Trump and the others here is that the others use code words and phrases to appeal to this base and Trump is direct and honest. <br/><br/>The real problem is with this very politically active, but inherently racists, segment of the Republican base.  The problem with the Republican candidates is that none of them are above appealling to this part of the base.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440073039", "commentID": 15843549, "userID": 547542, "recommendations": 114, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843549}, {"approveDate": "1440081356", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440077756", "permID": "15843710", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "honolulu", "parentID": null, "userDisplayName": "qcell", "commentTitle": "<br/>", "commentBody": "As a legal immigrant who became naturalized citizen.  I have always been outraged age how the illegals have flaunted the laws and taken advantage or our Nations generosity and then always pushing for more and more privileges.  I am thankful for Mr Trump who is able to verbalized the outrage that I and many others have been holding.  His proposals are no more extreme than the immigration policies that Nations like Mexico has in place to deny privileges to their illegals.  For the Editorial Board to categorize people like me as \"Republicans\" of \"far-right\" is offensive and ignorant at best. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440073840", "commentID": 15843710, "userID": 60574091, "recommendations": 52, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843710}, {"approveDate": "1440081391", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440077791", "permID": "15843199", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Emile", "commentTitle": "<br/>", "commentBody": "Trump is disgusting overall, and his immigration \"policies,\" in their blatant racism and cruelty, particularly disgusting. But this doesn't mean that the laws on immigration shouldn't be more rigorously and fairly enforced, or that they don't need revising, or even that the birthright amendment, ratified in the mid-19th century, is no longer a good thing for this country. Why is it horrible to say any of this? The 21st century requires an immigration policy that balances compassion for the many migrants who want to come here with compassion for struggling Americans already here. <br/><br/>A real discussion about illegal immigration would have to include the fact that  Americans need to own up to their hypocrisy. They may openly fret over illegal immigration, but they like the fruits of the cheap labor of illegal immigrants. <br/><br/>It's wishful thinking, but it would be nice if Trumps ugly talk about immigration morphed into an open and honest discussion--more open and honest that that of the Editorial Board of the Times--of the both the strains and gains of illegal immigration. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440070563", "commentID": 15843199, "userID": 34466522, "recommendations": 58, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843199}, {"approveDate": "1440081455", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440089934", "permID": "15843250", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "rtj", "commentTitle": "<br/>", "commentBody": "You helped create the Trump monster too, NYT, take a bow.  Trump is lancing a boil that has festered because both Democrats and Republicans have tiptoed around the issue of immigration while dismissing the concerns of Americans who have seen their wages flatlined and jobs disappear, workforce participation at the lowest levels in decades.  GDP up, along with the Gini coeffecient.  While school and healthcare budgets get stretched to the breaking point.  Bet you think it had nothing to do with with the low Dem turnout last November too.<br/><br/>If Trump induces an adult conversation about illegal immigration, based in reality with pros and cons, costs and benefits, and some workable solutions mooted, then possibly we'll get lucky and he'll disappear while more sensible and less odious heads prevail.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440070927", "commentID": 15843250, "userID": 69313662, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843250}, {"approveDate": "1440081536", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440077936", "permID": "15843213", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": null, "userDisplayName": "georgiadem", "commentTitle": "<br/>", "commentBody": "In 1987 I started employing a Latina woman to help me with cleaning my home. As a mother and a full time worker I needed someone to clean once a week. She still works for me. <br/><br/> In the early 80's she had left Mexico with her husband to find work and a better life for her children,  entering the US illegally. After we had known each other for a long time, she described to me how she came to be here. It did not sound remotely easy, but did sound scary and difficult.  I consider her my friend. Our children played together, she went on vacation with us with her children. She and her husband worked very hard, saved almost every penny they earned, bought a home here, and one in Mexico for her mother to live in. Her 2 children were born here and both went to college. One is a physician in Mexico now because the tuition for medical school in Mexico is very affordable. The other is more American than Mexican and is attending college here. She applied for and was granted amnesty by RONALD REAGAN in the early 80's. She is now a full citizen of the USA. So here is just one story of an illegal immigrant who has contributed to our society, and still does. Her family pays taxes and are model Americans. They are not criminal or rapists Mr. Trump.<br/>We are all immigrants to this nation unless we are Native American. You don't look like an American Indian to me Mr. Trump. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440070649", "commentID": 15843213, "userID": 56882632, "recommendations": 246, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843213}, {"approveDate": "1440082982", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440079382", "permID": "15843444", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Hampshire", "parentID": null, "userDisplayName": "AM", "commentTitle": "<br/>", "commentBody": "Trump's immigration proposals are not \"despicable;\" they are too idiotic to be despicable.  Trump is an entertainer, playing in the fields of politics. We take his offerings too seriously when we call them despicable.<br/><br/>If you let a car salesman apply for a NASA engineering position, don't complain when he argues that a rocket should be available in a convertible.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5851/2226/cropped-58512226.jpg?0.0592005995567888", "createDate": "1440072302", "commentID": 15843444, "userID": 58512226, "recommendations": 102, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15843444}, {"approveDate": "1440087404", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440083804", "permID": "15845437", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massapequa Park, NY", "parentID": null, "userDisplayName": "Eugene Patrick Devany", "commentTitle": "<br/>", "commentBody": "The Dark Skin Side of Government Zoning, Immigration and Private Clubs<br/><br/>We can “Make America Great Again” (Trump’s slogan) by separating the commoners from the talented and the poor from the wealthy. This Trumpian strategy of uses government power to divide and conquer. It is as “natural” as zoning - the same power keeps New York State the most segregated in the country. Children learn to accept the government enforced inequality that increases the housing values of one community and the tax rates in the other.<br/>The southern “wall” Mr. Trump, and too many others, want to build is just another form of zoning that makes it difficult for the poor but does not prevent the free movement of the middle class. When visitors overstay their welcome in the U.S., the “wall” is properly understood as folly. Why sneak in when you can visit and not go home? Some want a powerful political message that “your kind” is not wanted. Just try to buy or even rent in one of Mr. Trump’s neighborhoods. He does not design and build integrated communities.<br/>Ironically, the Trumpian approach is as appealing to wealthy Democrats as it is to wealthy Republicans. The poor can only be accepted if they know their place, follow the rules and idolize wealth with all available government policy. Imagine the possibilities if single family zoning was replaced by family freedom which allowed people of different races to share homes and apartments in one of Trump’s neighborhoods (without being one of the servants).", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440081703", "commentID": 15845437, "userID": 65021610, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15845437}, {"approveDate": "1440087513", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440083914", "permID": "15845701", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "bkay", "commentTitle": "<br/>", "commentBody": "On the other hand.  This is a time of growing fear.  A time of feeling/being unsafe wherever; whenever.  A time of global instability, unrest, brutality, chaos, mass exodus and the head-losing consequences of being different.  And it's all played out 24/7 on the news irritating and gnawing at our remaining 9/11 still gaping wounds. <br/><br/>Thus, psychologically speaking, perhaps there is a large/small, conscious/unconscious insecure child-like part of many of us that wants to be safe.  That demands safety. Someplace.  Anyplace.  And is finding expression in a kind of nationalistic thinking/behavior.  And that includes reducing or removing differences.<br/><br/>Of course, the rational part of the majority of us rises above insecurity based limited thinking and recognizes that exclusion isn't practical or even ethical.  It's not American.  Inclusion is.  However, for many, like Trump and his buddies, that second part fails to emerge.  Thus, they continue to be influenced by the first part.  And I believe it's that first part that hungers for safety even if that means exclusion that hooks many of us.  The eventual downfall of those ideas?  Our better angels.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6674/6113/cropped-66746113.jpg", "createDate": "1440082620", "commentID": 15845701, "userID": 66746113, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15845701}, {"approveDate": "1440087573", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440083973", "permID": "15846754", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Falmouth, MA", "parentID": null, "userDisplayName": "Rudy Ludeke", "commentTitle": "<br/>", "commentBody": "The question Americans have to ask themselves is how long can we as a mature and highly developed society can support seemingly rampant immigration. Although the overwhelming majority of Americans are descendants of immigrants, their ancestors came to these shores at times where both land and low skilled jobs were plentiful, a situation that is nearing saturation in a matter of at best a few decades. To be successful in the long run- the proverbial American dream- requires the availability of affordable education- predominantly professional degrees from colleges and to a lesser extent skilled trades from community colleges. Sadly these paths are barely affordable to Americans and represent an extremely high barrier for children of unskilled immigrants, legal or otherwise. Unless we, as a society, commit ourselves to make education affordable to all, an ever increasing, poorly educated underclass -both native and immigrants- will be a social and moral dilemma for the nation. We certainly have flourished from the strength of our immigrants, but many of those of the past have been highly educated and could contribute to the economy or intellectual excellence from the day they arrived here. This form of immigration has abated, but we should nevertheless encourage this path more extensively, as the economic well being of most past contributing nations have now approached or even surpassed the US in income and opportunities. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440086677", "commentID": 15846754, "userID": 55426080, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15846754}, {"approveDate": "1440087601", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1440084001", "permID": "15843710:15845887", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "qcell", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, IL", "parentID": 15843710, "userDisplayName": "Uli", "commentTitle": "<br/>", "commentBody": "As a legal immigrant to this country, I have never understood the position of some other legal immigrants such as qcell who are angry at illegal immigrant for breaking the law while they, the \"good,\" law-abiding immigrants, have complied with it.  Overall, the legal and illegal immigrant populations are very different, making such comparisons invalid. \"Legals\" are often comparatively privileged, educated, legally empowered.  It takes money and resources to comply with U.S. immigration laws.  It often takes privilege to get a shot at a Green Card.  That is certainly true for me personally.  Illegal immigrants, in contrast, are often oppressed, underprivileged, destitute, and desperately in search of a better life.  They are in no position to understand and comply with the byzantine U.S. immigration laws.  But they share with the legal immigrants the dream of a better life.  <br/><br/>The situations of these two groups are simply not comparable.  By and large, our experiences as legal immigrants shed no light on, and have no relevance to, the plight of the millions of unfortunates who are here illegally, who have taken existential risks in search of a better life, and who live with uncertainties that I cannot even imagine.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440083346", "commentID": 15845887, "userID": 12865879, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15845887}, {"approveDate": "1440087696", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440084096", "permID": "15845648", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London", "parentID": null, "userDisplayName": "Niall Firinne", "commentTitle": "<br/>", "commentBody": "There is a global phenomena occurring, on both the right and left, where people warm up to people who are refreshing open and unrehearsed.  In the UK  there are people like Nigel Farage and Jeremy Corbyn who become popular because they eschew party lines and political correctness.  Donald Trump falls into that category of candidates that surge because they are different and unafraid to offend.  Whether they can ever win power is highly unlikely for many reasons.  Trump has offended too many people too crassly to win the nomination much less an election. Corbyn can win the Labour Party leadership, but that is really a tiny part of the electorate made up mostly of champagne socialist of North London and militant unionists.  As to Farage, he may well be past his sell by date.  That of course can change depending on the migrant situation and whether the Tories have any success in EU negotiations.      Bottom line, the public, be it in the US, UK, France, Spain or Greece are no longer impressed with identikit candidates that are afraid to offend.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440082474", "commentID": 15845648, "userID": 17454379, "recommendations": 11, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15845648}, {"approveDate": "1440087837", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440084237", "permID": "15844693", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, DC", "parentID": null, "userDisplayName": "Cornflower Rhys", "commentTitle": "<br/>", "commentBody": "Have you ever considered the fact that while Mr. Trump uses offensive, insulting language to express his views, the complaint he makes about illegal immigration is nonetheless a valid one and one with which millions of Americans agree?  They don't necessarily love his \"rapist-murderer\" rhetoric, but they like the fact that he's articulating opposition to the continuing presence of millions of people who entered the country illegally.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1440078315", "commentID": 15844693, "userID": 63664071, "recommendations": 33, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15844693}, {"approveDate": "1440087840", "commentType": "comment", "userTitle": "NULL", "updateDate": "1440084240", "permID": "15844694", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ladera Ranch, CA", "parentID": null, "userDisplayName": "Aaron", "commentTitle": "<br/>", "commentBody": "I too support an \"earned path\" to citizenship, but why do we have to keep an antiquated practice alive [birthright] when it's effects are bankrupting our social systems? Birthright citizenship pre-dates our constitution, as did the medical practice of \"bloodletting\" and we don't do that anymore because we know it doesn't work! Rewrite the 14th amendment. Let's at least talk about it! Why not enter illegally, have a baby, yet the baby gets a temporary ID and deported back to country of origin and we bill whichever country they came from for hospital expenses. Fair and humane.  Problem solved- next!    ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6967/3872/cropped-69673872.jpg", "createDate": "1440078315", "commentID": 15844694, "userID": 69673872, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 15844694}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1037, "api_timestamp": "1488822354", "totalReplyCommentsFound": 442, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}