{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 476, "totalEditorsSelectionFound": 25, "depthLimit": 0, "totalRecommendationsFound": 591, "comments": [{"approveDate": "1474455549", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474466202", "permID": "19868832", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Downtown Verona, NJ", "parentID": null, "userDisplayName": "Socrates", "commentTitle": "<br/>", "commentBody": "Donald Trump, a serial tax-dodger and evader of the highest order, also subscribes to the discredited right-wing theory (fraud) of trickle-down economics that somehow a tax-cut in every home will magically cure the universe of all its complicated problems...a theory most recently exposed as fraudulent in Sam Brownback's Kansas and Bobby Jindal's Louisiana.<br/><br/>Aside from the fact Donald Trump pays few taxes to the government he wants to run, the Trump Tax Plan would collapse government revenues by $10 TRILLION or create $10 TRILLION in new debt unless spending cuts of $10 TRILLION were made.<br/><br/>Americans are a famously cognitively dissonant bunch, either unable, unintelligent or not honest enough to do the basic math and logic that underscores the human reality that taxes are the price of civilization and a functioning government.<br/><br/>Trump the tax deadbeat wants to spread his personal love of tax avoidance nationwide to every American home.<br/><br/>If Trump can stiff the government, why can't everybody stiff the government, right ?<br/><br/>What Donald Trump offers America is a defunded government, a weakened, poverty-stricken government that functions more like a 3rd-world government than a respectable entity.<br/><br/>And even without his destructive tax plan, Donald 'Leona Helmsley' Trump's entire life has been dedicated to the billionaire's clarion call of 0.1% sociopathic greed:<br/><br/> \"We don't pay taxes. Only the little people pay taxes.\" <br/><br/>Intellectually, Morally and Economically Bankrupt: TRUMP 2016", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5187/8992/cropped-51878992.jpg?0.3028964879922569", "createDate": "1474455537", "commentID": 19868832, "userID": 51878992, "recommendations": 1462, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868832}, {"approveDate": "1474461330", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474457730", "permID": "19868027", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Nre York", "parentID": null, "userDisplayName": "Back to basics Rob", "commentTitle": "<br/>", "commentBody": "Another reason might be that his returns would show he does more than \"fight very hard over taxes\" but engages in outright tax fraud that is very difficult to evaluate because his returns are so voluminous and figuring them out takes more work hours than the IRS is reasonably willing to allocate to his return.  Recent reports provide substantial reason to believe he engages in self dealing with respect to his charitable foundation.   Making the return public turns all of America's tax experts and news organizations into \"IRS agents.\"  Besides, his philosophy is to do whatever he can get away with.  Why voluntarily give his detractors evidence to hang him with ?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474444122", "commentID": 19868027, "userID": 14843896, "recommendations": 510, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868027}, {"approveDate": "1474461341", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474457741", "permID": "19868028", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new york", "parentID": null, "userDisplayName": "bill b", "commentTitle": "<br/>", "commentBody": "There is no audit. Where is the IRS letter saying he is being<br/>audited? He will never release his tax returns. It also appears<br/>his Foundation is a pass through so he can use other people's<br/>money to pay his debts and obligations. That is if he doesn't<br/>stiff them like he did tot he tradesmen and small businesses<br/>he ruined by refusing to pay what he owed.<br/> Trump is a fraud. Period", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474444179", "commentID": 19868028, "userID": 33597851, "recommendations": 856, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868028}, {"approveDate": "1474461404", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474457804", "permID": "19868139", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "David Ballantyne", "commentTitle": "<br/>", "commentBody": "I'd like to see Trump's birth certificate. Not to prove he was born in the United States, but rather to prove he was born on earth. He doesn't seem human.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4135/7968/cropped-41357968.jpg?0.8411885091028145", "createDate": "1474447788", "commentID": 19868139, "userID": 41357968, "recommendations": 797, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868139}, {"approveDate": "1474461534", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474457934", "permID": "19868252", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Savannah", "parentID": null, "userDisplayName": "SMB", "commentTitle": "<br/>", "commentBody": "Finally!  Thank you for this editorial.  It goes to the heart of the lies at the heart of the Trump campaign and purported Trump success.  His is a story of exploitation, including of the American taxpayer as an earlier article from the New York Times investigated for all the tax breaks for his buildings, and the broken promises in how he honored his responsibilities for the tax rebates subsequently.<br/><br/>His Trump Foundation has conclusively been now shown to be a personal slush fund from which he paid his legal fees after violating the law, a bribe to the attorney general of Florida, and the fake promises to give to charity by funneling other people's charitable donations to third parties.<br/><br/>There should be some legal mechanism to force one of the top presidential nominees to reveal his taxes.  Yes, he demanded paperwork for years from President Obama -- for his birth certificate, for his college transcript, for his passport -- and then claimed that the birth certificate was a forgery.  Five years of this nonsense. <br/><br/>Where are the investigators into Trump's taxes?  Even here in this editorial, the \"errors\" in taking various tax breaks illegally are spelled out as are his lack of paying any taxes for years.  This cannot be legal.<br/><br/>This man is a pathological liar and a psychopath.  This is like watching the rise of Mussolini or Hitler in America, fervently supported by one of the major parties.  I now understand how Hitler was elected and how lynch mobs are formed.<br/><br/>Shame!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474450093", "commentID": 19868252, "userID": 9271683, "recommendations": 1016, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868252}, {"approveDate": "1474461583", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474457983", "permID": "19868129:19868273", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Savannah", "parentID": 19868129, "userDisplayName": "SMB", "commentTitle": "<br/>", "commentBody": "Changing the subject from Trump's taxes to racial profiling is not a good move here.  It highlights Trump's bigotry and hatred of others.  Ban all Muslims?  This is against the founding principles of this country against the persecution of those of various religions.<br/><br/>In what bizarre universe is a failed businessman who had a tendency to declare bankruptcy and walk away with millions considered anyone who could deal with foreign affairs and terrorists?  He was a draft dodger.  He has thousands of lawsuits.  He has shady ties.  He admires Putin.  He doesn't pay his taxes.  He \"knows\" more about ISIS than the generals do, but he has only a weak B.S. degree and zero government experience, military experience, legal experience or any of the normal qualifications for office in this country. Zero interest in public service.<br/><br/>How absolutely stupid and gullible some Republicans are.  One can only conclude that the bigotry and lies of Trump appeal to them more than sanity and facts.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474450356", "commentID": 19868273, "userID": 9271683, "recommendations": 775, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868273}, {"approveDate": "1474461752", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474458152", "permID": "19868387", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "andover, MA", "parentID": null, "userDisplayName": "marty", "commentTitle": "<br/>", "commentBody": "Hillary Clinton at Monday's debate:<br/><br/>\"Donald, you claim you're for the little guy, that you like uneducated people. Well, why have you been the party to 4,000 lawsuits during your career, some two-thirds of them when you are the plaintiff, the one who sues? Why do you stiff so many of the contractors you've hired, then sue them to recover what you claim to be damages? Why have you filed for bankruptcy four times costing thousands of jobs? Why is your line of clothing manufactured abroad when those jobs could be performed here in the US? <br/><br/>And why don't you release your tax returns. I know why...I've heard from good authority that you pay very little in taxes, cheating the very people in this country who you maintain you care about. You haven't made a charitable donation in many years because you don't have to....all those hard to understand real estate deductions come in plenty handy for you. The  \"common\" people you claim to care about pay more in taxes than you do. You're just afraid, that's right, afraid to release your taxes because you know that the curtain will be pulled back from your Wizard of Oz act and you'll be shown to be the fraud that you are. You're quick to pounce on others, but you don't have the courage to let the people see you for what you really are when its right there on paper. All the lawsuits, all the fraud, it's all on you.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474451786", "commentID": 19868387, "userID": 65373776, "recommendations": 799, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868387}, {"approveDate": "1474461799", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474458199", "permID": "19868403", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Little Silver NJ", "parentID": null, "userDisplayName": "Franc", "commentTitle": "<br/>", "commentBody": "It would be very interesting to see Trump's personal tax returns, the returns for his various businesses, and those of the Donald J Trump Foundation. Those documents would likely give insight to how Trump does business.<br/><br/>Equally interesting would be an explanation of the way Trump finances his businesses, his personal life style and his political campaign. Who are Trump's creditors? Who invests in his enterprises? <br/><br/>Vanity may be the cause of Trump's reluctance to disclose this information; it might suggest he is not nearly as rich and generous as he claims. But that information could reveal something more profound.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474451964", "commentID": 19868403, "userID": 59831007, "recommendations": 239, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868403}, {"approveDate": "1474462023", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474458423", "permID": "19868635", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Rubenstein", "commentTitle": "<br/>", "commentBody": "The complex web of investments, partnerships, and debts is not just relevant, it is essential. Trump is the first candidate in a lifetime to be immune to blind trust. His brand is too global and pervasive to be hidden from him---and from people who would want to leverage him. The Trump brand is a target, and his employees are targets, from day one. If his foreign policy is to be as draconian as he says, the American people should know what nations, banks, hedge funds, and individuals hold a sword of Damocles over his head. Who will secure his financial monuments to his own name? How many billions will it cost? How many decisions will it shape?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474453989", "commentID": 19868635, "userID": 5930352, "recommendations": 372, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868635}, {"approveDate": "1474462158", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474458558", "permID": "19868647", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Richmond, VA", "parentID": null, "userDisplayName": "joeleisen", "commentTitle": "<br/>", "commentBody": "He knows the outrage over not paying his fair share would end the election. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474454109", "commentID": 19868647, "userID": 41369864, "recommendations": 528, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868647}, {"approveDate": "1474465568", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474461968", "permID": "19869834", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": ".", "parentID": null, "userDisplayName": "Rebecca Rabinowitz", "commentTitle": "<br/>", "commentBody": "These are not \"stupid excuses\" - these are flat out refusal to provide transparency to the American public, and they demonstrate a man who is desperate to evade the truth about his ugly business chicanery; his lies about his ostensible \"charitable giving;\" his avoidance of payment of taxes; the likelihood that he is worth far less than his outlandish, ever shifting claims regarding his wealth; the fact that he is in debt to the probable tune of close to a billion dollars to Chinese, Russian and German banks; and so on.  The self-dealing within his phony \"Foundation\" should result in the immediate revocation of its tax exempt status, heavy fines, and more - if those of us in the nonprofit world engaged in that type of fraud, we would be prosecuted, fined, and likely imprisoned.  It is long past time to rip the mask off of this bombastic, ignorant, mendacious, petulant toddler and expose him for what is has always been: a lousy businessman who relies upon conning, threatening and cheating people, and suing them when they pursue him.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474460251", "commentID": 19869834, "userID": 17050169, "recommendations": 395, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19869834}, {"approveDate": "1474465706", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474462106", "permID": "19869724", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Ray", "commentTitle": "<br/>", "commentBody": "This article is exactly why Trump shouldn't release his tax records. It's ridiculous to believe that he's committed tax fraud, since he gets audited every year and that would have certainly been identified during those. That leaves the specious argument that \"he doesn't pay his fair share\". No one in America is obligated to pay more than they legally owe. You may not like it, but tax avoidance is something that all Americans engage in (can you say \"mortgage interest deduction\".) So called \"loopholes\" are actually legitimate tactics to encourage certain types of investments. <br/><br/>Further, one needs to look no further that Mitt Romney for an example of why releasing tax records is a terrible idea; he gave 20% of his income to charity, yet the focus was on how much he made and paid in taxes, instead of his incredible generosity. Critics of Trump will find something in his taxes that will be perceived negatively, no matter the bigger picture, and that will become the story.<br/><br/>Americans are entitled to privacy, even Donald Trump. Picking his tax records apart, looking for something that can be used against him, is most certainly going to happen. He'd be a fool to feed the media machine working against him. Unless he's broken the law, which is unlikely, he should continue his resistance to giving his critics ammunition to use against him. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474459854", "commentID": 19869724, "userID": 4039053, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19869724}, {"approveDate": "1474467169", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474463569", "permID": "19871338", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "iowa", "parentID": null, "userDisplayName": "mdalrymple4", "commentTitle": "<br/>", "commentBody": "Trump is such a hypocrite.  I think the smart thing to do, since he wont help with information, is to just assume he pays no taxes, gives nothing to charity (in fact takes money away from his foundation) and has serious debt with our enemies.  I dont understand why he cant release the last year of taxes that is not being audited at this time.  Any year would do for me.  My husband and I probably pay more in taxes than he does and we are both retired.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474464940", "commentID": 19871338, "userID": 38486245, "recommendations": 185, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19871338}, {"approveDate": "1474467678", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474464078", "permID": "19869640", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Patrick B", "commentTitle": "<br/>", "commentBody": "Trump's son hit the nail on the head - \"people would ask too many questions\".<br/><br/>Trump has exaggerated so much in this campaign it is unlikely that his return is any different.<br/><br/>The problem here is that tax \"exaggerations\" are subject to prosecution. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6936/2318/cropped-69362318.jpg?0.21758452081121504", "createDate": "1474459504", "commentID": 19869640, "userID": 69362318, "recommendations": 226, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19869640}, {"approveDate": "1474468143", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474464543", "permID": "19869495", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island", "parentID": null, "userDisplayName": "Todd Decker", "commentTitle": "<br/>", "commentBody": "I for one of many many millions of intelligent voters have fully assumed that  ALL of the suspicions regarding Trump's hidden tax return raised in this editorial are true. Until I can see proof of anything different, I will continue to believe that Mr. Trump is actually flailing and failing as a businessman, that he's extremely stingy with his charity, he has managed to pay no income taxes, and he has many ties to suspicious characters both inside and outside the U.S.<br/><br/>Where there is smoke, there is fire. Donald Trump is a charlatan, plain and simple. If he paid me a dollar for every time he has said \"believe me\" I might actually be richer than him! He is not simply failing to disclose his tax returns, he is HIDING them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474458913", "commentID": 19869495, "userID": 634163, "recommendations": 332, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19869495}, {"approveDate": "1474468728", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474465128", "permID": "19868712", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Flushing, NY", "parentID": null, "userDisplayName": "Dr. G", "commentTitle": "<br/>", "commentBody": "Why all this furor about Trump's tax returns? Are people anxious to learn if the IRS has missed something? Do people want to find legal methods that they themselves might use? To me, this furor shows a great mistrust for the auditors at the IRS. Don't you think that the IRS is competent to handle Trump's returns and make him pay according to the tax code? Remember there is no law that requires a candidate to make a revelation of tax returns. Do you fear that the IRS is letting Trump get away with something?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474454674", "commentID": 19868712, "userID": 29728537, "recommendations": 7, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19868712}, {"approveDate": "1474469362", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474465762", "permID": "19869566", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "bangor, maine", "parentID": null, "userDisplayName": "sophia", "commentTitle": "<br/>", "commentBody": "Of course he must release his taxes or be seen as the fraud he is.  Of course, if he releases them, he'll be seen as the fraud he is!  Poor Donald.  In such a bind.<br/><br/>I predict:  he won't and it will not make a whit of difference to his fan base.  But will it make a difference in the few independents' minds and will it be enough to cause him to lose the election?  I pray it does.<br/><br/>This man is a flim flam artist, a con.  But that's been known for some time now and those who want him don't care.  But the press must continue to hammer him on it and I appreciate the Times doing so today.  He must get pressure put on him by many and constantly.<br/><br/>If America elects a man who is in the pockets of Putin and his band of merry Oligarchs....well, what can one say?  What does it mean?  It means American democracy may not survive.  Heck, the world may not survive the way he speaks so fondly of nuclear bombs.<br/><br/>People, please wake up!  He is not a good person, he does not have your best interests at heart, he's a loose cannon and can cause untold damage to millions.  You don't like HIllary's voice?  She sounds like your old middle school teacher?  Yeah, well I don't think she'll blow up the world and there's a good chance he will.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474459225", "commentID": 19869566, "userID": 61190755, "recommendations": 259, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19869566}, {"approveDate": "1474471467", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474467867", "permID": "19872841", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florida", "parentID": null, "userDisplayName": "JayEll", "commentTitle": "<br/>", "commentBody": "Carl Bernstein, the investigative reporter of Watergate fame, rightly stated that every night the press should do intense background stories on Trump.   Follow the money, not the intentional bullying comments.  These foundation payments and tax deductions smell of another Watergate.<br/>The Times should also focus on Trump's bookkeepers and accountants. His campaign constantly blames accounting mistakes. Is that the equivalent of \"stolen\" goods that  fell off the back of a truck?    If his financial handlers are this inept, what does that say of Trump handling the nation's finances.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474469464", "commentID": 19872841, "userID": 68175258, "recommendations": 223, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19872841}, {"approveDate": "1474471527", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474467927", "permID": "19869724:19873328", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Ray", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": 19869724, "userDisplayName": "Matt", "commentTitle": "<br/>", "commentBody": "Maybe if Trump didn't constantly build himself up as a business genius with a heart of gold, he wouldn't need to live up to such overblown expectations.  In any case, it is for voters to decide whether they like his chosen tax strategy, regardless of legality.  While Trump is entitled to privacy he runs into the same problem Clinton has when SHE doesn't want to disclose something... people don't have to vote his way either.  <br/><br/>I don't know how many times it needs to be explained that an election is not a criminal trial and the candidates have no grounds to refuse to reveal information while simultaneously seeking votes.  These candidates can't reasonably ask for power superior to any other citizen and then whine about how they want common levels of privacy.  No one is trying to install cameras in their home or steal their identity.  Neither is this simple curiosity.  We are trying to determine whether we like the ways in which they conduct themselves financially, politically and (most important for me) ethically.  If that's too much to ask, they should both get lost.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7003/2074/cropped-70032074.jpg?9562787161951187111", "createDate": "1474470993", "commentID": 19873328, "userID": 70032074, "recommendations": 82, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19873328}, {"approveDate": "1474471761", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474468161", "permID": "19872415", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Raleigh, NC", "parentID": null, "userDisplayName": "MarkZ", "commentTitle": "<br/>", "commentBody": "Constant complaints about Hillary's transparency when Trump:<br/><br/>1) hasn't released his taxes<br/>2) hasn't released medical records<br/>3) releases no information on his foundation<br/>4) doesn't disclose his overseas investments<br/>5) doesn't travel with the press<br/>6) doesn't give press interviews except to Fox<br/><br/>And Hillary... well she tried to delete old emails (but failed).", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474468170", "commentID": 19872415, "userID": 62254585, "recommendations": 180, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19872415}, {"approveDate": "1474472214", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474468614", "permID": "19873640", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland, OH", "parentID": null, "userDisplayName": "Charles Michener", "commentTitle": "<br/>", "commentBody": "If he is illegally self-dealing - using charitable donations to his foundation to pay off private debts and buy personal items (self-portraits!) - then why is there no official investigation or indictment? He's got former federal prosecutor Rudy Giuliani in his fold. Has he paid off currently serving prosecutors, too? And given that Trump has already said he's being audited, thereby lifting any shield of confidentiality, can't the IRS confirm whether this is true, and if so, tell us when the audit will be completed?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474471899", "commentID": 19873640, "userID": 26369835, "recommendations": 64, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19873640}, {"approveDate": "1474472470", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474468870", "permID": "19871426", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Malone, NY", "parentID": null, "userDisplayName": "Rea Tarr", "commentTitle": "<br/>", "commentBody": "Every week up here in the North Country, there are announcements in the paper -- and notices stuck to bulletin boards all over the place -- advertising rooms for rent, labor and services for \"cash only.\"  Cash only, please.  Up here, we've got Trump supporters by the pick-up loads.  Oodles of folks mostly doing business by \"cash only.\"  <br/><br/>Taxes?  These people are sure Trump doesn't pay 'em -- and that's good.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474465174", "commentID": 19871426, "userID": 42543762, "recommendations": 45, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19871426}, {"approveDate": "1474472744", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474469144", "permID": "19873832", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Philadelphia", "parentID": null, "userDisplayName": "wood2u", "commentTitle": "<br/>", "commentBody": "Mr. Trump's refusal to release his tax returns is one more example of his usual game plan.  His supporters don't care about his returns, but they snicker with glee that he won't release them:  keep the controversy going, dominate the news cycle, thumb the nose at the media and the politically correct, and so on. At some point, with great publicity, he will release a limited amount of information—or heavily doctored or changed returns—and say, \"Look at how up-front and honest I am. It's tremendous how honest I am.” Then he will find a thousand reasons why whatever he has released shows him to be smart and strong—a Putin of business.<br/><br/>Mr. Trump and his supporters have accused Mrs. Clinton of arrogance. She may be arrogant—do the humble run for President?—but Mr. Trump's  campaign is based on an overarching sense of national, racial, and most especially, personal superiority. Consider the arrogance displayed when Trump claimed that he could murder a randomly selected person—perhaps a child—on 5th Avenue, and not lose any supporters. Imagine the arrogance of someone who lies to the media, to people who know he is lying. He is not stupid. He is demonstrating his contempt and his power. Who dares to contradict the Emperor?<br/><br/>Mr. Trump and his surrogates give many reasons for withholding his returns. No matter the excuse, all show Trump's arrogant belief that the American people are not worthy of seeing his tax returns, and that he will release or withhold them at his pleasure. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474472494", "commentID": 19873832, "userID": 26095778, "recommendations": 122, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19873832}, {"approveDate": "1474472860", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474469260", "permID": "19870919", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Embudo, NM", "parentID": null, "userDisplayName": "bob lesch", "commentTitle": "<br/>", "commentBody": "since trump readily admits he gets audited every year, what's his excuse for not releasing tax years 1985-2014?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474463630", "commentID": 19870919, "userID": 53768026, "recommendations": 116, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19870919}, {"approveDate": "1474472931", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474469331", "permID": "19872642", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Northeast", "parentID": null, "userDisplayName": "micclay", "commentTitle": "<br/>", "commentBody": "He supposedly will not even release a copy of the IRS notice of the audit?  Who knows if it is even true that he is under audit?  He has proved repeatedly that he is a serial liar.   And even if he does release them they will probably be a one page summary of the data, which is useless like his medical report.  If he releases actual forms, who would believe they were the actual returns as filed?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474468879", "commentID": 19872642, "userID": 43751520, "recommendations": 104, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19872642}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 730, "api_timestamp": "1488822361", "totalReplyCommentsFound": 254, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}