{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 689, "totalEditorsSelectionFound": 24, "depthLimit": 0, "totalRecommendationsFound": 776, "comments": [{"approveDate": "1458030366", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458026766", "permID": "17890220", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Calgary, AB", "parentID": null, "userDisplayName": "Randy Harris", "commentTitle": "<br/>", "commentBody": "Mr. Trump has a tendency to take no responsibility for his words or actions. Despite there being numerous audio and video recordings of his behaviour at his campaign stops, he denies what he has previously said publicly or he acts confused. Mr. Trump has stated that he can act more presidential (I gather sometime in the future) although he apparently sees no need to demonstrate this now.  I think that we can assume that what we see now is what we will see should Mr. Trump ever become President. Supporting Mr. Trump is the quickest way to America losing credibility and influence on the world stage. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458000022", "commentID": 17890220, "userID": 73929849, "recommendations": 182, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17890220}, {"approveDate": "1458030659", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458027059", "permID": "17890358", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los angeles", "parentID": null, "userDisplayName": "casual observer", "commentTitle": "<br/>", "commentBody": "Trump obviously has no concern for the welfare of people attending his rallies. The disruptive demonstrators are trying to deny Trump his right to express himself and his resentment of them is normal, but a man who claims to be able to be President just has to have more patience than he has shown. So far his silly talk shows his thin skin and failure to consider the consequences of talking like that. People are giving him a lot of attention but he's showing that he does not have the temperament to be an effective political leader.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458001467", "commentID": 17890358, "userID": 21896305, "recommendations": 90, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17890358}, {"approveDate": "1458034057", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458030457", "permID": "17890535", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island, NY", "parentID": null, "userDisplayName": "RK", "commentTitle": "<br/>", "commentBody": "“I’ve lived in New York City and Manhattan all my life, okay? So my views are a little bit different than if I lived in Iowa.”  So said Trump in 1999.<br/><br/>I've lived in New York since 1974.  So I know what Trump was talking about.  What Trump is doing now at his rallies and elsewhere is not quite in line with the views he cited back in 1999.   The shtick that he is pulling in the rest of the country won't work for one second in New York or other major metropolitan areas, as he found out by the reaction to his rally in Chicago (which he had to cancel).  <br/><br/>Trump has become a cynical and opportunistic politician who'd say anything or do anything to get elected.  Mr. Trump is playing with fire and ultimately there will be a cost.  <br/><br/>For his sake and for the sake of the country, I hope Trump stops the madness before he does real damage.  The GOP may deserve Trump but the country doesn't.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2518/337/cropped-2518337.jpg?0.8918839421902254", "createDate": "1458003154", "commentID": 17890535, "userID": 2518337, "recommendations": 259, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17890535}, {"approveDate": "1458034116", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458030516", "permID": "17890561", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "ny", "parentID": null, "userDisplayName": "rxft", "commentTitle": "<br/>", "commentBody": "Donald Trump keeps denying that he's inciting violence despite videotaped evidence to the contrary. How does one deal with someone who looks straight at you and says he didn't say what he did. This is not an individual who will change his behavior or accept responsibility for his words and his actions. The atmosphere surrounding his rallies has reached a dangerous boiling point and since he won't bring it down a notch it is time that the protesters use Gandhi's tactics of protest. Peaceful, non-violent resistance. You should not try to out-scream his supporters or push or shove your way in. The image of thousands of people peacefully holding up signs outside his rallies will speak louder when contrasted with the rage and hatred being spewed by Trump and his supporters. If the rhetoric is not toned down there is a real fear that someone will get seriously hurt. Trump will continue to goad, it's up to the rest of us to show him that we are not playing his game on his terms.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458003407", "commentID": 17890561, "userID": 42012694, "recommendations": 284, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17890561}, {"approveDate": "1458046075", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458054053", "permID": "17891351", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "St Paul, MN", "parentID": null, "userDisplayName": "BearBoy", "commentTitle": "<br/>", "commentBody": "America is not a hateful nation and the only thing Trump has “stirred up” is a new belief that we can take our country back from a corrupt, intrusive and suffocating government and return it to everyman Americans.  His success in identifying the resonant national critical issues and offering common sense solutions has sparked the political revolution we are all witnessing by engaging the great silent majority in a way that no American political leader has done in the last 100 years.<br/><br/>Fearful of his success and possible ascendance to the Oval Office, a desperate liberal establishment has sent their anti-free speech goons to stir up trouble and incite the violence being reported here.  Please note that there are no Trumpists invading Hillary or Bernie rallies; they have too much respect for the process, and know that such strong arm tactics always backfire on the aggressor.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458011277", "commentID": 17891351, "userID": 65599311, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891351}, {"approveDate": "1458046400", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458042912", "permID": "17891468", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Metro Detroit", "parentID": null, "userDisplayName": "Patricia Lay-Dorsey", "commentTitle": "n/a", "commentBody": "I thought there were laws in the United States that protected us from hate speech. When I see videos of Donald Trump inciting the crowd to hit and punch the people he calls \"protesters\" I have to wonder why he is legally allowed to speak in this way. I understand that many of the people who support Trump for president also seem to support his right to say anything he wants in his rallies.<br/><br/>As a trained social worker, this does not surprise me. We all know about the power of mob violence. But what about the law of the land? It almost seems as though the laws against hate speech and inciting violence do not apply to Donald Trump. Do we have to wait for someone to be critically injured or even killed before this man is stopped? <br/><br/>So many of us have been worried about the danger that would come to our country and the world if Donald Trump were to become president. Now we see that he is a danger before he even becomes the Republican nominee.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458012363", "commentID": 17891468, "userID": 70276100, "recommendations": 158, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891468}, {"approveDate": "1458046542", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458042942", "permID": "17891503", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Norwich, CT", "parentID": null, "userDisplayName": "John-Manuel Andriote", "commentTitle": "<br/>", "commentBody": "Trump is a typically coddled upper class white man, baiting others with fear and anger, happy (like most Republican hawks who didn't serve in the military themselves--cf. Dick Cheney) to send others to commit the violence while he cowers in the corner until the coast is clear and he can spout off once again. What is so shocking to me is that someone can have so much money and so little class. That he flaunts his classlessness so flagrantly, is adored by those with far less money and probably even less intelligence, and gets away with it, speaks volumes about America's coarsened public life and popular culture. He really is the Republican Party's Frankenstein monster--and he is doing to the party what the original monster did to the not-so-good Dr. F. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7258/3884/cropped-72583884.jpg?0.5052966971416026", "createDate": "1458012723", "commentID": 17891503, "userID": 72583884, "recommendations": 141, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891503}, {"approveDate": "1458046653", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458054886", "permID": "17891552", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tecumseh, Michigan", "parentID": null, "userDisplayName": "Charles", "commentTitle": "<br/>", "commentBody": "I am inalterably opposed to Mr. Trump's candidacy, but I have come to understand why his dishonest campaign is resonating with so many Americans, and it is rooted in the dishonesty of the “establishment,” with the NY Times and other acolytes of President Obama as the primary culprits.  Given the choice between Trump’s lies and the lies of the “establishment,” people are choosing Trump.  The “establishment” wants us to believe that happy days are here again, and that is the most important lie that people are rejecting.  Is the unemployment rate 40 percent?  Of course, not, but it is at least as big of a lie to say that only five percent of the people can’t find full-time, meaningful work.  And which lie appeals more to people’s genuine concerns?  It is pernicious lie to imply, as Trump does, that all Muslims are bad, but it is a foolish lie to suggest that Islam has nothing to do with the threat of terrorism facing America and the world.  Which lie does a better job of addressing Americans’ genuine concerns?  Trump exaggerates the problems with Obamacare, but the “establishment” tries to ignore the real costs of Obamacare to millions of Americans and exaggerate its benefits.  For example, my family’s health insurance deductible has more than doubled in two years, and yet, we still have 29 million people without insurance.  In short, Trump will probably be our next president, because his lies speak to the reality facing most Americans better than Obama’s lies do.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458013189", "commentID": 17891552, "userID": 71299546, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891552}, {"approveDate": "1458046805", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458043205", "permID": "17891607", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "SlackyJr", "commentTitle": "<br/>", "commentBody": "Trump is a lying, bullying, tough guy and people love him.  Why?  Because all the \"closet\" racists in this country now have a leader that is saying all the things that these crazies think, but have not been allowed to say because it was not politically correct.  Trump admits to not being PC, and this is what you get.  A foul mouthed hater that is dividing this country.<br/><br/>I don't understand how his supporters can stomach his lies and limited knowledge of world politics and US policy.  He constantly repeats himself on the 4 or 5 general talking points that he stands for, but he has no plans that go deeper than his thick skin.  <br/><br/>Wake up America!  This isn't a reality show.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458013700", "commentID": 17891607, "userID": 2696041, "recommendations": 190, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891607}, {"approveDate": "1458048739", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458045139", "permID": "17891842", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Sy", "commentTitle": "<br/>", "commentBody": "Trump through his skinhead-packed political rallies, has now defaced democracy itself, and given it the image of something far more sinister-Nuremberg 1936-all that is missing is the flaming torches and Leni Riefenstahl directing the camera angles. <br/><br/>As the loathsome &amp; odious individual he is, he rants against the protestors who often quietly register their aversion to him and his ideology of hate by doing nothing more than rightly calling him un_american or simply wearing a hijab (as one Muslim woman recently did), Yet Trump and his fascist ilk cannot even tolerate that-I guess that their version of free speech does not allow it-only they are entitled to exercise their first amendment rights-heaven forbid anyone else should. <br/><br/>Trump's ability to whip his minions into an orgy of hate is on full display for the entire world to see and he illustrates what this country has become in a very ugly way. To me, the ultimate irony is that there was once a time, when the \"Greatest Generation\" fought to cleanse the world of a great evil (Nazism), and countless Americans died in an international struggle to purge humanity of Fascism-the very movement that Trump and the Republican party have foisted upon the American people. Unfortunately, my generation does not have an FDR", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458016233", "commentID": 17891842, "userID": 69412909, "recommendations": 122, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17891842}, {"approveDate": "1458053759", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458050159", "permID": "17892968", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mexico", "parentID": null, "userDisplayName": "John Townsend", "commentTitle": "<br/>", "commentBody": "At his rally in Fayetteville, North Carolina, Trump urged the crowd to confront protesters \"Knock the crap out of them -- I promise you, I will pay for the legal fees. I promise, I promise\". So John McGraw did just that ... he punched a black protester in the face as he was being escorted out with a group of protesters by a half-dozen police officers. McGraw was eventually arrested and charged with assault, disorderly conduct and making threats. His bond was set at $2,500 secured, and a court date set for April 6. Is Trump paying the legal fees as promised or  is this yet another Trump lie?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6974/5052/cropped-69745052.jpg?4287809851024206165", "createDate": "1458038757", "commentID": 17892968, "userID": 69745052, "recommendations": 33, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17892968}, {"approveDate": "1458054735", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458051135", "permID": "17893159", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hudson Valley NY", "parentID": null, "userDisplayName": "Billy from Brooklyn", "commentTitle": "<br/>", "commentBody": "Is everyone intentionally disregarding the fact that the protestors, intentionally attending and trying to prevent freedom of speech, are the direct cause of any violence. The article offers two protestors at a Trump rally stating that they felt they \"had to do something\" as almost heroic.<br/><br/>Yes, most of us to not support Trump or his views on society or foreign policy. But most of us also defend his right to hold a political rally without demonstrators trying to silence a candidate. <br/><br/>Why isn't the NYT or its readers more concerned with first amendment rights? If this was the tea party trying to disrupt a Democratic party political rally, you know darn well that the issue wouldn't be the reaction of the rally attendees. Shame on you that turn a blind eye to the first amendment protections when it is a candidate you do not support who is being denied his rights.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5620/0156/cropped-56200156.jpg?0.2726317303652788", "createDate": "1458040488", "commentID": 17893159, "userID": 56200156, "recommendations": 40, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17893159}, {"approveDate": "1458054849", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458051249", "permID": "17893180", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Upstate", "parentID": null, "userDisplayName": "Kenn", "commentTitle": "<br/>", "commentBody": "Trump doesn't have \"supporters,\" he has \"followers.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458040647", "commentID": 17893180, "userID": 70502732, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17893180}, {"approveDate": "1458054994", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458051394", "permID": "17893235", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "JABarry", "commentTitle": "<br/>", "commentBody": "Trump did not turn peaceful crowds attending his rallies into violent mobs.  The Republican Party and its media outlets, FOX and hate-radio have for decades stirred up fear, hatred and rage in its listening audience.  Trump takes the stage and unleashes the rage that has been cultivated by the Republican Party.  I wonder, when will Trump be charged for inciting violence?  Will it take a riot with blood on the floor?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458041083", "commentID": 17893235, "userID": 55063995, "recommendations": 54, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17893235}, {"approveDate": "1458055896", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458052296", "permID": "17893552", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston. MA", "parentID": null, "userDisplayName": "Bounarotti", "commentTitle": "<br/>", "commentBody": "The same country that elected Barack Obama 7 years ago will not elect Donald Trump.   That would be implausible schizophrenic even for America.  And when that happens the hard right who support him will again insist that the country is being stolen from them.   Their response will be to double down and go looking for someone even more \"forceful\" than Trump.  With Trump they've gotten a sense of power that will not readily dissipate.  They will not go quietly into the dark night of political irrelevance.  They see themselves as warriors in a cause.  And warriors fight on.<br/><br/>Trump is not the end of this.  Trump is the beginning.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458043560", "commentID": 17893552, "userID": 61017128, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17893552}, {"approveDate": "1458056535", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458052935", "permID": "17893697", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Miami Gardens, Fl", "parentID": null, "userDisplayName": "GregAbdul", "commentTitle": "<br/>", "commentBody": "This is not about Trump. It's about the First Amendment. The KKK has a right to speak and to freely associate. Trump and his people have the same right. Now think MLK. They disrupted the racist associations of their time, but they made it a point never to get into street fights. Should people who hate Muslims have the right to interrupt Muslim prayer services? Should people be allowed to protest inside synagogues? There are only two possible proper ways to protest a gathering you don't like. If it's public and they let everyone in, you can go in with your message shirt and then leave when you are requested to do so, without resistance. The norm in my community is you have to maintain a buffer zone between the protesters and the event. The present mainstream liberal response to Trump is un-American. Trump is serving an important purpose in our democracy. He is giving voice to a large segment of the population. Instead of the left deciding what our reaction should be in terms of solving this white anxiety and anger, a huge media voice has risen, in order to patronize young people, telling Trump and his followers they are not protected by the US Constitution. This is our real modern problem. We all know what the Framers left us. The Senate has decided to suspend its sworn Constitutional duties because the GOP hates Obama. The New York Times has decided to stand against free speech because you don't like Donald Trump. Both of you are violating our founding principles. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5757/9057/cropped-57579057.jpg?0.15035160724073648", "createDate": "1458044384", "commentID": 17893697, "userID": 57579057, "recommendations": 34, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17893697}, {"approveDate": "1458057935", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458054335", "permID": "17894518", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "tx", "parentID": null, "userDisplayName": "rdonal", "commentTitle": "<br/>", "commentBody": "After reading the article in today's NYT piece about Mr. Trump's butler, I am convinced that we are now seeing the culmination of a lifetime of corporate abuse. I'm not talking about finances, I am referring to the psychological effects that money has on those that are fortunate (or in the end, unfortunate) enough to have more than can be imagined. Mr. Senecal speaks of the many ways that he panders to Mr. Trump and has for 30 years. He speaks of the lies that Mr. Trump sows on a daily basis and how he has learned to simply \"play along.\"  The crass nature of Trump isn't new....his narcissistic mental dysfunction is borne of a lifetime of coddling, money paving the way for softening lies and illegal criminal activities. Trump has never had to be truthful nor accountable. By surrounding himself with people that will literally bow to him as he passes, he is accustomed to being treated like royalty even tho his idea of royalty is equivalent to being an almighty dictator.<br/><br/>Trump is rollicking in this mess he has created. His slogan is no longer applicable. He is definitely not making America Great Again. He is defaming her, minimizing her and shaming her all in the name of his grand game of phony intelligence and persuasive charm. (it hurts to use that word in regard to a man so revolting)<br/><br/>Hail to Cesar only works in a casino where the players are duped by the House. Trump's out-sized mental incompetence is only matched by his sick, pathological need to feed the monster.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458048429", "commentID": 17894518, "userID": 50651774, "recommendations": 71, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17894518}, {"approveDate": "1458058507", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458054907", "permID": "17894432", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Albany", "parentID": null, "userDisplayName": "Lee Harrison", "commentTitle": "<br/>", "commentBody": "Trump is starting to be like a KKK rally, and we are starting to hear the same arguments: that the KKK has a right to free speech, a right to peaceable assembly, a right to the free speech for unpopular views.<br/><br/>It's a thin line as to where the protection for hate-speech stops.  Trump's people don't seem to be coming to hear any sort of \"political views\" in any ordinary meaning  -- it's increasingly looking like the attraction is intimidation and violence.  Surrogates like Ann Coulter are stoking it with calls for more.<br/><br/>Trump is becoming a white-power goon candidate, peddling a neo-fascist personality-cult.  It is scary that this is attracting the degree of support that it is, and hardly surprising that major opposition is rising too.<br/><br/>Those who are \"for\" Trump must think about what is it that you are for?    There doesn't appear to be much \"for\" here ... only \"against\" and \"burn it down\" and \"I want to hurt somebody.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458047985", "commentID": 17894432, "userID": 1258177, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17894432}, {"approveDate": "1458059225", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458055625", "permID": "17894873", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Raghavan Parthasarthy", "commentTitle": "<br/>", "commentBody": "Supporters of Trump make a spurious argument: \"They do not go to other candidates' rally and disrupt\".  The reason that is not happening is because other candidates are not insulting and disparaging any ethnic group, nor are they a threat to any of them.  Trump is viciously attacking several minority groups and he poses a grave danger to their safety and survival. As such, neither he nor his supporters can complain about the violent disruptions occurring in their rallies.  They asked for it.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458049957", "commentID": 17894873, "userID": 27520704, "recommendations": 33, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17894873}, {"approveDate": "1458059501", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458055901", "permID": "17895160", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "<br/>", "parentID": null, "userDisplayName": "MS", "commentTitle": "<br/>", "commentBody": "I understand the appeal of Trump. I wish I didn't, but I do. Family members who support him are good people who have watched the cost of living rise while their wages for service &amp; industry jobs have not. They seem to watch a lot of TV (CNN, Fox) &amp; fear that if immigrants don't take their jobs, terrorists will get to them first. They have American-made cars, flat screen TVs, &amp; fenced-in yards for dogs that are there to protect private property. Their children are christened  &amp; they go to mass on holidays.  Life is a lot about having, not having, &amp; wanting to have - to have what our forebears came to this country for: a solid, stable, middle class life. For some of my family members, a number of whom opted out of higher education, that dream has passed them by. They are white, working class, middle-aged, &amp; resentful. Donald Trump is a kind of political Dr. Phil. He gives them the opportunity to vent deep disappointment, frustration, &amp; resentment. His candidacy is a collective catharsis. His rallies are not about policy; they're about being heard: The supporters I know simply don't feel heard, not by me, not by our leaders. And unfortunately they don't engage in civil discourse or civic life because the work of life - houses, jobs, kids, health - is enormously weighty. I loathe Mr. Trump &amp; I am terrified of his candidacy. But he has helped me to see that a \"silent\" if not \"majority\" at least portion of his supporters are ordinary working people who feel left behind.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458051109", "commentID": 17895160, "userID": 64151924, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17895160}, {"approveDate": "1458059682", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458056082", "permID": "17896289", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Plainsboro, NJ", "parentID": null, "userDisplayName": "Physicist", "commentTitle": "<br/>", "commentBody": "It is remarkable how the Times has things upside down.  Topics such as immigration policy should be open topics in the political process even though they are unacceptable in politically correct discourse.  All countries have laws that include deportation of those who enter illegally.  Broad-brush charges of hate, racism and xenophobia toward those who feel such laws should be enforced to protect American workers serve only to block legitimate discussion and encourage hate and even violence.  It is concerning for free discussion required in a democracy that Bernie Sanders has not denounced his supporters who have attempted to block the expression ideas at Trump rallies.  The language used by Trump can be offensive, but the language used by the TImes that encourages violence and violations of fee speech.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458056051", "commentID": 17896289, "userID": 17326374, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17896289}, {"approveDate": "1458059977", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458056377", "permID": "17895968", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Medford, OR", "parentID": null, "userDisplayName": "petersage", "commentTitle": "<br/>", "commentBody": "I was AT the event in Boca.  It was peaceful.  It was over-policed, if anything.  I am not a Trump fan, but this editorial only got to a real, verifiable fact 3/4 of the way through it when it said: \"Sunday's rally was peaceful.\"   It was a space rented for the night and telling protesters with anti-Trump signs was probably good pro-active crowd control.   Trump and the media wished there was violence because it would have justified the 24-7 Breaking News!! treatment by the media and would have driven a bigger audience to Trump.   Instead it was just same old Trump rant abut America for Americans and win, win, win, win.    Attack Trump for being wrong, which he is.   But the editorial has the story 100% backward: the Trump rally was peaceful because it was made peaceful.<br/>Peter Sage, a political tourist and observer<br/><a href=\"http://www.peterwsage.blogspot.com\" title=\"www.peterwsage.blogspot.com\" target=\"_blank\">www.peterwsage.blogspot.com</a>", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458054652", "commentID": 17895968, "userID": 34750423, "recommendations": 13, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17895968}, {"approveDate": "1458059997", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458056397", "permID": "17895970", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westfield, NJ", "parentID": null, "userDisplayName": "Abbott Hall", "commentTitle": "<br/>", "commentBody": "The recent violence reminds me of 1968, only 1968 was a lot more violent. Before the anti-war protest marches in 1968, the organizers, frequently SDS members, would instruct us protesters to incite the police and even better if a TV camera was nearby, The same tactics are now being used at the DT rallies. Yes, DT should not advocate violence against the protesters but the protesters should also not disrupt the rallies. If you are looking for a fight you will most likely find one, especially in this political climate. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458054656", "commentID": 17895970, "userID": 63841340, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17895970}, {"approveDate": "1458060024", "commentType": "comment", "userTitle": "NULL", "updateDate": "1458056424", "permID": "17895982", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "please", "parentID": null, "userDisplayName": "oh", "commentTitle": "<br/>", "commentBody": "I don't blame Trump for flinching when a protestor rushed the stage behind him. Trump (in his lingo) \"knows better than anyone, believe me\", how easy it is for unstable people to get guns and create mayhem.<br/><br/>Also the media tends to create alarmist headlines and narratives, to pump readership and ratings, and the coverage of Trump illustrates the point.<br/><br/>Lastly, protest and violence at rallies is nothing new. I remember President Reagan came to Hackensack, NJ to campaign in 1984. He arrived on-time, but the press bus was delayed 45 minutes, so the crowd was obliged to wait for the press to show up. <br/><br/>The introductory speaker prepping the crowd starting talking, but forgot his talking points and got tangled up in his words. He then said in frustration, \"the things that were supposed to go up, went up, and the things that were supposed to go down, went down\". And the crowd roared its approval.<br/><br/>I saw a middle aged lady well back from the stage in the middle of the large crowd. She was carrying a Mondale sign. At some point in the speech I heard paper tearing &amp; sounds of a scuffle. I looked over and her sign had been torn down, and a group of tall plainclothes rough men surrounded her, but all facing the stage. She looked scared. She had been vocal in her protest, but was now cowed into silence.<br/><br/>Trump is no worse than Ronald Reagan, and far more perceptive, rational and engaged then Reagan ever was. We survived Reagan, we can survive Trump too. But why put ourselves through it?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1458054688", "commentID": 17895982, "userID": 22123518, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17895982}], "totalEditorsSelectionReturned": 24, "replyLimit": 3, "totalRecommendationsReturned": 24, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1141, "api_timestamp": "1488822337", "totalReplyCommentsFound": 452, "totalCommentsReturned": 24, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}