{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 14, "totalParentCommentsFound": 240, "totalEditorsSelectionFound": 16, "depthLimit": 0, "totalRecommendationsFound": 237, "comments": [{"approveDate": "1479722406", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741813", "permID": "20556953", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mesa, Az", "parentID": null, "userDisplayName": "Tim Kane", "commentTitle": "<br/>", "commentBody": "The median wage has not gone up since 1972.<br/><br/>That is the price the average American has paid for the trade deals made by the Washington, Business &amp; CEO elites.<br/><br/>Oxford Econ Historian Robert Allen says in \"Economic History a very short introduction\" (HIGHLY RECOMMENDED) that the hollowing out of the American rust belt was directly a result and proportional to U.S, trade policy knowingly allowing Japan to ship steel and cars to the U.S. upon the Japanese state directing over investment into modern facilities. <br/><br/>American elites just turned their back on Americans working in these sectors while Japanese &amp; Korean elites were working hard to help out their fellow countrymen working in those same sectors.<br/><br/>American trade policy has directly, proportionately, purposely shipped jobs &amp; money to facilitate &amp; finance a renaissance in East Asia courtesy of the American worker who has no friends in Washington DC. <br/><br/>Meanwhile the GNP of the country has gone up 150% since 1972, so while wages remain flat, the 1% has captured all those gains.<br/><br/>Why should any working class American care about the geopolitics of East Asia &amp; China's back yard. Worried about Chinese growth in power? Then don't give them access to American markets at the expense of American workers. <br/><br/>Trade was the ax that beheaded American labor.<br/><br/>If tariff's were imposed on China, &amp; China then bombed South Korea and Japan into rubble, the American rust belt would sparkle again.<br/><br/>Fix middle America 1st. Only then talk about TPP.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2045/4347/cropped-20454347.jpg?0.07305489543627053", "createDate": "1479722363", "commentID": 20556953, "userID": 20454347, "recommendations": 180, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20556953}, {"approveDate": "1479723793", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741718", "permID": "20556902", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Deep Red South", "parentID": null, "userDisplayName": "David Gregory", "commentTitle": "<br/>", "commentBody": "Do we need good trade deals with other nations? Yes.<br/><br/>Is the Trans-Pacific Partnership a good trade deal? No<br/><br/>Then the answer to the TPP is to kill the bill and start all over.  <br/><br/>This time do it in public, with the oversight and participation by labor, human rights, consumer and environmental groups - not just lobbyists for big corporations and trade associations. Then have hearings and a good extended public discussion with amendments, followed by the proper approval process. <br/><br/>Real democracies do not slip secret trade pacts through Congress without proper oversight. Shame on you for supporting this horrible bill. Before ink is put to paper a better method for investor state dispute resolution has to be created. The current system is rife with conflict of interest and violates the sovereignty of governments - making them subject to corporate interests that already have too much influence and political power.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3000/6326/cropped-30006326.jpg?711136243625463747", "createDate": "1479720488", "commentID": 20556902, "userID": 30006326, "recommendations": 310, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20556902}, {"approveDate": "1479723799", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741699", "permID": "20556936", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Phoenix", "parentID": null, "userDisplayName": "Michjas", "commentTitle": "<br/>", "commentBody": "Trump has made a big deal about not kowtowing to the Chinese.  The TPP is a trade agreement with many of China's neighbors that excludes China.  China is our greatest economic rival and the TPP is a victory for influence over China.  Clinton and Trump both opposed it.  Obama wants it signed.  I'm with Obama.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4814/7869/cropped-48147869.jpg?1475980521793890914", "createDate": "1479721748", "commentID": 20556936, "userID": 48147869, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20556936}, {"approveDate": "1479723859", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741637", "permID": "20556981", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Switzerland", "parentID": null, "userDisplayName": "Sterling", "commentTitle": "<br/>", "commentBody": "There are two main problems with the TPP, one being that it empowers large corporations at the expense of small companies and ordinary people and second, that it is less about free trade than a blatant political attempt to exclude China and entrench America's collapsing hegemony in the region. Obama's \"pivot\" to the Pacific region was a clumsy failure in every respect (as, alas, were his Middle East policies), a reality he underscored by making his final presidential junket to Greece and Germany, not exactly the heart of Asia.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1738/9029/cropped-17389029.jpg?0.5689288555367896", "createDate": "1479723287", "commentID": 20556981, "userID": 17389029, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20556981}, {"approveDate": "1479730688", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741890", "permID": "20557569", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Anne-Marie Hislop", "commentTitle": "<br/>", "commentBody": "Agreed. Out-of-hand rejection of the TPP is shortsighted to say the least.  The thinking is that by doing so we are \"saving\" American jobs, but that is fantasy. Have our workers been hurting as the world changes? Certainly, but many of those jobs were not simply shipped overseas so that Mr. Trump can send out container ships to fetch jobs home. The jobs are lost for many reasons including automation and computerization. <br/><br/>A good step in keeping jobs at home is getting developing nations to raise their wages thus making it less profitable to ship some jobs out. Still, the answer for many of our workers is not a President-elect who promises magic, but retraining and/or further education.<br/><br/>If we cede the Pacific rim allowing China to dominate trade throughout the area, we may keep some companies at home, but we will have a much less advantageous market for the goods we do make. Our blue collar workers will also find that their \"blue light specials\" also cost them much more at the check out. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5990/0427/cropped-59900427.jpg", "createDate": "1479730646", "commentID": 20557569, "userID": 59900427, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20557569}, {"approveDate": "1479732608", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741919", "permID": "20557905", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Christine McM", "commentTitle": "<br/>", "commentBody": "\"If done right, the pact could stimulate exports while helping to reduce environmental destruction and improve the lives of workers in countries like Brunei, Peru, Chile and Vietnam, which were part of the negotiation.\"<br/><br/>With all due respect, I don't think Trump supporters care one bit about the lives and working conditions of workers in Brunei, Peru, Chile, and Vietnam. <br/><br/>It's hard to \"sell\" to the American people another trade deal, given the history of ones that contributed to unemployment in the rust belt and elsewhere.   I understand President Obama's concern about maintaining US influence in Asia, but I'm also of a mind to question why?  Does it have to be on trade? <br/><br/>In any event, we have a protectionist, America First-er President who will do his utmost to undo trade agreements.  Whether that works remains to be seen, given what I've read about his plans to gut NAFTA.<br/><br/>Killing trade deals will have one pretty immediate and ugly effect on average Americans: higher prices.  Consumer purchases, unfortunately, drive the economy.  Either we're going to have to make the same items here, or pay through the nose.  <br/><br/>I also fear recession or worse.  When people face higher prices and a volatile presidency that encourages chaos, they turn inward and try to save what they have.  Between tariffs, which sound good on paper until they tank the economy, the middle class and poor will suffer.  <br/><br/>Naturally, that is of little to concern to the ruling class which Trump now leads.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2073/520/cropped-2073520.jpg?0.18587254704312467", "createDate": "1479732575", "commentID": 20557905, "userID": 2073520, "recommendations": 43, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20557905}, {"approveDate": "1479740121", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479740121", "permID": "20558262", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bolivia", "parentID": null, "userDisplayName": "manfred marcus", "commentTitle": "<br/>", "commentBody": "   Yes; China would love Trump to blow TPP to smithereens, as it would consolidate China's power in the region. There must be a way to keep the project alive if it can be made fair for everybody. I would like to ask Bernie Sanders what may need to change to make this trade agreement acceptable (and NAFTA's, for that matter), so Nativism is moderated by offering a generous social safety net to those 'left behind', and retraining  and education in newer technologies to the one's able and willing to change and adapt to a more globalized economy (which, if destroyed by curtailing trade, would increase our 'pain and suffering'). Destroying trade is not the answer, we just need to improve it with imagination and the courage to accept the risks inherent in such an enterprise.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479734338", "commentID": 20558262, "userID": 47112177, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20558262}, {"approveDate": "1479740196", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479740196", "permID": "20559235", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Houston", "parentID": null, "userDisplayName": "J.S.", "commentTitle": "<br/>", "commentBody": "At a time when average Americans are suffering from stagnating wages and a lack of good jobs, it is mystifying why the Editorial Board would espouse another free trade agreement that would only exacerbate those problems. To advocate for the middle and lower class, which is the Board's normal position, but then support an agreement that would harm them is hypocritical. People are not stupid and they can see through the hypocrisy. Hillary Clinton did the same thing and lost the election because of it. The guiding force should be jobs, not playing geopolitics with China. If we don't fix our problems at home and provide for a stable job base, neither China nor anywhere else will matter because we cannot continue being a superpower without also being an economic power.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479738268", "commentID": 20559235, "userID": 77102177, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20559235}, {"approveDate": "1479740345", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1479740345", "permID": "20557569:20558533", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Anne-Marie Hislop", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "north east", "parentID": 20557569, "userDisplayName": "seeing with open eyes", "commentTitle": "<br/>", "commentBody": "Why do all the supporters of TTP focus on supposed job creation??<br/>I want to know why supporters are willing to give away American Democracy to create jobs.  TTP would allow foreign  corporations to sue the US government (Us taxpayers actually) if they believed US laws MIGHT lower  said corporation's future profits. Such a suit would be adjudicated and given the final word by a multinational, multi-corporate committee.<br/> So, it doesn't matter if Americans vote to institute fair labor practices, environmental sustenance,  natural resource protections, or anything else nothing will be able to be enforced if a foreign corporation  wins a committee decision in favor of profits.<br/>Please tell me, editors here, why am I paying taxes in support of American democratic government if that government's law can be overthrown by worldwide corporate greed 'trade' agreements?<br/>Exactly what foreign corporations are you all invested in???", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479735459", "commentID": 20558533, "userID": 40343536, "recommendations": 62, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20558533}, {"approveDate": "1479740638", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479740638", "permID": "20559692", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Union", "parentID": null, "userDisplayName": "Avi", "commentTitle": "<br/>", "commentBody": "I'm a little shocked to see all the anti-trade talks in the comment section. If anything, TPP plays a tremendous upper hand for the US. It protects the rising intellectual property industry, including all tech; and it opens the doors for our agricultural products to enter protected markets such as Japan or South Korea. <br/><br/>Are we able to save the slow dying low-tech manual manufacturing job from competing forces both within (machines) and outside (much cheaper labor) by shutting the door? No. That's a lost cause except for perhaps, lying to voters.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7695/9778/cropped-76959778.jpg", "createDate": "1479740011", "commentID": 20559692, "userID": 76959778, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20559692}, {"approveDate": "1479740848", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479740848", "permID": "20557822", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "cincy", "parentID": null, "userDisplayName": "scott", "commentTitle": "<br/>", "commentBody": "Americans are not interested in creating a better economy for Asia when we have a large swath of our country under employed. Trump, Clinton and Sanders all said no. Leave the NYC ivory tower and come to Ohio and I can show you why.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479732155", "commentID": 20557822, "userID": 69151106, "recommendations": 64, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20557822}, {"approveDate": "1479741028", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741028", "permID": "20559894", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco, CA", "parentID": null, "userDisplayName": "Bryan Z", "commentTitle": "<br/>", "commentBody": "Apparently the NYT Editorial Board still does not understand the middle class's message on trade deals as expressed in last week's election results. So let me be clear: no one cares about \"dominating\" the region! No one has a clear understanding of what our \"interests\" in the region are. No one believes that there is any way for the US to enforce other country's minimum wage, union, and environmental protection statutes. We DO care about the jobs we will lose at home and the towns that will become depressed and abandoned as a result of factories moving overseas. You fooled us once with NAFTA.  We won't be fooled again with TPP. For the record I am a well educated, liberal democrat.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479740859", "commentID": 20559894, "userID": 57775343, "recommendations": 102, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20559894}, {"approveDate": "1479741119", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741119", "permID": "20558343", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ipswich MA", "parentID": null, "userDisplayName": "Charlotte Abramson", "commentTitle": "<br/>", "commentBody": "The Times editorial fails to mention why the TPP is opposed by such unlikely allies as the AFL-CIO, Sierra Club, Public Citizen and John Birch Society: the Investor State Dispute Settlement (ISDS) provision. In the case of trade disputes -- say a multinational corporation contests constraints on its future profits due to a nation, state or municipality's environmental or workers' rights laws or regulations -- an international tribunal of corporate lawyers unaccountable to anyone would determine the outcome. (If you find this unbelievable, see Senator Elizabeth Warren's analysis.) Some opponents refer to the TPP as \"NAFTA on steroids\"; others as a \"corporate coup\" or an \"attack on US sovereignty.\"  Whatever one calls it, the TPP's ISDS provision alone should be grounds for rejection. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479734716", "commentID": 20558343, "userID": 17079990, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20558343}, {"approveDate": "1479741280", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1479741280", "permID": "20557627:20559986", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Diogenes", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cambridge, MA", "parentID": 20557627, "userDisplayName": "mjv", "commentTitle": "<br/>", "commentBody": "The \"devastation\" of the American worker began in 1981 with Ronnie Reagan's trickle down economics, war on labor unions, and happy acceptance of the migration of manufacturing out of the United States.<br/><br/>In particular, no policy in the last 50 years has been more responsible for the wealth imbalance in this country than Saint Ronnie's Voodoo Economics.<br/><br/>But yet again we see the Republicans living in a fact-free world.  And yet again, we see the Party of Personal Responsibility (tm) refusing to take responsibility for **ANYTHING**.<br/><br/>Fellow citizens, prepare yourselves for four years of this type of Republican  rationalization for Trump.  And after it all goes very, very badly wrong, expect them to find some way to blame it all on President Obama.<br/><br/>For that is what has become of \"discourse\" from those who happily voted for a racist, fascist monster.  And slapping the name of a Greek philosopher on such entry-level thinking does not mask its defectiveness for even an instant.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479741128", "commentID": 20559986, "userID": 8878328, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20559986}, {"approveDate": "1479741300", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741300", "permID": "20559966", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn", "parentID": null, "userDisplayName": "Navigator", "commentTitle": "<br/>", "commentBody": "The Editorial Board could not possibly be suggesting that at this moment in history the US take another step towards eliminating even more jobs in the heartland and throwing even more of the American working class under the bus? What would it take for the board to get it? Thousands of people with pitchforks and torches marching to the Times HQ and burning it down? The US is out of the globalization business for the time being. We need to retool. Good luck to China, we have been overlords in Latin America since the Monroe Doctrine and I do not think they have a lot to show for it. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2171/8272/cropped-21718272.jpg?0.04363735847297445", "createDate": "1479741087", "commentID": 20559966, "userID": 21718272, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20559966}, {"approveDate": "1479741970", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479741970", "permID": "20560203", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "<br/>", "parentID": null, "userDisplayName": "stuart itter", "commentTitle": "<br/>", "commentBody": "The TPP has barely been explained. Few understand anything about it. The bill was targeted by Bernie Sanders who said that the Mexican trade deal lost many jobs, and TPP Will lose jobs-vehemently and effectively. It became the mandate of the land. Being against it was the only viable position for Clinton and Trump.Republican congressional leeches will never support it-plus there is probably someway the Koch's make money on it further cinching the deal.  Still would be interesting to see it explained clearly and simply, with an emphasis on how it effects jobs and strengthens China.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479741832", "commentID": 20560203, "userID": 7206751, "recommendations": 12, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20560203}], "totalEditorsSelectionReturned": 16, "replyLimit": 3, "totalRecommendationsReturned": 16, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 349, "api_timestamp": "1488822358", "totalReplyCommentsFound": 109, "totalCommentsReturned": 16, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}