{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 913, "totalEditorsSelectionFound": 24, "depthLimit": 0, "totalRecommendationsFound": 1148, "comments": [{"approveDate": "1476087399", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476083799", "permID": "20079751", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 12, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "President Obama, prior to the debate, had captured Trump as one who \"pumps himself up by putting other people down.\"  That was on full display when Trump, on a downward spiral, rejected by those who finally saw the light and trapped by his own words, decided to waste a 90-minute forum by threatening Mrs. Clinton personally, repeating insults at her, expressing disappointment in Congressional Republicans for not taking her down, and even quarreling with Mike Pence's viewpoint.  What pettiness!  Such a small man could never be a great leader. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476073800", "commentID": 20079751, "userID": 40118532, "recommendations": 2153, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20079751}, {"approveDate": "1476087926", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476084326", "permID": "20079946", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Barrington, RI", "parentID": null, "userDisplayName": "Chris Watson", "commentTitle": "n/a", "commentBody": "But did anyone expect otherwise? Cornered and angry, I think everyone expected Trump to pursue a scorched earth policy. He didn't even wait for the debate to begin, kicking off with his \"press conference\" stunt. Did his aggressive approach (dare I say \"stalker-esque\" based on his prowling and glaring on stage) staunch the bleeding of GOP leaders? Probably. Was Hillary on the defensive and not at her best much of the night? Unfortunately so. But Trump still brought nothing to the table besides lies (sex tape tweet, anyone?), A random jumble of  words, a clear lack of anything vaguely resembling coherent policy, and misdirection (Aleppo? Let's talk about Mosul). Of course he went negative. He has nothing else left.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476075132", "commentID": 20079946, "userID": 5339073, "recommendations": 1048, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20079946}, {"approveDate": "1476088469", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476084869", "permID": "20080097", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Puget Sound", "parentID": null, "userDisplayName": "PugetSound   CoffeeHound", "commentTitle": "<br/>", "commentBody": "Trumps words showed him to be more practiced as he reeled off a long list of Clinton sins but he often became lost in a fog of his own language. It was his physical delivery that showed where he was mentally.  He had no idea what to do with his body in the space he was in.  Stand up, lean, sit down, pace, shuffle and glower and on and on.  He was like a confused angry bear.  His physical delivery showed a very defensive ill-at-ease speaker.  I think many people who said the debate was uncomfortable were caught up in his cornered animal presentation skills. I just wanted to open the cage door and let him run back to the woods.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6708/2268/cropped-67082268.jpg?0.9218288643628384", "createDate": "1476076477", "commentID": 20080097, "userID": 67082268, "recommendations": 1929, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080097}, {"approveDate": "1476088624", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476085024", "permID": "20080170", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Ken Nyt", "commentTitle": "<br/>", "commentBody": "Trump's handlers somehow managed to keep him more restrained tonight.  Yet the format made him seem far more menacing than the first debate, in which he seemed a childish fool.  Tonight he prowled the stage constantly while scowling and glaring at Clinton.  It was sickening, actually.<br/><br/>How did American democracy come to deliver such a contest for its leadership?  We seem so far off our rails.  Or perhaps our rails were never very sturdy after all.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476077180", "commentID": 20080170, "userID": 3228489, "recommendations": 1218, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080170}, {"approveDate": "1476089140", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476085540", "permID": "20080232", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Illinois", "parentID": null, "userDisplayName": "Ted S", "commentTitle": "<br/>", "commentBody": "The big loser tonight was, well, everyone. In a political landscape that keeps sinking to lower and lower depths, we now have presidential debates that resemble the shallowness of daytime talk shows. It's a disgusting bit of theater, treated like a college football game in the \"pre-game\" news \"analysis\" by the TV networks like CNN. This is not entertaining, and it's not entertainment - and hopefully enough people realize that on Election Day. <br/><br/>Trump is not even a clever idiot. He is the quintessential entitled bully, hurling threats, accusations and insults at anyone who dares to challenge him, particularly Hillary. She should be in jail, she should be ashamed, she's a failure, etc. <br/><br/>Hillary's biggest gaffe is calling the Trump supporters \"deplorables\" - but that was only a superficial political gaffe, because if Trump is elected, we're all truly deplorables for allowing that to happen. What have we come to as a nation that millions see him as a preferable alternative, even if they have indeed lost faith in Washington? <br/><br/>It's one thing to vote for an \"outsider,\" or someone with differing views than those in power, but this is so clearly much more, and much worse. It feels so disappointingly obvious that it's depressing to have to even say it. <br/><br/>I hope for the best, and will be voting accordingly.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476077850", "commentID": 20080232, "userID": 54049372, "recommendations": 1761, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080232}, {"approveDate": "1476090161", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476086561", "permID": "20080283", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Appleton, WI", "parentID": null, "userDisplayName": "logicplease", "commentTitle": "<br/>", "commentBody": "I think we've lost our collective minds. Have we gotten to the point where insults, bullying, sexual harassment, and shady dealings are the new norm for question topics at a Presidential debate? The saddest part of this all is the complete lack of focus on very real--even life-or-death--decisions that need attention now, from gun control and healthcare reform to foreign policy and veterans' care. Instead, our initial topics are a new tape once again proving Trump's complete lack of fitness for the office, and what seems like a millionth question about the never-fading email controversy. Can we please talk about things that affect Americans trying their best to survive in a complex and sometimes ruthless world? Clinton tried largely in vain to discuss topics like a rational adult, but that was apparently not on the agenda.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476078505", "commentID": 20080283, "userID": 48437955, "recommendations": 1559, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080283}, {"approveDate": "1476090627", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476087027", "permID": "20080458", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "India", "parentID": null, "userDisplayName": "K.S.Venkatachalam", "commentTitle": "<br/>", "commentBody": "The entire debate appeared to be farcical; with Trump demonstrating his intellectual bankruptcy while articulating his views on Syria and Iraq. Although, I would give credit to Hillary for having a broad understanding of the Syrian crisis, and also her honesty in refusing to commit the US soldiers on the ground, but she also could not give any strategy in dealing with Russia and Assad, who have caused havoc in Aleppo and other places by bombing civilian targets. <br/><br/>Trump exposed himself when one of the anchors asked for him to articulate his strategy  on Syria, he cleverly sidestepped the question, and continued his rant on Hillary and Obama thus giving exposing his  understanding of the Syrian crisis. The question is will America trust a man who preys on woman, avoids paying taxes by manipulating the law or is it to going to support Hillary, who appears to me matured and has a broad worldview and can be trusted to take decisions keeping the interest of the Americans at heart.. For the first time, the American voters have a clear choice before them.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5508/3635/cropped-55083635.jpg?0.78647849159154", "createDate": "1476081351", "commentID": 20080458, "userID": 55083635, "recommendations": 729, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080458}, {"approveDate": "1476091270", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476087670", "permID": "20080517", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SF", "parentID": null, "userDisplayName": "Michael Tyndall", "commentTitle": "<br/>", "commentBody": "Opinions vary about the relative debate performances of the two candidates, with Trump maybe winning or at least helping himself enough to stay in the race. <br/><br/>But I think HRC may have played rope-a-dope and intentionally avoided landing any knockout punches. She was comfortably ahead on points and Trump was seriously on the ropes going into the debate. <br/><br/>By giving Trump just enough oxygen to carry his campaign to the end, she hung his slimy candidacy around the necks of congressional Republicans and the party at large. And more anti-Trump bombshells are almost sure to fall. <br/><br/>Even if she wasn't that crafty, Trump's divisive run may have doomed the Republican party for years to come. One can hope.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476082752", "commentID": 20080517, "userID": 61747904, "recommendations": 1388, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20080517}, {"approveDate": "1476096135", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476092535", "permID": "20081191", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tampa, FL", "parentID": null, "userDisplayName": "Bruce", "commentTitle": "<br/>", "commentBody": "Trump said more than once that his exchange with Billy Bush on that bus were \"just words.\"  I have news for Mr. Trump.  As President, \"just words\" are the difference between starting a war, or ending one, calming a nation after a tragedy, or instilling fear, or signaling that you can work with other countries (or Congress) for the good of all, or alienating them to act against you.  Whether Trump actually assaulted women or not, he revealed what was in his heart.  He revealed that he is completely unfit and unqualified for this highest of offices.  His practice of bullying and belittling anyone who dares get in his way more exemplifies a dictatorship.  America is better than that, and deserves better for the leader of this country. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476095945", "commentID": 20081191, "userID": 68566230, "recommendations": 1553, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081191}, {"approveDate": "1476097190", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476093590", "permID": "20081281", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 15, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Stamford", "parentID": null, "userDisplayName": "ACB", "commentTitle": "<br/>", "commentBody": "I felt really intimidated by Trump walking, pacing behind Secretary Clinton as she replied to questions. Appearing like a shadowy thug, drifting past her with his menacing scowl. I felt his sheer nastiness and anger at being thwarted or disagreed with. I felt his insistent coercive focus to get what he wants at any cost and his lack of any empathy or caring.<br/><br/>I felt awful that he was allowed to bring in the women who had affairs with her husband, to intimidate and threaten her again. I was incredulous when he stated if elected he would bring in a special prosecutor to jail her; shades of the regimes in the Ukraine and Congo, and received cheers from the crowd. Has this ever happened before in a presidential debate or was it because she is a woman and he is again predating?<br/><br/>I wasn't suprised by his lack of policy in his replies. He had no understanding of Syria, just bluff. His barefaced re-lying about many things which somehow are now becoming less of a lie. Is this possible? His inability to answer the question, to keep on target. His ramblings and sheer dystopia about this country. He was obviously playing to his base and their hate for Secretary Clinton.<br/><br/>At the end I felt fearful for Hillary's personal safety round this man knowing what we know about him and her courage at persisting in her goal to be our next president. Very uncomfortable.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476097115", "commentID": 20081281, "userID": 61712547, "recommendations": 1727, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081281}, {"approveDate": "1476097744", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476094144", "permID": "20081334", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brighton Michigan", "parentID": null, "userDisplayName": "Parent in Brighton", "commentTitle": "<br/>", "commentBody": "Every time Donald Trump was asked a direct question last night, he never once answered it. So we still have no idea what he would do if he became President, just vague notions about building walls, etc. With every direct question, he went into attack mode and blamed Hillary Clinton for everything that has gone wrong in this country for the last 30 years. Does that seem reasonable? Not to me. This kind of fear mongering does our country no good. We need answers, Mr. Trump, not more insults!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476097654", "commentID": 20081334, "userID": 62180516, "recommendations": 825, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081334}, {"approveDate": "1476098034", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476094434", "permID": "20081383", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chevy Chase, MD", "parentID": null, "userDisplayName": "Richard M. Waugaman, M.D.", "commentTitle": "<br/>", "commentBody": "After Trump's typically boorish attacks on Alicia Machado's weight, I loved Hillary's slip when she trying to call for Trump to be \"fact checked,\" but at first it came out as a call for him to be \"fat checked.\" <br/><br/>Yes, indeed, someone should burst in on Trump when he is naked, as he boasts of doing to the nude contestants of the Miss Universe pageant. <br/><br/>We're no longer surprised when Trump unwittingly announces his own flaws when he transparently projects them onto someone else. <br/><br/>No, Donald, your opponent is not the one who belongs in jail.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6564/8382/cropped-65648382.jpg?0.08627710623108353", "createDate": "1476098008", "commentID": 20081383, "userID": 65648382, "recommendations": 790, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081383}, {"approveDate": "1476099483", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476095883", "permID": "20081525", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson, MS", "parentID": null, "userDisplayName": "David L, Jr.", "commentTitle": "<br/>", "commentBody": "Someone did apologize for the Trump tape, but it wasn't Trump. No, that was Billy Bush. Some of the past presidential debates have been airing on C-SPAN2. How far the country has fallen. Clinton, like most nominees, doesn't interrupt her opponent, answers the question, and sticks to the topic. By contrast, all Trump does, throughout the entire debate, is interrupt and stray from the subject. He gives no details, criticizes the moderators, the media, etc.<br/><br/>Trump has gotten this far because of his tough-guy persona, his \"civility is effeminate\" attitude, his willingness to \"tell it like it is.\" I recently heard Jon Meacham say that George H. W. Bush was almost constitutionally incapable of talking about himself. And now the Republican Party has nominated someone who is constitutionally incapable of doing anything but. Trump cannot tolerate criticism or the appearance of fallibility. He constantly complains that Clinton hasn't made the country paradisiacal, as if she's had autocratic ability.<br/><br/>He's so ignorant of the country he's running to lead she had to remind him that the president has a little thing called veto power. He said nothing of substance all night and yet that was somehow considered an achievement. This tells you how ridiculous Trump is. As long as he doesn't spontaneously combust on national television, for this would-be dictator, that's an accomplishment.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6688/9060/cropped-66889060.jpg", "createDate": "1476099278", "commentID": 20081525, "userID": 66889060, "recommendations": 690, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081525}, {"approveDate": "1476099843", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476096243", "permID": "20081577", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Louisville", "parentID": null, "userDisplayName": "Steve", "commentTitle": "<br/>", "commentBody": "The reviews this morning called the event a barroom brawl and a mud pit, painting both candidates as sinking to low levels. Hillary Clinton did not, in fact, sink to low levels - perhaps she should have. The irritating false equivalencies once again took over the conversation. Hillary was blamed for not having good-enough explanations of her Syrian policy, her Wall Street speeches, her defense of ACA, her email server, even Benghazi. Trump was credited for sidestepping his indefensible boys-on-the-bus conversation and for keeping Hillary on the defensive with his incoherent blurts. Journalists seem to have become exhausted trying to expose all his non-factual statements of fact, simply throwing up their hands as if we all know this for what it is, so why bother continuing to discuss it?<br/><br/>Trump was rude, bullying, threatening, lacking in any substantive knowledge, and - once again - simply a liar. But Chris Matthews proclaimed him the winner and David Brooks sadly shrugged and said nobody won. Really? Hillary didn't win by being informed, experienced, rational and civil? If she resorted to talking points, at least they were smart talking points. If she was criticized for being wonky, wonkishness is better than ignorance. If her remarks to Wall Street bankers were difficult to defend or explain, they were more defensible than Trump's remarks to Howard Stern. Howard Stern?? Is that the state of our politics anymore? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476099695", "commentID": 20081577, "userID": 74053584, "recommendations": 1438, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081577}, {"approveDate": "1476101641", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476098041", "permID": "20081746", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, IL", "parentID": null, "userDisplayName": "Kimberly", "commentTitle": "<br/>", "commentBody": "The charlatan named Trump can't answer a single policy question with details. \"Bigly\" or \"the best\" don't cut it. The voters deserve specifics. Hillary Clinton is able to do that with great detail.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3334/2571/cropped-33342571.jpg?0.8989371717907488", "createDate": "1476100878", "commentID": 20081746, "userID": 33342571, "recommendations": 572, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081746}, {"approveDate": "1476101753", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476098153", "permID": "20081765", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 22, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "virginia", "parentID": null, "userDisplayName": "happyteacher72", "commentTitle": "<br/>", "commentBody": "This morning, I have begrudgingly decided that I am no longer supporting Mr. Trump for President. The manner in which he circled around, stared at, and verbally menaced H.C. reminded me of a male companion who attempted to intimidate me on several occasions before eventually, physically striking my face. Unfortunately, I've seen his type of behavior before. Even my dad has declared that he won't be voting this election.  Sad, but true. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476100997", "commentID": 20081765, "userID": 77016904, "recommendations": 882, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081765}, {"approveDate": "1476101963", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476098363", "permID": "20081814", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "Bubba", "commentTitle": "<br/>", "commentBody": "I am old enough to have watched the Kennedy - Nixon debate in the 1960 election.  Imagine: Two intelligent, skilled political leaders discussing the issues in a respectful and civil manner.  Voters actually obtained useful information to help make a decision as to which candidate should receive their vote.  Clearly, either of these candidates would have made an effective President, based on the tenor of the debate.<br/><br/>Watching the \"debate\" last night was depressing beyond words.  A debate could have occurred, however there was one political leader and one \"reality TV\" star present.  What a waste of time.  Perhaps Americans will see how far we have fallen and make this election the outlier. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476101250", "commentID": 20081814, "userID": 53819729, "recommendations": 410, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081814}, {"approveDate": "1476102010", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476098410", "permID": "20081821", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florida", "parentID": null, "userDisplayName": "Katherine Bailey", "commentTitle": "<br/>", "commentBody": "I'm sad that we as Americans have allowed ourselves to come to this disheartening spectacle.  We are all complicit to some degree, for failing to insist that standards be upheld, and choosing entertainment in place of journalistic standards.  But the majority of guilt goes to conservative Americans who stood silently by while their party descended into cartoonish hypocritical madness.  Your political representatives only did what you allowed them to do, growing ever more extreme and divorced from reality as they threw you the bait of issues they pretended to care about to get your vote.  And guess what:  same-sex marriage is now the law of the land, and abortion hasn't been banned, and the race discussion still isn't going your way.  But look what happened while you were fighting to take away other people's rights.<br/><br/>Woe to the republic.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6862/3930/cropped-68623930.jpg?0.1325808297911979", "createDate": "1476101299", "commentID": 20081821, "userID": 68623930, "recommendations": 444, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20081821}, {"approveDate": "1476104042", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476100442", "permID": "20082361", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Joan", "commentTitle": "<br/>", "commentBody": "One of the more shocking things I've seen in this truly deplorable election season, was Donald Trump putting four women on stage, as much on display as any contestant in one of his Miss Universe pageants.<br/><br/>I felt aching compassion for these women, obviously in pain, who allowed themselves to be used in a political stunt and deep, deep contempt for the man who did it. I might say 'beneath contempt,\" but this vastly human being has made contempt a bottomless pit.<br/><br/>Given the remarks he made about women ten years ago, I could not help but imagine what he would say about these women in private, once he made sure that there were no live microphones in the room.<br/><br/>His physical demeanor on stage, stalking Secretary Clinton, revealed his propensity to regard women as prey. It may have been locker room talk ten years ago, but this was a brazen attempt at physical intimidation. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4428/5543/cropped-44285543.jpg?0.15212127909575934", "createDate": "1476103784", "commentID": 20082361, "userID": 44285543, "recommendations": 573, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20082361}, {"approveDate": "1476104141", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476100541", "permID": "20082116", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Where? Not high enough!", "parentID": null, "userDisplayName": "flak catcher", "commentTitle": "<br/>", "commentBody": "To dismiss Trump by saying that Hillary was the only adult on the stage is to display a lack of appreciation for the corner we Americans find ourselves painted into. It's the sort of comment that the self-satisfied make to demean someone.<br/>The truth, however, is something else. Trump is a danger to our nation and the world. The man is brilliant, unbalanced, and ruthless.<br/>I thought he gave an extraordinary performance. Relentless, completely confident, demonstrating at the same time his complete disdain for Clinton.<br/>This is the man whom Hillary will be facing for the next three weeks. Throw away the tea cups and find yourself a pair of brass knuckles. Hit him below the belt and above it then dissect him in the middle.<br/>This is a war for our nation's heart. Fight it. Don't diminish it.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6371/2264/cropped-63712264.jpg?0.1917420052923262", "createDate": "1476102686", "commentID": 20082116, "userID": 63712264, "recommendations": 238, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20082116}, {"approveDate": "1476104765", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476101165", "permID": "20082515", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Judy Flute", "commentTitle": "<br/>", "commentBody": "I like the use of the word \"prowling\" in this apt assessment of the 2nd debate.  In my humble opinion, Donald Trump was an ominous threatening presence both physically - pacing and \"prowling\" behind Hillary Clinton as she attempted and succeeded in outlining coherent and sometimes compassionate policy and out-reach stances, and verbally threatening this highly accomplished and esteemed woman with imprisonment. And other primarily groundless accusations.Though she has helped so many children and adults by implementing her progressive policies, he accused her of having hatred in her heart.  This is truly a wound to the women of this country. His body language should speak to every woman who watched the debate.  This man is a predator.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476104443", "commentID": 20082515, "userID": 76534258, "recommendations": 771, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20082515}, {"approveDate": "1476114001", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1476110401", "permID": "20080861:20084850", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Naomi", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn NY", "parentID": 20080861, "userDisplayName": "Inquisigal", "commentTitle": "<br/>", "commentBody": "Naomi, I thought the same thing about Trump's constant referrals to African Americans and inner city poverty; I live in a black-majority neighborhood in NYC, and the residents on my block include two lawyers; the director of a non-profit sports organization; a professional basketball player; an engineer, and conversely administrative assistants, dental hygienists and graphic designers. That Trump talks about African American communities in urban areas as if they're poverty-stricken war zones only perpetuates a dangerous stereotype that actually gives fuel to those Americans who don't actually have real-life exposure to any black people or communities, and who then regard all black Americans through a biased and condescending perspective.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476113416", "commentID": 20084850, "userID": 41775277, "recommendations": 244, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20084850}, {"approveDate": "1476114004", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476110404", "permID": "20084961", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "cj", "commentTitle": "<br/>", "commentBody": "Asked about the tape, Trump had no answer other than his \"locker room banter\" excuse. This is because his actions demonstrate a life long pattern of misogyny. How could he deeply apologize for something that is a core part of his essence?<br/><br/>Asked about how he would address Islamophobia, Trump falsely blamed Muslims for not speaking up about San Bernardino (no one saw the bombs) and had no answers or ideas. Asked about the humanitarian crisis in Syria, Trump had no ideas about how to help Syrian children in danger. His crude attacks during the debate were horrifying, along with his predilection to blame Hillary or the moderators for any conceivable topic. All of his posturing couldn't hide the fact that he is a candidate of no ideas, save recycling failed policies from the past-- cutting taxes for the rich, turning back to coal.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476113833", "commentID": 20084961, "userID": 15929499, "recommendations": 163, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20084961}, {"approveDate": "1476131465", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476127865", "permID": "20087111", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Denver, Colorado", "parentID": null, "userDisplayName": "Dina Krain", "commentTitle": "<br/>", "commentBody": "Anyone notice that Donald Trump refused to directly answer the Muslim women's question if her personal freedom in the U. S. would be at risk if he became president? I took away from his rambling answer that she has a justifiable reason to be worried, if not before his answer, than after he gave it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476122741", "commentID": 20087111, "userID": 68064539, "recommendations": 104, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20087111}], "totalEditorsSelectionReturned": 24, "replyLimit": 3, "totalRecommendationsReturned": 24, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1501, "api_timestamp": "1488822369", "totalReplyCommentsFound": 588, "totalCommentsReturned": 24, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}