{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 9, "totalParentCommentsReturned": 16, "totalParentCommentsFound": 349, "totalEditorsSelectionFound": 25, "depthLimit": 0, "totalRecommendationsFound": 433, "comments": [{"approveDate": "1454885526", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454933891", "permID": "17488696", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ashland, Oregon", "parentID": null, "userDisplayName": "Patrick", "commentTitle": "<br/>", "commentBody": "The last sentence resonated with me. Not only should immigration not be on the list, most of the fears on the list shouldn't be on the list. What I've noticed, especially since 2001, is that most GOP candidates for anything, tell the electorate that it should be afraid...very afraid. Yes, there's always the obligatory comment about making America great again, whatever that means. But, the thrust is about fear.<br/><br/>If a message, a lie, is repeated over and over, for a long time, it begins to embed itself, to take root, even among intelligent people. Even those who don't really believe the lie(s) begin to wonder whether they've missed something...\"maybe everyone else is right. Maybe I should fear this or that\". <br/><br/>Instead of speaking about things like hopes, aspirations, dreams, equality, tolerance, acceptance, etc., the GOP speaks to the reptilian portion of our brain stems...the place where our basest emotions have rested for eons. Some of the candidates probably believe their own list, but, the majority are simply power hungry and cunning, and they know exactly what they're doing. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1794/0785/cropped-17940785.jpg?0.24592088866387496", "createDate": "1454885477", "commentID": 17488696, "userID": 17940785, "recommendations": 613, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17488696}, {"approveDate": "1454902028", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454933920", "permID": "17489410", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "And now for something completely different …<br/><br/>It wasn’t “fear and hatred”, but early times still in a Republican primary season with too many contenders, in which each still seeks to differentiate himself from the herd. The days when these were games contended by gentlemen are long over. The presence of Donald Trump alone makes that plain as a pikestaff.<br/><br/>Moreover, Trump’s immigration plan focuses on prevention, which is an absolute requirement of Republicans. There will be no Republican support of a road to citizenship for 11 million unlawful immigrants UNTIL Republicans are satisfied that we can shut the spigot. An amnesty granted a generation ago BEFORE such means were in place resulted in a lack of funding and the 11 million. It won’t happen again. Period. Rather than criticizing a very important Republican priority during a primary process in which the editors are unlikely to participate with their votes, you might analyze his approach rather than criticize his priorities, which are universal on the right.<br/><br/>The governors did very well, the others less so, and Rubio was gang-somethinged, particularly by Christie. Focusing on the governors, Bush, Kasich and Christie, would do the most to nominating someone who could win against Hillary in November. There really should be a law that legislators, reality show stars and neurosurgeons can’t run for president unless they first go and run something more complex than a community organizing staff.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1454901990", "commentID": 17489410, "userID": 47123844, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489410}, {"approveDate": "1454922656", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454922656", "permID": "17488826", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "petey tonei", "commentTitle": "n/a", "commentBody": "New Hampshire is full of  immigrants. Back when DEC had facilities all over NH, the place was sprawling with highly talented immigrants of all stripes. Indian American community has a huge presence, including political participation (Clinton followers). They would not appreciate this  kind of  immigration exclusion talk by republicans, it's going to turn them off.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/8745/43/cropped-874543.jpg?0.8669581224676222", "createDate": "1454888382", "commentID": 17488826, "userID": 874543, "recommendations": 36, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17488826}, {"approveDate": "1454922744", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454922744", "permID": "17488847", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WA State", "parentID": null, "userDisplayName": "Dairy Farmers Daughter", "commentTitle": "<br/>", "commentBody": "In a way it's odd that the Republicans are fixated on illegal immigration when the business community (who largely support the GOP) has benefited from illegal immigrants.  Corporate farmers, construction companies, hotel chains, slaughter houses, etc have been all too willing to use the labor of these people.  I wonder how much the candidates running for office really would do to eliminate illegal immigration - or are they just playing to their base?  There doesn't seem to be anything in their proposals to crack down on the employment of illegals, or any proposals to work with countries supplying the current crop of migrants (mostly central American).  Without addressing these root issues - violence and lack of economic opportunity at home, and willing employers in the U.S. -  I don't see any of the schemes proposed actually working.  But it sure sounds good on the campaign trail.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454888850", "commentID": 17488847, "userID": 65160147, "recommendations": 166, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17488847}, {"approveDate": "1454923240", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454923240", "permID": "17489010", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland", "parentID": null, "userDisplayName": "Lindy", "commentTitle": "<br/>", "commentBody": "Immigration is a big issue because many people believe that the law should be enforced and that we all should play by the same rules. Under our laws you are not allowed to work in this country if you have entered illegally. We have a legal immigration system that admits 1 mil legal immigrants each year. More then all other countries on the planet combined. With an additional 800,000 guest workers and 75,000 refugees each year. Many people think we have no obligation to do anything for illegal aliens who decided to disobey the law. Don't like the current immigration laws then do the hard work of convincing Congress to change the immigration laws. Congress won't change the laws then do the harder work of getting the people to elect a new Congress.That is the way the system is supposed to work. While illegal aliens are waiting they can do what one million legal immigrants do each year and apply for entry through the legal immigration system. What you do not do is go around the Congress and the taxpayers to award benefits to non citizens that the people through their representatives have said they do not deserve. What Obama has done with an attempted backdoor amnesty in violation of the law and against the will of the people has poisoned the entire immigration debate.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454892286", "commentID": 17489010, "userID": 9086611, "recommendations": 42, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489010}, {"approveDate": "1454923886", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454923886", "permID": "17489143", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westchester, NY", "parentID": null, "userDisplayName": "NI", "commentTitle": "<br/>", "commentBody": "New Hampshire is afraid and angry. They have many reasons to be. To them immigration is a very big issue, but the liberal State with rightward leanings hopefully will not make it a be all and end all issue. The solid wall at our Southern border paid for by our Southern Neighbor,  ridiculously proposed by one of the Candidates who seems to represent NYC started this frightening trend cashing on the fear of the working class electorate. But Trump is a disgrace to NYC where people are liberal and inclusive although personally are quite conservative.Choosing Trump would be New Hampshire's biggest folly going only on the cadence of NYC. And Cruz? The less said the better. And the troubling part is the rest of the Republican Candidates instead of trying to find the middle ground are competing against each other to be one up in the race to the top, the race to be the worst.Every candidate is getting worse and worse, including the baby-faced Rubio who can get easily derailed by the likes of Chris Christy. At least Christy removed Rubio's mask by tearing at his prepared scripts and how he has metamorphosed in front of our eyes, expediently joining the bandwagon for harsh and downright cruel immigration solutions. The only exception is Gov. Kasich who wants realistic immigration changes minus the complete upheaval to human lives. New Hampshire, a lot rests on you and your inherent pragmatism, conquering the viciousness  and bile with compassion, if not love.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454894667", "commentID": 17489143, "userID": 71181385, "recommendations": 40, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489143}, {"approveDate": "1454931036", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454931036", "permID": "17489202", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Providence, RI", "parentID": null, "userDisplayName": "Mike Edwards", "commentTitle": "<br/>", "commentBody": "“Mr. Kasich said, again, that deportation of 11 million people is unrealistic”<br/><br/>Last November, Paul Ryan said he will not push for any immigration reform legislation until after President Barack Obama leaves office because “Obama’s executive actions on immigration have shown him to be untrustworthy on this issue.” In January, 2017, Mr. Ryan will find some other excuse, as did his predecessor, John Boehner.<br/><br/>President Obama’s recent actions to allow millions of undocumented immigrants to become eligible for work authorization and associated benefits have been blocked by the federal courts in response to challenges brought by Texas and 25 other states.<br/><br/>Immigration and Customs Enforcement reported last June that there has been a striking decline in worksite enforcement of laws meant to deter the hiring of illegal immigrants. <br/><br/>In 1986 President Reagan signed the Immigration Reform And Control Act which legalized almost 3 million undocumented immigrants and promised Americans far greater border security. We now have a further 11 million illegal immigrants and Republicans calling for greater border security.<br/><br/>What do all these recent statements and actions tell us? Quite simply that nothing will be done to reform immigration and the status quo will continue. Anyone looking to the Presidential debates for constructive solutions will continue to be disappointed.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454896467", "commentID": 17489202, "userID": 50490071, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489202}, {"approveDate": "1454940498", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454940498", "permID": "17491641", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bolivia", "parentID": null, "userDisplayName": "manfred marcus", "commentTitle": "<br/>", "commentBody": "    Immigration is the 'whipping boy' for republican fear- mongering, given that it seems to resonate in some quarters, a shame really, given there are so many other worthwhile projects of concern. Rubio would be far ahead if he were consistent; but with the non-existent courage of his convictions, a hypocritical stance instead, he does not deserve the spotlight, and much less be considered a candidate for the presidency. Insofar Cruz is concerned, as he decided to make enemies even in his own party, tremendously disliked for his arrogance, it is to hoped he'll lose traction along the way. Trump, a narcissist who 'must' be first and best in everything, may yet drop out as losses accumulate. Quite frankly, Kasich is the most moderate, least angry, and with the experience of accomplishments in governance. Still, for the country's well-being, a democrat ought to continue at the helm, if the electorate wakes up to reality and wants things done. Government is of the essence, and obstructionism a drag to its functioning as intended.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454938503", "commentID": 17491641, "userID": 47112177, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17491641}, {"approveDate": "1454940584", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454940584", "permID": "17491599", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boise, Idaho", "parentID": null, "userDisplayName": "Todd", "commentTitle": "<br/>", "commentBody": "What exactly does the NYT's editorial board expect Hillary Clinton or Bernie Sanders to say about what their plans regarding immigration are until and if one of them becomes President?  What's the point to conjecture regarding the upcoming Supreme Court decision?  Both of them have saner and more compassionate immigration policy statements than any of the Republican candidates but only when they're in the office, only when they know what kind of Congress they're working with, and only after the Supreme Court decides whether there are stricter limits on the executive authority of the office regarding immigration policy can they begin to lay out a specific plan.  I am the descendent of grandparents who were immigrants and the one thing I do know is what they came to this country for is not represented by any of the hate the Republican candidates and party are spewing and that either Democratic candidate is far preferable to the intolerance of a Donald Trump or the horrifying positions of either of the Latino candidates.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454938388", "commentID": 17491599, "userID": 19373457, "recommendations": 112, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17491599}, {"approveDate": "1454945822", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454945822", "permID": "17488696:17489601", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Patrick", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bronx, NY", "parentID": 17488696, "userDisplayName": "SR", "commentTitle": "<br/>", "commentBody": "\"If a message, a lie, is repeated over and over, for a long time, it begins to embed itself, to take root, even among intelligent people. Even those who don't really believe the lie(s) begin to wonder whether they've missed something...\"maybe everyone else is right. Maybe I should fear this or that\".\"<br/><br/>That's what disturbs me most about the Florida senator; though he seems to (and very much did) amuse by becoming Marco Roboto, his dog-whistle message about how Obama is changing America to be more like the rest of the world was not entirely a malfunction.  It carries undertones of fear, and conjures old images of the Mexicans--or the Muslims--coming to take our guns, jobs, and women and instill sharia and drug violence and all that.  I'd say that, as a Latino, he should know better; but he seems more and more like an aspiring *former* Latino who'd rather not know better to gain votes.<br/><br/>In short, and in his own words (to use them yet again), \"he knows exactly what he's doing.\"  He's insisted as such since, and if he repeats his lies about Obama over and over through the primaries it may well combine with Trump's vitriol to rouse their Violent Majority to return to outright prejudice long after these elections, whether they win or lose.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4274/0473/cropped-42740473.jpg", "createDate": "1454907897", "commentID": 17489601, "userID": 42740473, "recommendations": 45, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489601}, {"approveDate": "1454945981", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454945981", "permID": "17489273:17489635", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "usa999", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": 17489273, "userDisplayName": "Steve Mumford", "commentTitle": "<br/>", "commentBody": "Usa999, you say you've \"never seen an undocumented immigrant take a job from an American citizen\".<br/>Well how's this:<br/><br/>When I was younger I did construction work, whatever I could find. I did a lot of painting and minor carpentry jobs and was forced to keep my prices at rock bottom because of competition from Mexican laborers.<br/>I remember once bidding on a demolition job, paying myself and my helper minimum wage; the building owner laughed at my price. He said he could get the job done for half of my price with illegal workers.<br/><br/>Would you consider that taking a job from an American citizen?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454908703", "commentID": 17489635, "userID": 36519370, "recommendations": 39, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17489635}, {"approveDate": "1454948757", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454948757", "permID": "17490627", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": null, "userDisplayName": "mogwai", "commentTitle": "<br/>", "commentBody": "I am angry at those who are angry.  I am afraid of those who are afraid.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454934488", "commentID": 17490627, "userID": 69618335, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17490627}, {"approveDate": "1454949981", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454949981", "permID": "17489273:17490431", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "usa999", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New England", "parentID": 17489273, "userDisplayName": "Naomi", "commentTitle": "<br/>", "commentBody": "You misseth usa999's point, O Richard.  These migrants have no power.  Therefore, it is not the migrants TAKING jobs away.  It's the employers in control  who are GIVING the jobs away to migrants, because it's cheap and convenient.   If employers don't hire them, there is nothing for migrants to \"take.\"   The employer is the one who is stealing jobs from citizens.<br/><br/>But...holding employers to account would harm their profits, and worse, might benefit unions -- both anathema to Republicans  So we will keep treating workers, legal AND illegal, like so many fungible widgets.   The border will never be \"secure\" enough for Republicans to pass an real immigration bill, because our current system works for the people who matter, the business owners.  The migrants are cheap, and when the natives get angry about jobs, the migrants can be served up to them as an easy scapegoat, letting business continue as usual, oblivious to the human and social fallout.<br/><br/>Richard, this is the truth and you know it.  All the oratory about \"law-breaking migrants\" is just cover for policies that elevate the interests of law-breaking businesspeople over ordinary citizens and the national good.  They have the power, but won't shut off the spigot so long as the flow is proftable.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454932635", "commentID": 17490431, "userID": 67454483, "recommendations": 94, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17490431}, {"approveDate": "1454950091", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454950091", "permID": "17489177:17490461", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "WBS", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ann Arbor, Michigan, USA", "parentID": 17489177, "userDisplayName": "John Frank", "commentTitle": "<br/>", "commentBody": "Don't blame Rubio -- nobody has informed him that Obama is not running for office this November.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454932905", "commentID": 17490461, "userID": 66316536, "recommendations": 43, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17490461}, {"approveDate": "1454950219", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454950219", "permID": "17489347:17490670", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "stu", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New England", "parentID": 17489347, "userDisplayName": "Naomi", "commentTitle": "<br/>", "commentBody": "Richard, I know you remember when Republicans negotiated policy with Democrats, and were pleased when a bill reflected their input.    Remember those days, when they didn't vow on Inauguration Day to destroy a Democratic presidency?  Remember when they didn't run screaming from their very own ideas the second a Democrat actually accepted them?    Remember when politics was not always a total war between pure good and pure evil?   Remember when Republicans were the rational, pragmatic guys?  I do.  I miss 'em.   What happened?   When did their goal shrink from \"promoting the general welfare\" of the nation down to \"destroying the Democratic party\"?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454934815", "commentID": 17490670, "userID": 67454483, "recommendations": 95, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17490670}, {"approveDate": "1454950386", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454950386", "permID": "17490755", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kansas City, MO", "parentID": null, "userDisplayName": "kcbob", "commentTitle": "<br/>", "commentBody": "John Kasich is the lone Republican who is not a charlatan, an extremist, an elitist, or a bit off kilter.  He used to be considered a solid conservative.  Now, he's close to being a RINO.<br/><br/>These days, you must pledge to harm the government or heal it with magic.  Or with tough love.  And you must ignore the actual accomplishments of President Obama and spew hatred toward him.  Most important, you must not offer any real proposals.<br/><br/>Back in the nineties, then House Budget Chair Kasich worked with Bill Clinton to make sure the budget was balanced.  He also chose recently to accept Medicaid expansion in Ohio because it was good for his people.  Such actions are now considered sins.<br/><br/>This is how far the party has moved in twenty years.<br/><br/>Only in a party as empty and angry as today's GOP could a Marco Rubio be seriously considered Presidential material.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454935412", "commentID": 17490755, "userID": 23225364, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17490755}, {"approveDate": "1454950878", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454950878", "permID": "17489568:17492087", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Nick Metrowsky", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New England", "parentID": 17489568, "userDisplayName": "Naomi", "commentTitle": "<br/>", "commentBody": "Nick, I agree with your goals, but not your caricature of Hillary.  She's not just an extension of her husband.  And don't forget, the Republicans have had 16 years to slime both Clintons with lies &amp; innuendo, which you seem to believe, despite the source.  There's a reason Republicans constantly attack her but praise Bernie, and it's not because they like what Bernie stands for.  <br/><br/>I don't know how old you are, but I remember the Clinton years.  They were the most stable &amp; prosperous years of my adult life.  Hillary worked to reform healthcare and promote women's rights.  Those good years ended with 9/11 and Bush's wars for oil.  Hillary is a lot smarter and stronger than that -- she'll be a good president &amp; appoint justices like Kagan or Sotomayor.  If a Republican appoints more Scalias, none of your goals will be realized in our lifetimes.<br/><br/>Please, you can love Bernie without hating the Clintons.  I like Bernie too, but he hasn't yet been tested in southern states or against the Republican character shredder.  So please, don't trash Clinton and her supporters -- we need them,<br/>because this project goes far beyond Bernie.  The nation is so divided that change will take many years.  We have to vote for Democrats in every local, state &amp; national election, work on campaigns, run for local and state office, or recruit others to run...and finally, not alienate potential supporters who don't fully share the vision.   It's a marathon, not a sprint.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454939872", "commentID": 17492087, "userID": 67454483, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17492087}, {"approveDate": "1454951134", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454951134", "permID": "17489468:17492498", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Tom Anderson", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Albany", "parentID": 17489468, "userDisplayName": "Lee Harrison", "commentTitle": "<br/>", "commentBody": "That \"Obama knows exactly what he is doing\" is right-wing dog-whistle.  It is a play to extreme right-wing theories that Obama is some sort of anti-christ + Lord Voldemort + Sauron who is engineering the muslim defeat of the righteous in America with the aid of satan.  <br/><br/>The Republican right is faced with an existential problem: why did the public elect Obama twice?  Why has the Republican party been unable to get its way despite holding majorities in the house and senate?   Declaring Obama an incompetent fool and playing on the stereotypes of blacks hasn't worked -- Obama just keeps beating them.  <br/><br/>So obviously he must have made a pact with the devil or something.  Nothing else explains it eh?  Particularly to dimbulbs with nothing more on the ball than Rubio has.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454941153", "commentID": 17492498, "userID": 1258177, "recommendations": 50, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17492498}, {"approveDate": "1454951665", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454951665", "permID": "17493043", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "It seems to be a Republican you have to be born angry and afraid. A female supporter of Rafael, the Canadian Cruz missile, brought her young child with her. Cruz, delivering his usual Fire and Brimstone speech with little regard for the audience, tells the crowd in his supremely annoying pious voice that \"the Earth is on fire!\". Great. With that, I'd be looking for the Exit sign. <br/><br/>But there's more to this tale. When this woman's child questions Mommy, \"Is the Earth on fire?\", before she can answer, the self-righteous Cruz raises his voice to interrupt Mom, \"Yes, the Earth is on fire!\" he repeats.<br/><br/>Last week, I was watching the BBC World Service and it was reporting from New Hampshire. It shows Cruz getting off his bus, and then attempting to kiss some kids for one of those sugar sweet photo-ops. When Cruz went to kiss his own daughter she pushed her Daddy's face away, lurched back, and shrieked. I guess in the Cruz family disgust in a sign of love, right? Ah the Cruz Family Values at work here. <br/><br/>With a sneering smile to rival Dick Cheney's and the rhetoric of Tail Gunner Joe McCarthy this horrid piece of political slime has displayed to the nation why even the most convivial body in Congress, the Senate, despise this guy. To know him is to hate him. And he loves the Hate! <br/><br/>Good thing Will Rogers is gone. His most famous line. \"I never met a man I didn't like\" would be dashed to the ground. of this still spinning blue and white marble we call Earth.<br/><br/>DD<br/>Manhattan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454942809", "commentID": 17493043, "userID": 22528152, "recommendations": 42, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17493043}, {"approveDate": "1454951783", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454951783", "permID": "17493157", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "purpledot", "commentTitle": "<br/>", "commentBody": "The disarray of the Republican candidates and the Party's inability to coalesce around a reasonable, inclusive platform, is bizarre. Turning our back on the world at our doorstep is not leadership; criminalizing women and girls who need health care is not leadership; incessantly reducing taxes for the wealthy is not leadership, and shouting craven falsehoods that government is not necessary for the common good, is dangerous.  The Republicans are lost in their power forgetting that the United States of America is all of us. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454943130", "commentID": 17493157, "userID": 56731844, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17493157}, {"approveDate": "1454951924", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454951924", "permID": "17491736:17493638", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Mark Thomason", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Europe", "parentID": 17491736, "userDisplayName": "Red Lion", "commentTitle": "<br/>", "commentBody": "'But there is some weakness there...'<br/><br/>Some? Don't get me wrong. I love Bernie. I feel me some Bern. But as a national candidate, there is nothing to suggest he would win against any of the less overtly insane GOP candidates. Every single ad the GOP runs will start with the words SOCIALIST BERNIE SANDERS WANTS TO [insert big lie here].<br/><br/>He won't carry a single southern state. He'd be iffy in Pennsylvania, very iffy in Ohio, especially if Kasich is on the ticket. Normally slightly-better-for-Democrats- than-most-swing-states like Colorado, Michigan and Wisconsin aren't going to be easy for him.<br/><br/>It would be a much much better world if the US were a country that could and would elect a Bernie Sanders or an Elizabeth Warren to the Presidency. But it isn't and it won't be in 2016. <br/><br/>And that's even if he develops a foreign policy and comes up with a way to pay for free tuition and single payer -- not that either is likely to get a vote in Congress, much less pass -- that goes beyond 'raise taxes'. Yes, every sane grown-up knows that is what needs to happen. <br/><br/>But sane grown-ups do not dominate on US election days too much of the time.<br/><br/>Remember the McGovern, Humphrey, Mondale, Dukakis and Kerry Presidencies?<br/><br/>Grit your teeth if you have to, but keep the GOP out of the White House.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/7241/cropped-47127241.jpg?0.9181589698418975", "createDate": "1454944520", "commentID": 17493638, "userID": 47127241, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17493638}, {"approveDate": "1454952642", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1454952642", "permID": "17489680:17494773", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Betty Greenwald", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": 17489680, "userDisplayName": "Joan Staples", "commentTitle": "<br/>", "commentBody": "I differ with Obama on some issues, especially education.  But why do you think the Republicans are an alternative?  The media spends times on polls, debate performance, etc., but rarely talks about issues.  For example, Rubio is called \"less extreme.\"  Really?  The man who wants to prevent abortion for any reason?  Who wants to tear up treaties that might prevent war?  Of course, he would make Cuba our enemy again.  Reverse the Supreme Court on gay rights?  And, then, there's the demagogue Trump, who would not legislate, but wave his magic wand to get rid of immigrants, etc.  None of the candidates of the GOP cares about more than power.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454947653", "commentID": 17494773, "userID": 58121350, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17494773}, {"approveDate": "1454952722", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454952722", "permID": "17494856", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "iowa", "parentID": null, "userDisplayName": "mdalrymple4", "commentTitle": "<br/>", "commentBody": "With all of the problems that our country really faces, it has always amazed me that the republicans continually harp on immigration (yet never do anything about it except talk).  They rarely mention education, poverty, high cost of drugs, etc.  And of course they totally ignore the changes in our climate that will continue to cost us billions.  But defunding Planned Parenthood so poor women have no place to go for health checkups and birth control, now that is important.  Also important to republicans seems to be cutting regulations so more of our air and water are polluted.  How do they sleep at night?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454947879", "commentID": 17494856, "userID": 38486245, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17494856}, {"approveDate": "1454952758", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454952758", "permID": "17494881", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kansas", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "Immigration is likely not a threat to those who hold jobs on the Editorial Board of the New York Times, but for millions of Americans who have lost their jobs, are about to lose them, or have taken a big pay cut, rightly or not, it is a real and present danger.<br/>At the very least, the NYT shouldn't belittle working Americans who see their jobs, salaries and benefits disappear or shrink.<br/>It's been my experience that big-city liberals have very little contact with immigrants, legal or illegal, other than hiring them for minimum wage service positions.<br/>They've never had to stand on the factory floor and train someone else to take their job — at a lower wage with fewer benefits, a most discouraging process — before given a pink slip and shown the door after 35 years of loyal service.<br/>I've seen burly, grown men reduced to tears in that situation. Very, very sad.<br/>Go west of the Hudson River, Editorial Board, and explore the very real fears of genuine Americans, many whom are killing themselves in discouragement.<br/>In almost six decades of life in this country, I've never seen my fellow citizens so discouraged, bitter and angry at this unfair system.<br/>It's something the northeast media elite and our rulers, with few exceptions, seem totally ignorant of, which is stunning unto itself. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1454947931", "commentID": 17494881, "userID": 55857668, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17494881}, {"approveDate": "1454952900", "commentType": "comment", "userTitle": "NULL", "updateDate": "1454952900", "permID": "17495185", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "Preying on fear and anger.  I honestly wish it were \"praying\" not \"preying\" - for the common good.<br/><br/>Eight years ago I went to a conference on Community Psychiatry.  An analyst I knew presented slides and a talk.  Afterward, I went up to him privately and said:  \"Either you are channeling the Obama campaign or you're working for it.\"  He admitted to me, privately, that indeed he and others were consultants to the campaign - to Obama.  (I've kept that under my hat.  Till now.)<br/><br/>Many times I have thought about how Obamahas kept his cool.  How he has NOT ginned up or exploited rage and terror.  No drama Obama.  A responsible leader, no matter how many times he's been undermined by GOP obstructionists.<br/><br/>A society does not benefit from the ginning up of rage and terror, or even its milder forms of fear and anger.<br/><br/>It is incumbent on good leaders to bring out the best in us, not the worst in us:  To encourage resilience, patience, compassion.  <br/><br/>The ginning up of fear, of anger, the tolerance of rage or felling some of terror is irresponsible.  And, sadly, the GOP - a supposed party of conservatism - is adept at evoking and manipulation a emotions that cannot really be \"controlled\" once unleashed.<br/><br/>We need more leaders like Obama.  And I know many will disagree with that.  But we need steadiness.  We need self-sacrifice, self-restraint, a recognition of reality, a call to our better selves.<br/><br/>All elections are consequential.  Vote for sanity.  For the common good.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1454948740", "commentID": 17495185, "userID": 32195826, "recommendations": 84, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17495185}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 566, "api_timestamp": "1488822348", "totalReplyCommentsFound": 217, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}