{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 16, "totalParentCommentsFound": 543, "totalEditorsSelectionFound": 17, "depthLimit": 0, "totalRecommendationsFound": 528, "comments": [{"approveDate": "1461805105", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461801505", "permID": "18353770", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 16, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Karen", "commentTitle": "n/a", "commentBody": "Well, no battle plan survives first contact with the enemy.  I think he has layed out his philosophy, not a blue print.<br/> As such, there are things to like.  Aggression as a last resort.  We can't do everything, we need and must demand help.  If NATO is so important why can't our allies pay their dues?  He reiterated the Colin Powell doctrine, which I liked: don't go into something half heartedly.  If spending our blood and treasure is needed, do it right, with the full backing of the country.<br/> If you are willing to do the thing half way, it's a sign it isn't needed at all.  Look at the conflicts of the last five decades.  Using this doctrine, we would have avoided all conflicts, to the overwhelming benefit of our world.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461801349", "commentID": 18353770, "userID": 56486801, "recommendations": 185, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353770}, {"approveDate": "1461805148", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461863265", "permID": "18353774", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Homestead Florida", "parentID": null, "userDisplayName": "Don Shipp,", "commentTitle": "<br/>", "commentBody": "When it comes to Foreign Policy and your the President every word matters, the world is listening. Extempraneous riffs aren't allowed. Trump clearly lacked confidence and was clearly uncomfortable in his speech. He suffers from an irreparable knowledge gap and because of that there is no way he can place things in the right historical perspective or contemporary context. He was simply going through the motions and reading words somebody else wrote. His lack of enthusiasm reminded me of Robert De Niro giving rehearsed testimony in exchange for a plea bargain in a gangster movie. Even the brief smatterings of tepid applause only seemed to highlight his unpreparedness. It is inconceivable that Donald Trump could possess the nuclear codes. It would be an unacceptable risk to our national security", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461801389", "commentID": 18353774, "userID": 18855202, "recommendations": 893, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353774}, {"approveDate": "1461805295", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461853462", "permID": "18353799", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "san francisco", "parentID": null, "userDisplayName": "jefflz", "commentTitle": "<br/>", "commentBody": "The suggestion in this opinion that Trump wants to inappropriately apply his business skills as a tough negotiator to foreign policy. This adds to the perpetual myth that Trump is a actually a successful business man. He is not.  <br/><br/>Trump inherited his father’s business 1974- he was immediately worth about $200M. If he had merely invested this wealth in an ordinary managed fund he would be twice as rich as he is now (Forbes Magazine).<br/><br/>In 1980 he established The Trump Organization to oversee all of his inherited real estate operations. Ten years later In 1990, due to excessive leveraging, The Trump Organization was $5 billion in debt with $1 billion personally guaranteed by Trump himself.<br/><br/>A bailout pact agreed upon in August of that same year by some 70 banks, allowed Trump to defer on nearly $1 billion in debt, as well as to take out second and third mortgages on almost all of his properties.<br/><br/>He repeated near-bankruptcy three more time in the years following. But for the combined and massive effort of all the banks and multiple parties in that 1990 deal and subsequent failures, Trump’s business and Trump would have disappeared.<br/><br/>His newly found handlers can write all the scripts they chose trying to make Trump over as a statesman, but there is no way in earth that we can allow a compulsive gambler like Trump access to the US economy let alone the nuclear trigger", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461801539", "commentID": 18353799, "userID": 52099086, "recommendations": 502, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353799}, {"approveDate": "1461807023", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461804194", "permID": "18353783", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Jamie Stafford", "commentTitle": "<br/>", "commentBody": "This is the exact cause of my recent nightmares. IF by some awful working of the world Donald Trump is elected as president of the United States of America, we may very well be stepping into World War 3. One reason I state this is because the situation in the Middle East is much too precarious for a president to simply say whatever pops into his/her head or \"walk\" from deals with foreign countries. Especially now, we need a leader who is a diplomat. A persona that Mr. Trump cannot even pretend to fulfill.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461801439", "commentID": 18353783, "userID": 73699108, "recommendations": 720, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353783}, {"approveDate": "1461807354", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461863046", "permID": "18353947", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 20, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tecumseh, Michigan", "parentID": null, "userDisplayName": "Charles", "commentTitle": "<br/>", "commentBody": "I don't agree with Mr. Trump on foreign policy, but this editorial fails to clearly identify what is wrong with Trump's ideas.  Implicit in this column is a faith in diplomatic institutions and a diplomatic culture that have by and large failed us.  Trump for all of his failure to comprehend the complexities of the world is right to suggest that we need to get out of our rut and negotiate more forcefully and look for new foreign policy paradigms.  Just because the Times declares that \"putting forward maximal positions that he can walk back\" will not work in foreign policy, does not make it so.  In the final analysis, it is hard to imagine how Trump could do worse than our premature withdrawal from Iraq, our incomprehensible toppling of Qaddafi without a follow-up plan, our drawing red lines and then backing down, our dithering over genocide against Christians in the Middle East, our vacillation in confronting aggression by Russia and China, the deterioration of our relations with close allies, including Israel and Saudi Arabia.  The world is a much more dangerous place, a much crueler place, and much less friendly place for the United States and our values than it was eight years ago.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461802655", "commentID": 18353947, "userID": 71299546, "recommendations": 126, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353947}, {"approveDate": "1461807384", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1461803784", "permID": "18353403:18353957", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Vanessa Hall", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "&lt;br/&gt;", "parentID": 18353403, "userDisplayName": "Tom", "commentTitle": "<br/>", "commentBody": "The United States is not a private enterprise; but, as we have seen this year, the political parties that pick our leaders are.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461802727", "commentID": 18353957, "userID": 19971751, "recommendations": 255, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353957}, {"approveDate": "1461807478", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461803878", "permID": "18353948", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "West Hartford, CT", "parentID": null, "userDisplayName": "Jeremy Mott", "commentTitle": "<br/>", "commentBody": "Trump and the Republicans in Congress will lead us into war, not by intention but through ignorance.  They feel aggrieved, and they're determined to make someone pay.  They will gladly sink our ship of state in their efforts to look strong and to lash out at those who challenge them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461802660", "commentID": 18353948, "userID": 37559218, "recommendations": 609, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18353948}, {"approveDate": "1461807552", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461803952", "permID": "18354005", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Norwalk, CT", "parentID": null, "userDisplayName": "historylesson", "commentTitle": "<br/>", "commentBody": "Never, ever been so thoroughly scared. Pretty scared by Goldwater and his low yield nuclear weapons in Vietnam, and \"extremism in the defense of liberty is no vice,\" but Trump takes fear to a whole new level.<br/>He is utterly unqualified to be president of the United States.<br/>To watch and listen to \"republican strategists\" twist and turn and, as usual, shout, to transform him into a qualified candidate is sickening.<br/>His foreign policy speech was an insult to the people of our country, and to our allies.<br/>He has no foreign policy, or domestic policy. He is slogans and insults.<br/>He has no idea how to conduct himself as a candidate, let alone a president with access to our nuclear codes.<br/>He will turn the election into a barrage of vicious personal insults at Secretary Clinton. No policy. No thought. No intellect. A loudmouth cipher.<br/>The thought of listening to him insult and demean a former First Lady, two term senator from New York, former secretary of state, and Democratic nominee for president is simply appalling. I don't think I can bear it.<br/>Can any of you?<br/>Whatever one thinks of Clinton's policies and performance, however much one may disagree with her on several, or many points, she is qualified to be president. She will reassure our allies, who are panicking. She will reassure me, who is panicking.<br/>I'm not afraid for of her carrying the football.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461803098", "commentID": 18354005, "userID": 47229657, "recommendations": 1628, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354005}, {"approveDate": "1461807605", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461804005", "permID": "18354018", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new Jersey", "parentID": null, "userDisplayName": "Babel", "commentTitle": "<br/>", "commentBody": "\"It did not exhibit much grasp of the complexity of the world, understanding of the balance or exercise of power, or even a careful reading of history.\"<br/><br/>For the average rural Republican with a low education it sounded just right.  Increase our military spending, kick ISIS butt, and tear up trade deals with China.  To this type of voter the solution is simple. The U.S. just has to re-establish itself as the power it was after World War II.  It is as uncomplicated as that.  When you make America great again everybody falls in line.  To their way of thinking, Trump scored big in real estate; what else does he have to prove.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461803249", "commentID": 18354018, "userID": 48307985, "recommendations": 522, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354018}, {"approveDate": "1461807626", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461804026", "permID": "18354011", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "AK", "parentID": null, "userDisplayName": "Don Shaker", "commentTitle": "<br/>", "commentBody": "Trumps foreign policy speech was bizarre, little more than a montage of sound bites from stump speeches and phone  interviews he's given over the last year. To the extent that there was anything new, anything specific, it did not come from the mind of Trump. He couldn't even bother to learn the correct pronunciation of Tanzania. Each every policy goal Trump proffered was followed by another that contradicted it. He confirmed to all but his supporters that he is unqualified to be President. He is a national embarrassment and his election would be dangerous to our country.  I am a conservative independent with a long list of reasons to find Hillary Clinton objectionable but I will have no trouble offering her my support and vote should Trump be the nominee.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461803143", "commentID": 18354011, "userID": 42690081, "recommendations": 796, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354011}, {"approveDate": "1461807767", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461863038", "permID": "18354081", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Bill Delamain", "commentTitle": "<br/>", "commentBody": "Lots of comments try to ridicule Trump, saying that he's crazy, a fascist, unqualified, a shame for the country and so on. I hate to break it to you folks but the guy is winning the Republican race with huge margins - margins that HRC doesn't have. He is much more popular than she is. I think there is a need at this time to come up with something a little more effective that calling him crazy and unfit for office over and over because that's not working. You've been doing that since last year without success. It is time to change your strategy and come up with something more effective if you don't want to find yourself with President Trump next year. That goes to the EB - saying that he doesn't know about the world is not going to put a dent in his popularity -stop wasting your time and do something useful now. As time passes he will get better at looking fit for office and it will be too late then. So please no more Strange world view articles - by the way, many of your readers think your own views are pretty strange too, and often contradictory.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461803728", "commentID": 18354081, "userID": 2312585, "recommendations": 97, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354081}, {"approveDate": "1461807774", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461804174", "permID": "18354156", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jersey City", "parentID": null, "userDisplayName": "SteveS", "commentTitle": "<br/>", "commentBody": "This is not really about Trump; he is what he is.<br/><br/>It's about the Republican party which has abandoned any claim to legitimacy by misrepresenting reality and treating Trump, Cruz, Carson, Rubio, Santorum and many of the others as legitimate candidates for the presidency; and it's about the American voters who are ignorant enough to vote for him.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461804386", "commentID": 18354156, "userID": 547542, "recommendations": 1177, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354156}, {"approveDate": "1461831348", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461827748", "permID": "18354294", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Port Neches", "parentID": null, "userDisplayName": "Jesse Marioneaux", "commentTitle": "<br/>", "commentBody": "George Washington would be horrified to see where our foreign policy has taken us today. We have acted in line with everything he warned against and it has made us the most meddling and anger-provoking nation since the British Empire. What he didn't foresee was how military success in defense of our very real interests -- in WW II -- could become both heroic and addictive. Teddy Roosevelt's \"big stick\" morphed into a controlling mandate -- abetted by the military/industrial complex of Eisenhower's nightmares -- to act as the world's policeman and authority figure. We are appropriately loved and hated in that role, for we have allowed ourselves to employ our power -- even when it is for good -- like an \"over-zealous\" cop who shoots unarmed civilians because he believes them to be a threat.<br/><br/>Unfortunately, until the global community stands together in the same fashion as communities in Michigan and Missouri have done, and demands that we rein in our drones and guns and soldiers, we -- including our President and Congress -- are unlikely to change anything. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461805331", "commentID": 18354294, "userID": 70197753, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18354294}, {"approveDate": "1461859007", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461862577", "permID": "18361320", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Jose, CA", "parentID": null, "userDisplayName": "Graham K.", "commentTitle": "<br/>", "commentBody": "This was a great speech, and it represented both a commitment to the nationalistic and citizen centered policies that Trump has been advocating, and a departure from foreign policy as we've known it. <br/><br/>Let's face the facts; the post war international and globalist order hasn't been working for us. On the military front we've wasted blood and treasure in far flung parts of the world, and when it came to closing the deal and reaping some small reward for our sacrifices, our political leaders always held back because they were fearful of the political consequences. And so we ceded Vietnam, we failed to neutralize Saddam Hussein after the first gulf war, and we prematurely abandoned the field in Iraq and Afghanistan. And our commitments just short of war have been all but feckless; toppling Libya but not cleaning up the mess, ditching Egypt, and cutting bad deals with enemies like Iran and Saudi Arabia. <br/><br/>And what does Hillary Clinton offer? Some dumb and empty platitudes about \"smart power.\" Oh my, what a bold choice! Is it any wonder why members of the military overwhelmingly favor Trump? <br/><br/>The economic front has been no better; CEO's and shareholders win, and diplomats and Presidents looking for legacy deals have won, but the American worker most certainly hasn't. <br/><br/>I get that many on the left are outright hostile to their own country. That they blame it, they're ashamed of it, and ignorant of it's history. But to me, putting  America First is refreshing and authentic. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461851689", "commentID": 18361320, "userID": 69089999, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18361320}, {"approveDate": "1461859196", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461855596", "permID": "18358162", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WELLINGTON, NEW ZEALAND", "parentID": null, "userDisplayName": "STAN CHUN", "commentTitle": "<br/>", "commentBody": "If you are going to be President of the United States there is one important thing you need and that is an apprenticeship in politics and diplomacy.<br/>Many politicians take years to develop their international knowledge of people, religions, knowledge of who are the important players etc and you cannot simply have someone write an instant brief on how to run the world the US way. This has been tried for years and many wars and situations have been lost due to lack of understanding important factors, factors that have been learned by the experienced.<br/>A world according to Donald may sound good to his followers but that is electioneering not diplomacy or leadership.<br/>Simplistic answers and solutions without real experience will put the US and the world in a dangerous place because the wolves that are out there will be just waiting to pounce on this new guy who may learn that force does not resolve every issue and some people shoot back.<br/><br/>STAN CHUN<br/>Wellington<br/>New Zealand<br/>28 April, 2016.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461835451", "commentID": 18358162, "userID": 68273915, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18358162}, {"approveDate": "1461859227", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461855627", "permID": "18358305", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bronx, NY", "parentID": null, "userDisplayName": "Cjmesq0", "commentTitle": "<br/>", "commentBody": "Not not a big fan of Trump. But his TelePrompTer speech wasn't bad. <br/><br/>About time we put America first. Our foreign policy must be good for America. And if we go to war, we fight to win. We don't  fight to nation-build. We don't fight politically correct for 13 years. We fight. We win. Decisively. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461837662", "commentID": 18358305, "userID": 17222320, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18358305}, {"approveDate": "1461861629", "commentType": "comment", "userTitle": "NULL", "updateDate": "1461858029", "permID": "18361426", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Oakland, CA", "parentID": null, "userDisplayName": "Gary Valan", "commentTitle": "<br/>", "commentBody": "My eyes glaze over when I read this type and other \"serious\" analyses and opinion from experts on Trump's worldview and how he might shape foreign policy if he becomes President.  Foreign policy experts, just like economists are ready to share their opinion even if you just wake them up and ask a question.<br/><br/>After \"W\" and his so-called serious gang o' experts (really lets call them by who they really were - thugs) tried to reshape the Middle East in their vision of how that part of the world will just shape up. Look at the mess they made and the continuing disaster in the area. Most every expert either supported them or stayed mum. Except for a few strong politicians who protested. So anytime I hear or read expert opinions, I look for my 50 lb bag of salt to throw over my shoulder.<br/><br/>I am no expert in world history but how many \"experts\" from Great Britain and France re-shape the Middle East and redrew the borders? Was it just Mark Sykes and Francois Picot? or a handful of politicians who backed them up? Their \"gift\" or meddling kept on giving to this day. When Mountbatten drew the Radcliffe line, the border between India and Pakistan, backed by a few retrograde British Pols just how many took part in the decision? Again that's a \"gift\" that gives to this day.<br/><br/>So NYT and the \"experts\" should just go fishing and not their undies in a bunch, lets wait till Trump gets his political house in order. Meanwhile Look at Hillary's record, that should worry at least a few \"experts\".", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1461852042", "commentID": 18361426, "userID": 69051045, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18361426}], "totalEditorsSelectionReturned": 17, "replyLimit": 3, "totalRecommendationsReturned": 17, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 896, "api_timestamp": "1488822350", "totalReplyCommentsFound": 353, "totalCommentsReturned": 17, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}