{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 15, "totalParentCommentsFound": 282, "totalEditorsSelectionFound": 15, "depthLimit": 0, "totalRecommendationsFound": 355, "comments": [{"approveDate": "1481954886", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481991261", "permID": "20834041", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Corvallis, Oregon", "parentID": null, "userDisplayName": "Philip S. Wenz", "commentTitle": "<br/>", "commentBody": "\"…further eroding America’s role as an honest broker.\"<br/><br/>Well, it's not so clear America has been an \"honest broker.\" We've armed Israel to the teeth and only given lip service to condemning the West Bank occupation and settlements and other racially and religiously motivated provocation of the rightist Israeli government. Someone once described Israel as America's aircraft carrier in the Middle East…could oil have anything to do with that?<br/><br/>Trump is a belligerent man and a bully. This approach to life and relationships has gotten him far, as he has surrounded himself with other belligerent men and yes-men to do his bidding and stroke his ego. <br/><br/>This appointment is no different. <br/><br/>But what Trump and the Trumpistas will learn is that what goes around comes around — likely sooner rather than later. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3174/0333/cropped-31740333.jpg?0.9480581504758447", "createDate": "1481954825", "commentID": 20834041, "userID": 31740333, "recommendations": 402, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834041}, {"approveDate": "1481967845", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481991233", "permID": "20834445", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Christine McM", "commentTitle": "<br/>", "commentBody": "I continue to be amazed – well amazed might not be the right word --at how many appointments Donald Trump is making that seem to reflect his own image.<br/><br/>Lack of government experience. Extreme viewpoints. Polarizing personalities. A penchant for reckless, often fictional statements.<br/><br/>it's as if he is hiring a whole slew of mini me's. A bankruptcy lawyer? For a post that requires finesse and the utmost delicacy? The choice is as bizarre as Flynn for national security advisor or Rex Tillerson for Secretary of State.  <br/><br/>The world is full of hotspots, none hotter than Israel. Mr. Friedman is promising to go into the post guns a blazing, almost daring israel's fiercest opponents to respond likely with violence.<br/><br/>We already know that Donald Trump loves surprises and controversy. But those two qualities, which may play well in a dealmaking field like real estate, are the last thing an angry, unstable world needs right now.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2073/520/cropped-2073520.jpg?0.18587254704312467", "createDate": "1481967784", "commentID": 20834445, "userID": 2073520, "recommendations": 470, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834445}, {"approveDate": "1481972993", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481991321", "permID": "20834679", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Grand Rapids, MI", "parentID": null, "userDisplayName": "Gordon Alderink", "commentTitle": "<br/>", "commentBody": "Frankly, the US Israeli policy has been disingenuous for decades, which is why all efforts to bring justice to Palestinians has failed.  Trumps choice, if approved, would confirm to me US intentions all along (let Israel take it all).  Trump's choice is just another indication of his ignorance and hubris.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481972674", "commentID": 20834679, "userID": 47617496, "recommendations": 234, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834679}, {"approveDate": "1481978229", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481991292", "permID": "20835152", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "North Carolina", "parentID": null, "userDisplayName": "Michael", "commentTitle": "<br/>", "commentBody": "At a time of relative peace, increased financial stability, job recovery, leveling off of unemployment, more widespread health care, and improved US standing around the world, Trump is clearly pursuing a strategy of disruption, tossing out convention, intent on doing the opposite strictly for opposite's sake.  Quite a spectacle, makes for a really big show.  What could possibly go wrong?  I'm thinking maybe chaos, leading to war, accompanied by financial meltdown.  Bigly.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481978168", "commentID": 20835152, "userID": 54615828, "recommendations": 313, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20835152}, {"approveDate": "1481984571", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481984571", "permID": "20833914", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Turkey", "parentID": null, "userDisplayName": "J.", "commentTitle": "<br/>", "commentBody": "This is only the latest of ALL of Trump's cabinet appointments that make me ill, really ill with disgust and a terrible fear for what will become of all of us.  At this point, I'm rendered nearly speechless, except to speak on the personal:<br/><br/>I have Trump voters in my own family, and it is getting increasingly difficult not to see *them* as the perfect enemies of patriotism, progress, and humanity.  For example, my aunt -- who moved to a rural area because her neighborhood was getting \"too black\" -- apparently the nearby luxury mall was getting too integrated for her.  She tells me that she's afraid of Muslims, and although I have lived in Turkey for nearly ten years, she has not asked me one question, not ONE, in all that time, about my scary scary friends, colleagues and neighbors here.<br/><br/>Too many Americans are intellectually lazy, incurious and uninterested, and they have forced upon us the venal, selfish and downright monstrous (I include that demure-looking blond in the photo, who shills 10K bracelets on the strength of this impending disaster).<br/><br/>I would bet that the Trump voters I know are paying zero attention to these cabinet appointments, now that they have \"won.\"  But I say -- Look what you have done to us.  Look what you have done to us.  Look what you have done to ALL of us.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481952537", "commentID": 20833914, "userID": 67839850, "recommendations": 258, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20833914}, {"approveDate": "1481984601", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481984601", "permID": "20833950", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Turkey", "parentID": null, "userDisplayName": "J.", "commentTitle": "<br/>", "commentBody": "So this is how the average American wants to \"shake things up,\" eh?  Drinking his coffee in some mid-western diner over the Sunday paper, passing over stories about the Israeli-Palestinian conflict because, hey, it's always in the news, and anyway, we should just bomb the Middle East to glass and then the problem would be solved.<br/><br/>Yeah, yeah, I've heard it all before.<br/><br/>The whole process since November 8th makes me sick.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481953087", "commentID": 20833950, "userID": 67839850, "recommendations": 157, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20833950}, {"approveDate": "1481984685", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481984685", "permID": "20833998", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Francine Rosemberg", "commentTitle": "<br/>", "commentBody": "I agree completely with your editorial.  This decision by Mr. Trump only confirms what we have learned from his choice of cabinet members:  Mr. Trump is a provocateur who gives very little attention to the possible consequences of his actions.  His decisions are made in ignorance of the past and denial of factual information and seemingly to his benefit and that of his close supporters, not even that of the people who voted for him.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481953950", "commentID": 20833998, "userID": 25129652, "recommendations": 119, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20833998}, {"approveDate": "1481984931", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481984931", "permID": "20834084", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salt Lake City, Utah", "parentID": null, "userDisplayName": "Andrew G. Bjelland, Sr.", "commentTitle": "<br/>", "commentBody": "Mr. Trump is a showman and entertainer. He is also an artist of the deal. It is best to never lose sight of these facts.<br/><br/>I am beginning to think Mr. Trump's personnel appointments are emotive gestures, rather than appointments to be evaluated with references to external standards of appropriateness whereby one might judge an appointee as fit or unfit for the designated office. These gestures are designed to elicit what Mr, Trump deems to be the desired emotional and appetitive response from his target audience.<br/><br/>Similarly, it is probably an error to catch out the President elect in what appear to be falsehoods. Most of his statements--even those that appear to be descriptive and which many have rejected as demonstrably false--are better interpreted as emotive utterances, not factual claims. <br/><br/>Mr. Trump's overarching purpose is to simply feed off of, and then reinforce or modify, the emotions of whatever individual or group he happens to be interacting with at any given time. He uses language primarily to manipulate people's emotions. His chief end-in-view is to elicit emotional support whereby he is enabled to achieve his own ends. Facts and truth mean very little to him, and are irrelevant to his purposes and desires.<br/><br/>Are there occasions when this soon-to-be American President will have to speak the truth and establish bonds of trust? If so, will Mr. Trump be able to successfully fake truth-speak and trust-bonds?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481956078", "commentID": 20834084, "userID": 58063917, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834084}, {"approveDate": "1481985453", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481985453", "permID": "20834322", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Petaluma CA", "parentID": null, "userDisplayName": "David Keller", "commentTitle": "<br/>", "commentBody": "Mr. Trump's proclivity and comfort with causing and embracing chaos, and unceremoniously throwing established policy and agreements to the wind continues again, now with the nomination of someone eminently unqualified and inexperienced to handle this most sensitive ambassadorship to Israel.<br/><br/>In a series of such nominations to his cabinet, and now as ambassador to Israel, Trump fails - deliberately and apparently in blissful ignorance, without second thought or serious consultation - to lessen conflict and the darkening clouds across our nation and the globe.<br/><br/>It is becoming clear that his use of the United States for a precarious game of The Apprentice, in which he runs the circus for his own benefit, is further and further out of hand and endangering of our future as a successful global leader and example of rational and considered democratic process.<br/><br/>I am no less fearful of our future than I was yesterday, or the day or week before.  I still await even one carefully considered and considerate appointment, tho' I am no longer hopeful that will appear.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481964148", "commentID": 20834322, "userID": 6694190, "recommendations": 85, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834322}, {"approveDate": "1481985872", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481985872", "permID": "20834415", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "not from the US", "parentID": null, "userDisplayName": "A.Y", "commentTitle": "<br/>", "commentBody": "As a center-left Israeli I maintain that the nomination of Friedman for ambassador will change nothing for better or worse. The only way to advance this miserable \"peace process\" was for the West to put massive pressure on both parties, but mainly on Israel. American presidents never had the nerve to do so out of fear of losing the richly donating Jewish voters in the endless cycle of general and mid-term elections, which, during decades, paralyzed any initiative by any administration. Netanyahu knows this very well and this is why he has no problem embarrassing the US president time and again, and keep building in the West Bank, laying more and more land mines under any potential agreement, all this to appease his coalition parties voters. <br/><br/>On the Palestinian side there is no leader who has the courage or the political support to reach a deal which will be acceptable to Israel. So, the blame game is played for ever to a world's yawning audience who is sick of the Middle East as a whole and of the Israeli-Palestinians \"peace process\" in particular. <br/><br/>This decades long stalemate is at the root of the tremendous weakness of the Israeli center left. No one believes in peace any more. Even worse, hardly anyone cares.<br/><br/>In this atmosphere, ambassador Friedman, another extreme-right, reactionary Jewish zealot, will have no effect for better or worse.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481966948", "commentID": 20834415, "userID": 65729557, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834415}, {"approveDate": "1481986524", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481986524", "permID": "20834831", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Steven Roth", "commentTitle": "<br/>", "commentBody": "I come at this a bit differently. <br/><br/>Just as president Reagan, who considered the Soviet Union an \"evil empire,\" was able to make peace with Gorbachev and end the Cold War, and just as Prime minister Menachem Begin of the right wing Likud party was able to make peace with President Sadat of Egypt, perhaps Trump and Friedman can bring about a peaceful settlement between the Israelis and Palestinians. <br/><br/>Perhaps someone aligned with the right wing Israeli government can accomplish more than one who is antagonistic to the Israeli government. <br/><br/>Of course this hinges on a willing participant on the Palestinian side, which thus far, has been elusive.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481974811", "commentID": 20834831, "userID": 63373004, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20834831}, {"approveDate": "1481989494", "commentType": "comment", "userTitle": "NULL", "updateDate": "1482173456", "permID": "20835952", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "El Paso, Tx", "parentID": null, "userDisplayName": "Harry", "commentTitle": "<br/>", "commentBody": "One of the main reasons for Trump's surprise victory is that a large portion of Americans are fed up with  political correctness as well as the lies and distortions fed to them by the leftist elite. One of these is false narrative that the Palestinians want peace with Israel. Any reasonable interpretation of history shows the complete opposite. All Israeli concessions including the Oslo Accords and the Gaza Withdrawal have been answered by more violence and terrorism.  Actual offers of peace by Israeli Prime Ministers to give the Palestinians what they purport to want have been rejected or ignored. The Palestinians will never under any circumstances sign an agreement recognizing Israel. Crisis management and the status quo are the best that can ever be accomplished. Mr. Friedman like Trump speaks the truth and is the perfect man for this position.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481983460", "commentID": 20835952, "userID": 8235244, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20835952}, {"approveDate": "1481989757", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481989757", "permID": "20836185", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boylston, MA", "parentID": null, "userDisplayName": "Potter", "commentTitle": "<br/>", "commentBody": "There are those who suggest with false hope that the make-things-worse-before-they-can-get-better approach will work. So when has that worked?<br/><br/>Palestinians have suffered great losses for a viable state of their own and for long years. They are steadfast and will not give up unless they are offered instead full equality, full citizenship, agreeing to live in one state. That would be a challenge for some Jews ( on the right) to accept. Barring those offers, either one (and Israel holds the cards, make no mistake) Israel will continue to be a security state that fewer and fewer Jews will want to live in or can identify with. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481984863", "commentID": 20836185, "userID": 65618206, "recommendations": 27, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20836185}, {"approveDate": "1481990531", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481990531", "permID": "20836545", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new york", "parentID": null, "userDisplayName": "sam hafif", "commentTitle": "<br/>", "commentBody": "I disagree with the editors definition of Friedman as a \"dangerous\" choice. we know the NYT position clearly and consistently ostracizes Israel's political and national objectives. this is nothing new. However, fanning the flames of fear and anger should never be a strategy of an editorial board of a global publication. <br/><br/>Yes, our incoming administration has a right wing agenda and will naturally support Israel's right to defend its borders, strengthen its economy and develop the countries infrastructure. Settlement expansion and development is an integral part of those initiatives for over 50 years. Those settlements are not settlements. They are vibrant successful communities of families, living in very close proximity to Arab communities, also full of families looking to live successful lives. <br/><br/>Any two state solution will ultimately have to deal with how to create a peaceful state of coexistence, or it will fail. <br/><br/>No amount of strong arm tactics, violent or political rhetoric, or political pressure from foreign governments will change that reality. We might as well start figuring out how to live together side by side in peace and harmony from now. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481986783", "commentID": 20836545, "userID": 68466258, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20836545}, {"approveDate": "1481990703", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481990703", "permID": "20836553", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ontario via Massachusetts", "parentID": null, "userDisplayName": "Purple State", "commentTitle": "<br/>", "commentBody": "While I find Friedman's views reprehensible, the two-state solution is no longer a viable option for peace, and it's long past time for the West's leaders to stop perpetuating the farce that somehow a healthy Palestinian state will be created on the fragmented land left for it after decades of Jewish settlement. <br/><br/>Friedman is not the person to bring new ideas to the search for a solution to this decades old and seemingly intractable problem, but someone must.  If there is any silver lining to this appointment, maybe it wil be the injection of a mote of honesty into a discussion that has for decades been nothing more than a convenient fiction providing cover to those on the Israeli right who want to preserve the status quo of slowly strangling Palestine. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481986819", "commentID": 20836553, "userID": 37617930, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20836553}], "totalEditorsSelectionReturned": 15, "replyLimit": 3, "totalRecommendationsReturned": 15, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 404, "api_timestamp": "1488822348", "totalReplyCommentsFound": 122, "totalCommentsReturned": 15, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}