{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 1264, "totalEditorsSelectionFound": 27, "depthLimit": 0, "totalRecommendationsFound": 1055, "comments": [{"approveDate": "1480407122", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431401", "permID": "20634998", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bloomington, Indiana", "parentID": null, "userDisplayName": "Joe Ryan", "commentTitle": "<br/>", "commentBody": "It's not just that less populous states have more Electoral votes per voter.  After all, in a close race, the marginal voter (who could be anyone) delivers 55 Electoral votes in California and only 11 Electoral votes in Indiana.<br/><br/>It's that there are unit rules by state and the popular vote may be close in some states and not in others.  It was not so close in 2016 in many states with big urban centers, which are more populous states overall.  However, the balance of the Electors in 2016 was decided by marginal voters in states with unit rules and close elections: Pennsylvania, Wisconsin, and Michigan. None of these is a small state.<br/><br/>That pattern may continue.  But while within states you can try to create this situation through gerrymandering Congressional districts, you can't shift state borders this way to gerrymander the Electoral College.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480383115", "commentID": 20634998, "userID": 12524242, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20634998}, {"approveDate": "1480407203", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480407203", "permID": "20635011", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Silence Dogood", "commentTitle": "<br/>", "commentBody": "I get the eerie feeling that as we go forward through the next four years the Presidential news of the moment will sound more like a daily report from E Entertainment or Inside Edition.<br/><br/>And yet this is the President-elect of the United States mooning on social media like some teenager or would be celebrity.  His ignorance of our government and our history as a nation is without precedent and apparently those who voted for him simply do not care.  No good will come from this.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480383187", "commentID": 20635011, "userID": 65416083, "recommendations": 1113, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635011}, {"approveDate": "1480407300", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431383", "permID": "20635019", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cordova, Alaska", "parentID": null, "userDisplayName": "Andrew Smallwood", "commentTitle": "<br/>", "commentBody": "If the Mr. Trump is so sure that 3 million illegal votes were cast that he is willingly to say so publicly, then surely he must be aware that this invalidates this election. That being the case then, he is obligated to call for a recount and so is Secretary Clinton.<br/> If Mr. Trump has compelling evidence that wrongdoing on such a scale exists and he takes no formal steps to bring the malefactors to light then he is also complicit in a crime.<br/>On the other hand, if he simply made this up or is telling a lie, as the NYT suggests, then the nature of the announcement and particularly its timing show Mr. Trump to be a fool.<br/> However, because he is the President Elect, I think we owe Mr. Trump the benefit of the doubt and that his accusation that 3 million invalid votes were cast should be taken seriously and acted on by the relevant authority.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480383222", "commentID": 20635019, "userID": 34283299, "recommendations": 768, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635019}, {"approveDate": "1480407382", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480407382", "permID": "20635049", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Worcester, MA", "parentID": null, "userDisplayName": "Matt", "commentTitle": "<br/>", "commentBody": "It's becoming exhausting trying to continue to call out Donald Trump for every single nonsensical, factually untrue, and misleading statement he makes. We are now living not too far from Orwell's 1984, where doublespeak has become the language of our leader. And while some in media are saying \"don't take him literally,\" the problem with that line of thought is that it reduces the power and value of words.<br/><br/>Words are mans greatest creation, with language being the single unifying thread connecting all of history, from its horrors to its crowning achievements. The moment we stop saying that words are of the utmost importance is the moment we throw in the towel on facts, reason, and truth. If that happens, then we regress to being no better than the caveman.<br/><br/>Trump has clearly demonstrated that he is an individual without any regard for facts or for nuance, and that he likely himself doesn't take what he says too seriously. But he will soon be in a position where everything he says will be interpreted by our enemies and allies as serious statements. <br/><br/>For this reason, while it is going to be exhausting and near normalizing in reporting it almost every day, papers such as this one must, with large bold letters, continue to be vigilant (without succumbing to the bias of the media), against the attack on language, thought, reason, and facts.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480383443", "commentID": 20635049, "userID": 61385212, "recommendations": 1144, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635049}, {"approveDate": "1480412033", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480412033", "permID": "20635268", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "JK", "commentTitle": "<br/>", "commentBody": "Thank you NYT. This article is fair, fact-based, informative and, as an editorial, has  chosen its words - especially its descriptors - with great accuracy and precision. Appropriate in every choice from \"lies\" onward. Many may share my exhaustion of desperation as these post election weeks litter our political landscape with Trumpian tv reality suspense, but one thing remains absolute truth:  we must protect the freedom of our mainstream responsible media and press, encourage and appreciate your ceaseless coverage and transparency of facts, and resolve to do everything and anything to preserve our Constitutional freedoms and American values as individual citizens. As much as there is to protect from the hijackers of our country, there is everything to loose. The tipping point for action has come.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3519/0630/cropped-35190630.jpg?2055233121988253166", "createDate": "1480384793", "commentID": 20635268, "userID": 35190630, "recommendations": 641, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635268}, {"approveDate": "1480412498", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431415", "permID": "20635365", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Hampshire", "parentID": null, "userDisplayName": "Carden", "commentTitle": "<br/>", "commentBody": "Trump said that there was rampant voter fraud in New Hampshire.  This is a state where the Democratic candidate for Senator, Maggie Hassen, defeated the Republican, Kelly Ayotte, by under 1,000 votes.  Kelly Ayotte is not stupid; if there were significant voter fraud here, she would have demanded a recount.  But she knows that New Hampshire is tight on voting and there is no chance that she would win a recount.  Trump obviously just continues to make things up, and does not care who he offends or demeans.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480385336", "commentID": 20635365, "userID": 46725546, "recommendations": 537, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635365}, {"approveDate": "1480412756", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480439892", "permID": "20635395", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "john s.", "commentTitle": "<br/>", "commentBody": "In case you haven't noticed, Donald Trump has told many, many lies and gotten away with all of them. His biggest lie was about President Obama and the \"incredible\" secret things that Trump's investigators had found out about Obama in Hawaii. None of these secrets were ever revealed.  <br/><br/>When Trump figured out that the media would let him continue to lie without any consequences, he kept doubling down. So it's no surprise that he is telling this latest lie about massive voter fraud, as it should be no surprise in the future when he lies about Russia not invading more Eastern European countries, or that Mexico has agreed to pay for the wall, or that China has agreed to everything he asked for, or that ISIS has been defeated. <br/><br/>All of these future lies will be easily disproven by the facts, but as long as his supporters still believe him, and as long as a Republican Congress supports him, none of it will matter.  Welcome to Trumpworld, where the facts don't matter,  only his latest tweets do.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480385518", "commentID": 20635395, "userID": 65021596, "recommendations": 918, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635395}, {"approveDate": "1480421477", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431936", "permID": "20635728", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Flyover Country", "parentID": null, "userDisplayName": "Reality Based", "commentTitle": "<br/>", "commentBody": "Trump suckered the media for most of his campaign, making one outrageously false statement after another, and getting legitimate news outlets to act as his megaphone in presenting these lies. Thus we have \"President-elect Trump\", making a complete mockery of American democracy.<br/><br/>It is too late to undo the damage. But editorials like this may at least send the message that his free ride is over.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480387675", "commentID": 20635728, "userID": 42487046, "recommendations": 623, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635728}, {"approveDate": "1480427828", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480439844", "permID": "20637198", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "MNW", "commentTitle": "<br/>", "commentBody": "The final sentence says it all:<br/>\"But if he’s truly worried about the legitimacy of the 2016 election, why doesn’t he call for a recount?\"<br/><br/>Trump will not call for a recount to prove his fanciful statement because he knows he will lose if a recount takes place.<br/><br/>Trump's current tactic of screaming foul by way of saying that \" I won the popular vote if you deduct the millions of people who voted illegally\" is his prevaricating way of trying to prevent any possible recounts in  Wisconsin, Michigan, and Pennsylvania that are currently being promoted by Jill Stein of the Green Party.<br/><br/>Trump's effort to confuse, obstruct, obscure, and distract attention from the above noted recounts indicates that he fears the outcomes of such recount actions.<br/>He knows that such recounts could very well prove that he did not win in those critical states.<br/><br/>There is the conjecture that the election of Trump was hacked.<br/>An examination of the system analysis and the software developed to implement the compilation of voting results should be thoroughly examined for malware and malicious intent.<br/><br/>Trump decided to run for president to the surprise of the world at large. Did he do so because he knew he would win.<br/>His entire outrageous/offensive campaign, his demeaning attitude toward many groups of persons, his blatant over-confidence and swagger was possible because he knew he would win.<br/>\"Rigged\" he said. Yes, for himself.<br/>Q.E.D.<br/>This verification task is important for future election certainty.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480403552", "commentID": 20637198, "userID": 49069088, "recommendations": 169, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20637198}, {"approveDate": "1480427926", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480431930", "permID": "20635285:20637238", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Matthew Carnicelli", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Europe", "parentID": 20635285, "userDisplayName": "Red Lion", "commentTitle": "<br/>", "commentBody": "Indeed. Perhaps the best we can hope for is that he is bad enough to destroy the GOP for a generation or so (and thus begin to take their institutional racism, misogyny, homophobia and pandering to religious fanatics out of the system), but not so bad as to wreck the country forever -- or to be impeached and removed from office. (I'd still prefer the incompetent narcissist Trump to the competent theocrat Pence, although if the Republicans in Congress want to impeach him but have his leathery skin saved by a vote or two -- perhaps Democratic ones -- that would be all right. Geld the monster but do not kill it.)<br/><br/>Regardless, it will be ghastly. And someday, America will have to reckon with electing a wilfully ignorant incompetent who loathes most of humanity.<br/><br/>And someday, I hope, the country will reckon with having an electoral system that elects the most powerful office on the planet through an archaic 18th-system designed to protect slave-owning white males, that it has a partisan Supreme Court that has wilfully permitted money to pervert the system to the extent that it is de facto little more than bribery, and that the party of Lincoln has deliberately pursued  a strategy of voter suppression to cling to power.<br/><br/>It is perhaps reasonable to believe there are swamps to be drained. Sadly, this man clearly wants only to fill them with his own fetid muck. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/7241/cropped-47127241.jpg?0.9181589698418975", "createDate": "1480404371", "commentID": 20637238, "userID": 47127241, "recommendations": 361, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20637238}, {"approveDate": "1480428147", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480428147", "permID": "20637098", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle", "parentID": null, "userDisplayName": "hyp3rcrav3", "commentTitle": "<br/>", "commentBody": "If there is voter fraud it is because Republicans used voter suppression in every way they could.<br/>They used Cross Check which purged a half million of Michigan voters from the rolls. If someone purged arrived to vote, they would be given a provisional ballot. Their vote probably would not be counted unless there was a hand recount. Michigan is planning to deny a hand recount.<br/>Michigan has shown disdain for the law before. When creating the emergency managers, the GOP fast tracked the bill without the required 2/3rds of the vote. These Radical Republicans simply ignored the Democrats complains about the rule of law.<br/>What would Governor Snyder gain by blocking hand recounts? They are paid for by Dr. Jill Stein of the Green Party USA with crowd-sourced money.<br/>Wisconsin is trying to deny Dr. Stein and other interested parties a hand recount. They want to use the same machines in question to recount the votes. This denies those voters their Constitutional Right to representation. So I ask, what does Governor Scott Walker have to hide that Wisconsin doesn't want to do manual recount? Four precincts in Wisconsin have already had to lower their totals for Trump as irregularities have been found. Is this systemic? Only a hand count can show us.<br/>Pennsylvania should be a hand count as well. Computer experts have discovered problems. We should not be using the machines in question.<br/>We shouldn't be looking for Russian hackers, we should be looking at the GOP.  Ohio 2004 was precedent.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1789/1535/cropped-17891535.jpg?0.5032941391647636", "createDate": "1480401478", "commentID": 20637098, "userID": 17891535, "recommendations": 278, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20637098}, {"approveDate": "1480428180", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480439885", "permID": "20636659", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Helena, MT", "parentID": null, "userDisplayName": "LW", "commentTitle": "<br/>", "commentBody": "I'm no expert in American history, but if the purpose of the Electoral College is to protect the nation from demagogues who win the popular vote through lies and manipulation through the low passions of anger and fear, then this is exactly what our Founders had in mind. Except that Trump didn't even win the popular vote. The grounds for denying Trump an Elector's vote could include conflicts of interest (emoluments clause of the Constitution) that he shows no willingness or ability to remedy, threats against his political opponent (jail, the \"second amendment people\"), encouragement of a foreign government to interfere with the election, advocacy of war crimes (torture, killing family members of terrorists), advocacy of religious discrimination, threats against a free press, and so on. I believe these are all matters of wrongdoing on Trump's part. His emotional, moral and intellectual competency may be in a different category. What Trump has demonstrated is how a media personality with no scruples can manipulate the American public.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480395007", "commentID": 20636659, "userID": 57584852, "recommendations": 264, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636659}, {"approveDate": "1480428309", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480428309", "permID": "20635987", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Colorado", "parentID": null, "userDisplayName": "Douglas Moog", "commentTitle": "<br/>", "commentBody": "To many, Clinton's popular vote victory indicates that the \"will of the people,\" on balance, was thwarted.  In that light, here's something to consider.  Most people disliked both candidates.  I read a statistic that something like 75% of those who voted, and disliked both candidates, voted for Trump.  And most people were sure Clinton would win.  I think it's a fair generalization to conclude that a large fraction of those who considered Clinton the lesser of two evils felt safe enough in her victory to make a protest either by staying home or voting for Trump.  If we had all taken Trump's victory as a real possibility, he probably would have lost. Sure, there's some validity to the revelations about angry white people and such.  But the biggest overlooked advantage that Trump had was the expectation that he would lose. I think the main lesson to take from this election is that polls fail to capture some pretty big dynamics behind actual voting, and we should all get out and vote our preference, even if it's the lesser of two evils.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480389398", "commentID": 20635987, "userID": 663782, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20635987}, {"approveDate": "1480428348", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480428348", "permID": "20636350", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Jim B", "commentTitle": "<br/>", "commentBody": "The media (or should is say \"The Corrupt, Rigged Main Stream Media\"?) persists in trying to assign Trump to the 'presidential' category when that clearly does not apply. Trump won the election, though not the popular vote, not because he fooled anyone into believing he has any president-like qualities at all. To the contrary, Trump won precisely because he lacks the qualities of a traditional presidential candidate.<br/><br/>His boorishness, his shallowness, his very evident prejudices and relentless ignorance are what attracted the millions of voters who did vote for him. That Trump claims, without evidence of any sort, that the election results are distorted by \"millions of illegal votes\" will persuade his believers this yet-another-lie to be true. \"Even with millions of fraudulent votes, I still won...\" Consistently Trump says things where there is plenty of actual evidence, objective and easy to verify, to the contrary. For Trump, it just doesn't matter.<br/><br/>In any well-structured con, there comes a time where the mark has so much of themselves invested in believing the con that, no matter what evidence is presented, the mark won't believe it. Trump has conned his millions of voters so thoroughly that evidence doesn't matter. If Trump says he won the popular vote of 'real voters', they will believe him. If Trump says he won't have conflicts of interest, they will believe him no matter what he does. Evidence won't matter.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480391911", "commentID": 20636350, "userID": 59003930, "recommendations": 205, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636350}, {"approveDate": "1480428500", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480428500", "permID": "20639507", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Daniel Salomon", "commentTitle": "<br/>", "commentBody": "Donald Trump continues to spew forth a barrage of idiotic tweets. I hope twitter permanently bans him.<br/><br/>However, I don't understand why the Left keeps obsessing about the popular vote aside from insinuating Republicans cheated. Like it or not, this is our system. <br/><br/>As they say, \"don't hate the player, hate the game.\" I really doubt that the system will change in the near future, especially with Republicans controlling an overwhelming majority of states. Considering the results of the election, it seems like the Democrats are now just learning of the electoral college's existence.<br/><br/>Campaigns are designed around securing swing states. Donald Trump didn't spend months in blue states. Hillary Clinton didn't spend months red states. We can argue for abolishing the electoral college, but not in the context of the popular vote results of this election.<br/><br/>As someone once said, refusing to accept the results of an election is horrifying and a threat to our democracy. It would be best to move on and start planning for 2020. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480427913", "commentID": 20639507, "userID": 77747860, "recommendations": 26, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20639507}, {"approveDate": "1480428575", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480428575", "permID": "20637325", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sequim, WA", "parentID": null, "userDisplayName": "Ellis6", "commentTitle": "<br/>", "commentBody": "\"And why is Mr. Trump so hung up on the popular vote in the first place? After all, he won where it counts -- in the Electoral College.\"<br/><br/>Yes, he won \"where it counts,\" but any sane person who values democracy knows that the Electoral College is an outdated, undemocratic mechanism designed to give small states more power than their populations warrant. In two of the last five elections the popular vote winner -- the person more Americans wanted to be their president -- lost because of the Electoral College. It may be in the Constitution, but that doesn't mean we shouldn't be ashamed of it.<br/><br/>Mr. Trump proclaimed, prior to the election, that the Electoral College is \"a disaster for a democracy,.\"  His failure to win the popular vote means that more Americans wanted his opponent to win. A person with Mr. Trump's fragile ego and insatiable need to be first, the best, the be all and end all, can't abide the fact -- the undeniable fact -- that if he'd had his way and eliminated the Electoral College, he wouldn't be president-elect. Deep down, I suspect he doubts his own legitimacy, despite what the Constitution says.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480406482", "commentID": 20637325, "userID": 71707280, "recommendations": 176, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20637325}, {"approveDate": "1480428686", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431943", "permID": "20637426", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Warrenton VA", "parentID": null, "userDisplayName": "silver bullet", "commentTitle": "<br/>", "commentBody": "The president-elect's massive ego is the eye of this hurricane in the wake of his unexpected victory. As the ballot count numbers are beginning to show, the thin skinned one is not as beloved as much as he would like to think he is. If he is outpointed in the popular vote, then the voters who didn't choose him are illegitimate and fraudulent, the result of a rigged election system. His need for love and admiration is beyond childish. Rather than be content with his Electoral College win, he continued to be dissatisfied with the electoral process and complain about anything that doesn't go his way. How is this man going to handle the huge burden of the office of the presidency if his gut instinct is to whine and cry foul at any reverse or opposition he'll surely have as Chief Executive? Will his pique at Hillary Clinton cause him to change his mind and prosecute her because the Secretary has given Jill Stein her blessings to push for a vote recount in a few states? What manner of man is the president-elect? The same man we've seen all year during his march to the White House. That he is the choice of American voters for president is unfathomable.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7591/1032/cropped-75911032.jpg", "createDate": "1480409296", "commentID": 20637426, "userID": 75911032, "recommendations": 216, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20637426}, {"approveDate": "1480428709", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480439774", "permID": "20636189", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn NY", "parentID": null, "userDisplayName": "Mark McK", "commentTitle": "<br/>", "commentBody": "Mr. Trump is exactly right. Hurrah!  The election WAS rigged.<br/>If one counts all the states that imposed regressive, unreasonable, unduly burdensome or unprecedented voter i.d. requirements. Victims: largely Democrats, a strategy the Republican'ts had gamed out by studying '08 and '12 voting patterns.<br/>If one counts all the states that disingenuously reduced the number of its polling sites, knowing that many senior citizen Democrats who did not own cars or had reduced mobility would find it difficult to go vote. If this is combined with the first item, it reduces voter participation. Victims: Democrats.<br/>If one counts the jigsawed, lawyer-frenzied, court-packed gerrymandering that redrew and imbalanced Congressional districts into some very odd shapes. Victims: Democrats, now the de facto minorities in many national districts. <br/><br/>If one counts the games played with: accusations of and obsessions with certain email servers that yielded no national secrets vs. the very suspicious underreporting of Mr. Trump's many documented, recorded and politically and ethically disqualifying transgressions.<br/>Hmm, only about 100,000 votes separates the \"winner\" from the \"loser\" in battlegrounds of Michigan, Wisconsin and Pennsylvania. This gets curiouser and curiouser. Didn't we see similar games in places called Florida, and then Ohio? I wonder whose SuperPAC supercomputer was working overtime to steal this election. Now they're gearing up to steal the whole damn country.  Rigged indeed.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480390705", "commentID": 20636189, "userID": 49780703, "recommendations": 209, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636189}, {"approveDate": "1480429030", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480429030", "permID": "20639095", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bridgewater, CT", "parentID": null, "userDisplayName": "Robert Crooke", "commentTitle": "<br/>", "commentBody": "Donald Trump and his allies in the GOP-controlled Congress are about to embark on the most extreme series of legislative and policy measures this country has seen in a generation or more. An agenda so extreme that it lacks all inherent credibility. Thus, Trump needs the borrowed credibility of the myth that he has been elected on a vast popular uprising that has resulted in a mandate for any of his actions. Far from being the recipient of any such mandate, Trump has won a very close election, in a series of very close results among a half dozen key battleground states. His victory stands quite literally on a few hundred thousand votes from these 5 or 6 states on a total voter ship base of 120 million. Seeing people reminded that he actually lost the raw popular vote \"big time\", seeing state by state recounts that remind the public of how narrow his margin of victory is in those states, entirely undercuts the mandate myth, the will of the people image. This is what is bothering him.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480425954", "commentID": 20639095, "userID": 66066615, "recommendations": 175, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20639095}, {"approveDate": "1480429980", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480431877", "permID": "20636026", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "blogcruiser", "commentTitle": "<br/>", "commentBody": "We should be seriously worried. With a trigger happy and thin skinned President who goes after Hamilton actors, the election system, or whatever latest event threatens his ego, we're all set for a Presidency that has only two possible endings: tragedy or farce. What hope is there when the probability that there may be a middle ground is rapidly disappearing under the weight of ill thought out midnight tweets?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480389679", "commentID": 20636026, "userID": 50409020, "recommendations": 155, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636026}, {"approveDate": "1480430366", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480430366", "permID": "20636151", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Courage?", "commentTitle": "<br/>", "commentBody": "Republicans have a special responsibility to publicly call out this repeated nonsense.   Where are the courageous Republicans with national profile will to do this?  Where?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480390471", "commentID": 20636151, "userID": 65588889, "recommendations": 190, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636151}, {"approveDate": "1480430391", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480430391", "permID": "20636165", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MA", "parentID": null, "userDisplayName": "John LeBaron", "commentTitle": "<br/>", "commentBody": "Many of Trump's supporters apparently took him seriously but not literally. It appears increasingly as though we should have also taken him literally, notwithstanding the difficulty created by the legion contradictions of his chaotic rhetoric.<br/><br/><a href=\"http://www.endthemadnessnow.org\" title=\"www.endthemadnessnow.org\" target=\"_blank\">www.endthemadnessnow.org</a>", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4875/1578/cropped-48751578.jpg?0.5667593658002", "createDate": "1480390545", "commentID": 20636165, "userID": 48751578, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636165}, {"approveDate": "1480430840", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480430840", "permID": "20636306", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Jonathan Baker", "commentTitle": "<br/>", "commentBody": "Trump's mad ravings at former beauty queens or \"millions\" of imaginary fraudulent voters are not what is causing nausea in the gut of civilization. It is the stark, cold awareness that he is about to ascend to nuclear-armed power. <br/><br/>There are many written accounts of Europeans feeling an overwhelming sense of doom during 1913-14, with the certainty that an inexorable horror was about to descend upon them that nothing would avert. <br/><br/>This is this mood in America now. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5969/7229/cropped-59697229.jpg?0.5917300696019083", "createDate": "1480391622", "commentID": 20636306, "userID": 59697229, "recommendations": 216, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636306}, {"approveDate": "1480432899", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480432899", "permID": "20636837", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Rae", "commentTitle": "<br/>", "commentBody": "Liar, liar, country's on fire.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480396980", "commentID": 20636837, "userID": 46936593, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20636837}, {"approveDate": "1480436912", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480436912", "permID": "20640778", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New york", "parentID": null, "userDisplayName": "Peter Cee", "commentTitle": "<br/>", "commentBody": "If I were the President-elect, I would welcome a recount to put to bed once and for all, the appearance of a rigged election. However, the Republicans and those close to Trump are taking the opposite point of view and going after anyone who disagrees with them. I I am truly frightened.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2179/1681/cropped-21791681.jpg?0.3192934300750494", "createDate": "1480433137", "commentID": 20640778, "userID": 21791681, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20640778}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1893, "api_timestamp": "1488822377", "totalReplyCommentsFound": 629, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}