{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 25, "totalParentCommentsFound": 463, "totalEditorsSelectionFound": 37, "depthLimit": 0, "totalRecommendationsFound": 505, "comments": [{"approveDate": "1462615805", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462625665", "permID": "18451022", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "MBR", "commentTitle": "<br/>", "commentBody": "From what I saw of the debates, Trump constantly exceeded his allotted time, interrupted, and shouted at anyone and everyone.<br/><br/>The networks which sponsor these debates should set some ground rules and enforce them.  Some questions do deserve longer and more thoughtful answers than a 20 second response and I would like to see time for that in the design of the debates.  But once that is set, the moderators should enforce the ground rules.<br/><br/>If Trump interrupts and/or exceeds his time limit and refuses to shut up, then cut him off the air and switch to ads.  If he continues to Huff and Puff, cut him off completely and give the floor to Hillary.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462591474", "commentID": 18451022, "userID": 27599217, "recommendations": 356, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451022}, {"approveDate": "1462615935", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462612335", "permID": "18451056", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "austin", "parentID": null, "userDisplayName": "don batory", "commentTitle": "<br/>", "commentBody": "It is high time that reporters and interviewers demand more. In (televised) debates, they are the moderators.  They should monitor responses and instantly interrupt/stop name calling. Demand questions to be answered with specificity, not with gross generalities that 5-year-olds get away with. They should be the gatekeepers for civilized debate, and not tolerate mud slinging.  I'm disappointed that this even has to be stated; I would have thought it goes without saying.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462591972", "commentID": 18451056, "userID": 73767686, "recommendations": 565, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451056}, {"approveDate": "1462615953", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462612353", "permID": "18451072", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "somewhere", "parentID": null, "userDisplayName": "SB", "commentTitle": "<br/>", "commentBody": "Should Sec. Clinton choose to take the high road and attempt to have a reasoned, eloquent, policy-driven debate, Trump et. al. will almost certainly try to portray her as elitist and out of touch. Now, this is probably part of the perception held by his supporters, but it would definitely add fuel to the fire. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462592085", "commentID": 18451072, "userID": 71725250, "recommendations": 36, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451072}, {"approveDate": "1462615978", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462612378", "permID": "18451082", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long island", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "Sec. Clinton must, as you note, clarify and simplify her domestic and foreign policy positions so that it connects with the concerns of those angry with and distrustful of a political establishment that has left so many fighting for economic survival.   This anger has fueled both the campaigns of Bernie Sanders and as well as Donald Trump.  Can Sec. Clinton come up with some simple slogans along with some attractive big picture policies that will earn her the support of the now disaffected and skeptical Sanders supporters?  She must do that not only to unite the Democratic Party, but also to blunt the faux populism of Mr. Trump with his simplistic proposals to reopen coal mines, bully China and American corporations, and deport all those job-stealing immigrants.  The best idea is a national program to rebuild our failing and out-dated infrastructure that would create millions of good-paying jobs while making us more competitive with foreign countries.  To do that, Sec. Clinton will have to retake control of Congress.  Given the looming split in the Republican Party, she has a unique opportunity to accomplish this if she can harness the energy and passion and the young voters backing Sen. Sanders.   So to answer your question, Sec. Clinton has to provide substance to Trump's empty slogans and perhaps even take a page from Ronald Reagan who parried personal attacks like those about his age with both grace and humorous quips.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462592187", "commentID": 18451082, "userID": 57715665, "recommendations": 109, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451082}, {"approveDate": "1462618605", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462615005", "permID": "18451341", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland Oregon", "parentID": null, "userDisplayName": "P.S.", "commentTitle": "<br/>", "commentBody": "There are still many people in this country who want a Presidential debate that is about the issues and not a forum for drinking games and a President that knows the difference. Donald may not find his strategy of insults and sound bites as effective with the general electorate.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462594689", "commentID": 18451341, "userID": 58064414, "recommendations": 89, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451341}, {"approveDate": "1462618803", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462615203", "permID": "18451597", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Orleans", "parentID": null, "userDisplayName": "Stuart Phillips", "commentTitle": "<br/>", "commentBody": "They will have to debate.  In the Republican debates most real problems such as global climate change and control of pollution did not come up.  When they do arise in the debates,  it will be difficult for The Donald to craft answers that satisfy his base and also expand his electorate.  A majority of Americans think that climate change is real and do not want to be poisoned by contaminated water or food.  He has a difficult path to fashion.  I do not think he can both satisfy his base and reach out to centrists.  Let us hope that insults will not be enough to win over a majority of Americans.   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4565/09/cropped-456509.jpg?0.6813464786391705", "createDate": "1462597526", "commentID": 18451597, "userID": 456509, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451597}, {"approveDate": "1462620986", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617386", "permID": "18451815", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "Much of the speculation about how each candidate will approach the fall debates seems off-target to me.   We already possess abundant evidence with respect to the debating styles of both Clinton and Trump.  The notion that either one will suddenly abandon the methods they used in the primary debates strikes  me as wrongheaded.<br/><br/>Trump may try to moderate some of his trademark abusive language and flesh out his vague promises with more substance, but, despite his illusions, he cannot shed his character like an old suit of clothes. His lack of knowledge  on policy, combined with an arrogant indifference to the effort required to correct that shortcoming, will force Trump to focus on vague generalities and blatantly false claims.  His conception of politics as a struggle between personalities, moreover, will encourage Trump to rely heavily on his arsenal of  personal invective in the campaign to destroy Clinton's candidacy.<br/><br/>For her part, Clinton excels at detailed explanation of policies, combined with an elaborate analysis of the obstacles that inhibit their execution.  Personal attacks launched by Trump may incite her to respond in kind, but only as a diversion from her dry discussion of taxes or healthcare.<br/><br/>Trump's performance may inspire his fans, but the insubstantial nature of his arguments will not persuade the uncommitted.  The debates, in short, will reinforce the negative image that dominates Trump's public persona.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462601907", "commentID": 18451815, "userID": 63418614, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451815}, {"approveDate": "1462620995", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617395", "permID": "18452127", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Rafael, CA", "parentID": null, "userDisplayName": "George Mandanis", "commentTitle": "<br/>", "commentBody": "Donald Trump's core vulnerability in the presidential contest against Hillary Clinton is his shallowness in the affairs of government.  It is reasonable for the Clinton team to speculate that he would be “dangerous” as President.  But he has already demonstrated to most of us over the last eleven months that he is just a buffoon in “an empty suit”.  Clearly, this is an adequate reason to disqualify him as a candidate for President.<br/><br/>The upcoming debates would provide Mrs. Clinton countless opportunities to expose Trump’s inability to go much beyond catchy populist proclamations on how he would solve U.S.’s problems.  For example, he claims that his deal-making expertise would make America an inevitable winner in foreign trade but reputable business leaders and economists warn that his huge fees on imports would lead to trade wars disastrous to our economy.  Drawing on her diversified experience, well-thought out plans and excellent staff, Mrs. Clinton could show that this and his other grandiose contentions are empty promises. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462609545", "commentID": 18452127, "userID": 16832161, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18452127}, {"approveDate": "1462621012", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617412", "permID": "18452366", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "Hillary Clinton will need all the patience, equanimity, and near Zenlike poise to weather debates with a grown man, behaving far worse than a classroom of emotionally troubled third graders.  But I honestly can't think of a better prepared candidate to do that!  Indeed, the very reasons why some, including myself, have been frustrated with her \"scripted political skills\" may turn out to be her claim on the presidency:  calmness under fire; poise in the face of nastiness;  reason and facts against delusional assertions/fantasies of gold spun from straw; ever-ready inclusiveness versus knee-jerk divisiveness.  The list goes on...<br/><br/>She managed 9 hours under fire in a hearing led by a dreadful Congressman with a strange hairdo and spectral appearance.  She kept her calm.  She wowed us all with her poise and grasp of the facts.  <br/><br/>Dreadful Donald, with his repertoire of strange facial expressions, matched only by his equally strange hairdo, though a greater bully than Trey Gowdy, can't throw a worse tantrum than Hillary can weather - that's my bet!<br/><br/>Having myself withstood 8 years of teaching classrooms of third and fourth graders and afterward years of doing psychotherapy with some pretty challenging character disorders, I'm betting that Hillary has within her the strength under fire and self-possession - which Donald Trump completely lacks.  That is key in surviving, even thriving, in these coming debates!<br/><br/>Will voters choose rightly?  That is the more important question!  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1462615837", "commentID": 18452366, "userID": 32195826, "recommendations": 245, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18452366}, {"approveDate": "1462621031", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617431", "permID": "18451750", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": 0, "parentID": null, "userDisplayName": "kathleen", "commentTitle": "<br/>", "commentBody": " Hillary Clinton will easily trounce Trump in the debate. She is a clever lawyer who crafts forceful , persuasive arguments .  She is poised and articulate and can suffer fools with dogged patience, as she proved most recently in the ridiculous Benghazi hearings. Trump will employ his odious personal attacks, consistent with his vulgar, flatulent reality show persona.  This does not mean he will lose the election. Clinton's singular protean adaptability - her dissembling, her shifting identities - what the editors here term her ability to evolve - lead many to regard her as not simply wisely adaptable, but as manipulative and untrustworthy.  The Times editors certainly are loyal to their chameleon candidate, Ms. Middle of the road Democrat-Progressive-Republican-lite, but today's alienated electorate may prefer the bumptious blowhard over the cerebral shape-shifter.  What a sad spectacle  for a great nation.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462600312", "commentID": 18451750, "userID": 41993729, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451750}, {"approveDate": "1462621041", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617441", "permID": "18451858", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Shrewsbury, MA", "parentID": null, "userDisplayName": "Daniel Rose", "commentTitle": "<br/>", "commentBody": "So, knowing that Trump will deliver a staccato of personal attacks on Clinton in response to moderator, panel, and audience questions, I think one worthwhile tactic might be to engage Trump in a somewhat planned Socratic dialog around whatever issue the question happens to address. By the time Clinton follows up with her third or fourth, if not her second follow-up question, she might well have Trump tied in knots, from which he can continue to launch personal attacks. This Socratic approach would not only clarify issues, but help her to remain calm as Trump's hairy summit erupts over everyone else.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462602984", "commentID": 18451858, "userID": 15918791, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451858}, {"approveDate": "1462621051", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617451", "permID": "18452502", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lansing", "parentID": null, "userDisplayName": "Joe", "commentTitle": "<br/>", "commentBody": "Personally, I'd love to see what would happen if Hillary took (at least initially) a 'soft' approach: begin by listing topics on which they agree: no cuts (expansion of?) Social Security; transgender restroom rights, etc. In other words, allow Donald the opportunity to state categorically and up front why he is not like the career Republicans he bested in the primaries. Then allow him  to demonstrate in precise detail his command of the intricacies of foreign policy. Mr. Trump has burnt many bridges. She would do well to allow him to revisit them. She should also make sure he has two bottles of water on his podium. One for drinking; the other for throwing at her when he does not know how to respond (he can make believe he is throwing water not at her but at the President of Mexico).", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462618233", "commentID": 18452502, "userID": 37841869, "recommendations": 40, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18452502}, {"approveDate": "1462621087", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462617487", "permID": "18452686", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Baltimore", "parentID": null, "userDisplayName": "BCasero", "commentTitle": "<br/>", "commentBody": "As I read down thread, I am appalled at the number of people who want to \"blow up the system\" by allowing Trump to win.  The line of thought is that we would just have a \"bad four years\" and then things would magically change for the better.  Just the fact that the next president will likely nominate 3-4 Supreme Court Justices should put that nonsense to rest.  If Hillary is the Democratic nominee,  I certainly hope that the Sanders supporters consider this fact.  And if Sanders,  wins the nomination, I hope the Clinton supporters also remember.  Mr. Sanders and Ms. Clinton agree on many, many more things than they disagree upon.  However, Mr. Trump, in the fields of political leadership and statesmanship, is an ignorant buffoon.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462620156", "commentID": 18452686, "userID": 502524, "recommendations": 414, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18452686}, {"approveDate": "1462623619", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462620019", "permID": "18451610", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "L", "commentTitle": "<br/>", "commentBody": "Hillary Clinton should not engage with Donald Trump during any debate. She should completely ignore him, not respond to him for any reason and not even look at him. She must keep her cool, focus on the moderators and respond only to them. She should discuss her policies and address only the questions the moderators ask her.<br/><br/>It will drive Donald Trump crazy, and he will act out and behave extraordinarily badly.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462597766", "commentID": 18451610, "userID": 26816928, "recommendations": 176, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451610}, {"approveDate": "1462623633", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462620033", "permID": "18451620", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland", "parentID": null, "userDisplayName": "Guerrmo", "commentTitle": "<br/>", "commentBody": "Donald Trump acts like a 5 year old bully with his name calling, if he tries this with Hillary she should just look at him and tell him to \"Grow up Donald, you aren't in 1rst grade any longer, put your big boy pants on and quit with the bullying and name calling.\"  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462598010", "commentID": 18451620, "userID": 66863418, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451620}, {"approveDate": "1462623679", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462623998", "permID": "18451809", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlottesville", "parentID": null, "userDisplayName": "Larry Figdill", "commentTitle": "<br/>", "commentBody": "The one main thing wrong with this article - Mr Trumps appeal to working-class Americans  DOES NOT \"rest on promises to wall off America from competition from foreign workers and goods.\" It rests on his insults, name calling, and superficial one liners.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462601799", "commentID": 18451809, "userID": 33947, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18451809}, {"approveDate": "1462627076", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462623476", "permID": "18453475", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Las Cruces, NM", "parentID": null, "userDisplayName": "Rob", "commentTitle": "<br/>", "commentBody": "The corporate media (including the New York Times, of course) now seems to have the Reality TV matchup it has long wanted, and we poor viewers will be forced to watch \"a half-year slog through the marital troubles, personal peccadilloes, financial ambitions, social-media habits and physical appearances\" of the two least favorable candidates running for the presidency in the greatest \"democracy\" on earth.  I know that gives me hope for the future of this country and the world.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462625206", "commentID": 18453475, "userID": 55692636, "recommendations": 11, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453475}, {"approveDate": "1462627283", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462623683", "permID": "18453570", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WHITE PLAINS NY", "parentID": null, "userDisplayName": "PETER EBENSTEIN MD", "commentTitle": "<br/>", "commentBody": "The press needs to do its part.  If Mrs. Clinton says, \"I  have carefully examined Mr. Trump's tax proposal and the numbers do not add up.\"  And she then follows it with particulars.  And Mr. Trump replies, \"You are a crook and no one likes you and I don't like your face and you take too long in the bathroom,\" the press needs to say, \"Mr. Trump was unable to answer Mrs. Clinton's withering and detailed review of his tax plan.\"  The press, and especially The Times, which still has a header that says, \"All the news that's fit to print,\" does NOT need to cover the details of Mr.Trumps clownish, pre-adolescent behavior. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462625685", "commentID": 18453570, "userID": 65958596, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453570}, {"approveDate": "1462627455", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462623855", "permID": "18453351", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "South Orange NJ", "parentID": null, "userDisplayName": "Lena", "commentTitle": "<br/>", "commentBody": "I am most concerned about Hilary's tone and manner in the upcoming debates.  On stage with Bernie, she came across to me often as arrogant, condescending and smug, reminding me a bit of Al Gore.  Of course I plan to vote for her, but i think her presentation could turn a lot of people off, especially Independents and Republicans.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462624417", "commentID": 18453351, "userID": 51923602, "recommendations": 36, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453351}, {"approveDate": "1462628036", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462624436", "permID": "18453056", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Minnesota", "parentID": null, "userDisplayName": "Danny", "commentTitle": "<br/>", "commentBody": "When I teach Calculus I am mindful that there is a small minority of the class that is diligently taking notes and thinking about what I have to say, there is a another small minority that see me and everything about the class as a joke, and there is a large middle who are struggling to stay afloat but are making an honest effort to understand and learn something.  It is always tempting for me to teach almost apologetically, wary that the bottom portion of the class will become antsy and disrupt the class.  I aim for the middle and occasionally introduce topics that interest the top of the class.  Clinton has to do the same:  use the debates as a teachable moment, educating voters about policy and why it matters, and try not to be overrun by Trump’s appealing to the bottom of the electorate.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462622684", "commentID": 18453056, "userID": 31810499, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453056}, {"approveDate": "1462628107", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462624507", "permID": "18453082", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Mike BoMa", "commentTitle": "<br/>", "commentBody": "Trump doesn't debate. He simply doesn't; because he can't. He attacks and he negotiates. At times, negotiations can seem nonsensical and disjointed. It's an act, a ploy designed to disrupt, tire and exasperate your negotiation opposite.  And it very often works. <br/><br/>Trump will not follow the usually understood protocols of debate or negotiation. He'll spew superficial mom and apple pie one-liners with which Clinton dare not disagree with a \"yes, but...\" response. The \"yes\" is all he needs. But she also can't ignore him. Her tactic must be somehow to move him beyond one-liners, to details. That's her strength and his weakness. As was true for his supposed serious foreign policy speech, he'll simply read or repeat whatever someone else has prepared for him. Beyond that, he's lost.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462622866", "commentID": 18453082, "userID": 26406894, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453082}, {"approveDate": "1462628143", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462624543", "permID": "18453118", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": null, "userDisplayName": "redweather", "commentTitle": "<br/>", "commentBody": "Hillary ought to debate Trump in the same way she debated the Republican members of the Select Committee on Benghazi last October. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462623040", "commentID": 18453118, "userID": 74368719, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453118}, {"approveDate": "1462628491", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462624891", "permID": "18453123", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "lee ny", "parentID": null, "userDisplayName": "sherm", "commentTitle": "<br/>", "commentBody": "I think it's going to be more a test of personalities than of substance. Obviously Trump's substance vacuum didn't hold him back during the primaries. Like it or not it was his personality that attracted the media and his supporters. Cruz was pretty close to Trump in terms of vacuity, but had no discernible personality to warm up to.<br/><br/>It doesn't hurt that Trump appears to have no ideological anchor to get in the way. He can jump from the right of Cruz to the left of Sanders in a wink of the eye.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462623080", "commentID": 18453123, "userID": 20019851, "recommendations": 17, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453123}, {"approveDate": "1462628516", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462624916", "permID": "18453161", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "Tired of Hypocrisy", "commentTitle": "<br/>", "commentBody": "Some in these comments have mentioned that the Democratic nominee should discount and marginalize those who support Trump, since they are beyond redemption. That sounds a lot like candidate Romney's remark concerning the 47 percent. Solid advice for the Democratic candidate if she/he wants to end up like Romney. <br/><br/>What goes around comes around.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462623293", "commentID": 18453161, "userID": 23135912, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18453161}, {"approveDate": "1462629073", "commentType": "comment", "userTitle": "NULL", "updateDate": "1462625473", "permID": "18454137", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle", "parentID": null, "userDisplayName": "MsPea", "commentTitle": "<br/>", "commentBody": "The only way a debate can be meaningful is if there is no audience present. Trump plays to the audience and relies on its responses to tell him what's working and what isn't. Without an audience, there is no Trump. Just the candidates and the moderators in a studio would be the best way for the American people to really have a look at and a chance to listen to both of them. Trump promises he can \"be presidential\", so let him prove it, away from his adoring, cheering crowds. We know Clinton can take it and will have no problem-she's certainly faced worse-, but I have the feeling that Trump may not fare so well all alone without the crowd that feeds him.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1462628714", "commentID": 18454137, "userID": 50527257, "recommendations": 130, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18454137}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 763, "api_timestamp": "1488822363", "totalReplyCommentsFound": 300, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}