{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 25, "totalParentCommentsFound": 952, "totalEditorsSelectionFound": 26, "depthLimit": 0, "totalRecommendationsFound": 860, "comments": [{"approveDate": "1442533681", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442530082", "permID": "16118642", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 31, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "madison, wi", "parentID": null, "userDisplayName": "steve", "commentTitle": "<br/>", "commentBody": "Some blame should be placed on the CNN moderators who chose the questions and a debate format to encourage useless uninformative arguments between candidates. As hosts, the moderators should have posed questions on important topics rather than the fashionable issues candidates have chosen to pander to voters. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442530375", "commentID": 16118642, "userID": 61727206, "recommendations": 1631, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118642}, {"approveDate": "1442533758", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442530158", "permID": "16118678", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new york", "parentID": null, "userDisplayName": "jmolka", "commentTitle": "<br/>", "commentBody": "It really felt like we were watching junior-high kids vying for class president.  The degree of immaturity across the board was staggering.  Not a single one had anything reasonable to say.  Not a single one inspired any confidence that our nation would be in capable hands.  Given that I'm not a Republican, it was all I could've asked for.  They can say what they want about Clinton and Sanders, but at least the Democrats are fielding adults in their primary process.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442530723", "commentID": 16118678, "userID": 68278178, "recommendations": 1570, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118678}, {"approveDate": "1442533981", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442530381", "permID": "16118718", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "St Barts, FWI", "parentID": null, "userDisplayName": "Christian", "commentTitle": "<br/>", "commentBody": "Kinda makes one long for the good ole days - oh way back four years ago - with Mitt Romney who, although he would say anything to please whatever audience he found himself in front of, could at least discern reality from utter fiction. What's truly frightening is the number of Republican voters who can't tell the difference...", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3252/5696/cropped-32525696.jpg?0.37025367636986495", "createDate": "1442531076", "commentID": 16118718, "userID": 32525696, "recommendations": 1052, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118718}, {"approveDate": "1442534227", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442530627", "permID": "16118839", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 54, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rochester, NY", "parentID": null, "userDisplayName": "Peter S", "commentTitle": "<br/>", "commentBody": "Your message is well stated but I think that you're missing the point. The Republicans are very successful. The Supreme Court leans toward conservatism. The Republicans have majorities in congress. They have 31 Republican Governors, and control 24 state legislatures. Mayors, councils, school boards....Any way you cut it they are extremely successful. <br/><br/>President Bush wanted a war and started two. He wanted lower taxes on the rich, done. He wanted the carried interest tax for the hedge fund crowd, done. He wanted to reward loyal republicans with posts in Iraq and Afghanistan, done. The list goes on and on.<br/>The question shouldn't be, why do they do it, that's obvious. But why we keep electing them? Why don't we know the facts, the science, the history. Why do we allow ourselves to be told what the truth is? You're questioning the debaters when you should be questioning the audience.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442532214", "commentID": 16118839, "userID": 45837221, "recommendations": 3131, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118839}, {"approveDate": "1442534374", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442543911", "permID": "16118858", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Neander", "commentTitle": "<br/>", "commentBody": "The most frightening aspect of the evening was not the 'crazy talk' itself, but the enthusiastic applause and approval it solicited from the Republican faithful who had come to hear GOP gospel in Reagan's temple.  <br/><br/>Let's consider this for a moment. I think it's safe to assume that the candidate's pronouncements and positions - however specious - were carefully scripted, focus-group tested, and calculated by some of the best political minds that money can buy to appeal to the Republican rank and file.  If so - and based on the audience reaction, they apparently calculated well - then it suggests that a substantial portion of the American population is entirely at home with factually wrong views, and the chest-thumping, shallow thinking, fiscally challenged, and mean spirited executive these candidates think a President of the United States should be.  <br/><br/>That won't surprise anyone who's tuned in to various right wing media outlets the last two decades.  In a 2013 poll nearly one third of Louisiana Republicans blamed Obama for the Hurricane Katrina response, which occurred years before his election.<br/><br/>That should not make anyone feel safer. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442532401", "commentID": 16118858, "userID": 53648753, "recommendations": 1809, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118858}, {"approveDate": "1442541504", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442537904", "permID": "16118978", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tucson", "parentID": null, "userDisplayName": "Jim in Tucson", "commentTitle": "<br/>", "commentBody": "This is what happens when the participants are allowed to define the problem before offering the solution. Not a single member of that motley crew gave any kind of realistic definition to the issues they would face as President, but then when on to describe in soaring terms how they would handle immigration, our runaway military spending, tax reform, home security, and of course, abortion. <br/><br/>When you're allowed to go unchallenged by the truth, it's easy to offer the most facile fantasy solution you can dream up. Who needs notes? Or facts?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1650/0152/cropped-16500152.jpg?0.8544907292435217", "createDate": "1442533531", "commentID": 16118978, "userID": 16500152, "recommendations": 570, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118978}, {"approveDate": "1442545753", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442542153", "permID": "16118934", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Honolulu", "parentID": null, "userDisplayName": "Lopaka", "commentTitle": "<br/>", "commentBody": "Very obvious that Trump's \"schtick\", and it is just that, isn't shocking or funny any more. Same old, same old and that doesn't qualify him for the office of President.  As for the rest of the \"A\" team I found Paul to be more moderate that I thought. Huckabee will lead us to a theocracy. Rubio is smart but needs more seasoning. Cruz-ugh! Carson - nice man but very unqualified.   Bush - can't believe he was a decent Governor. Walker-another ugh!  etc etc.<br/>If I had to vote for one of eleven it would be Kasich.  He comes across as the only adult with the chops to be President.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442533075", "commentID": 16118934, "userID": 46546329, "recommendations": 312, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16118934}, {"approveDate": "1442546347", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442542747", "permID": "16119190", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "Hatsoff", "commentTitle": "<br/>", "commentBody": "There is an element here of reaping what you sow. Too often folks in both the media (including the times) and political world treat pandering rhetoric - fantasies of what people are for, or wish were the case -  as 'one side' of an issue. That helps politicians  spin  fantasies rather than complex plans. It also helps make those fantasies increasingly extreme - if you never have to consider the repercussions of what you want on yourself or anyone else, its easy to make demands unhinged from any truth. So a desire to retool immigration becomes a 'trail of tears.' A worry about government overspending becomes the repeal of the ACA. We need is a media that focuses much more on how candidates propose to achieve their goals.<br/><br/>Its so sad that the only check on a democrat doing a bad job (besides the media and other democrats) is a bunch of seemingly insane people offering to do a worse job. It would be wonderful for this country if there were 2 parties  with real ideas. Members of those parties could  hold each other accountable and engage in actual debate that would lead to better laws.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442535375", "commentID": 16119190, "userID": 72657229, "recommendations": 223, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119190}, {"approveDate": "1442547142", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442543542", "permID": "16119294", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sacramento, Calif.", "parentID": null, "userDisplayName": "JoeB", "commentTitle": "<br/>", "commentBody": "\"A modern trail of tears\" is an excellent description of what they are suggesting.  A massive spike in food prices is what they will create.  We should be encouraging people to work for a decade to get citizenship.  We need roads and bridges not a new wall with a nice door.<br/><br/>The Republicans may think that Carly Fiorina is going to attract women, but I don't think so. She laid tens of thousands of people off while she took a bonus, she won't protect women's health rights or support the education of their children.  It isn't just the candidates that are wrong, it is the party's lack of understanding of what working people need.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6375/2771/cropped-63752771.jpg?0.17809617697501567", "createDate": "1442536321", "commentID": 16119294, "userID": 63752771, "recommendations": 723, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119294}, {"approveDate": "1442564729", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442561129", "permID": "16119453", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "I dearly hope that Americans *will* remember what was said last night.  As the campaigns continue and votes are solicited, I hope that citizens will remember immigrants being spoken of in terms befitting vermin.  As the Pope nears his NY visit, I hope that citizens will remember candidates dodging the topic of environmental responsibility (Catholic Marco \"I'm not a scientist\" Rubio fudged his climate response entirely).  As we look back on the Sept. 11th anniversary, I hope that people will remember Jeb!'s lie that his brother kept us safe.  As Syria burns and ISIS wantonly kills, I hope that people will remember the complete disregard that everyone but Paul showed for the ramifications of our Middle East militarism.  As our veterans continue to address the physical and psychological wounds of fighting in Iraq and Afghanistan, I hope people will remember the glib attitudes towards war and the fantasies of bombing others into submission.  As people are newly and thoroughly insured, I hope people remember the promises to undo the ACA, allegedly the worst thing to hit the US since slavery. As women seek medical care through Planned Parenthood, I hope people remember it bring described as evil, the plan to shutdown the government over its funding, and Jeb!'s assessment of women's health spending as frivolous.   We will be better served if the egregiousness and inanities continue to be parsed and candidates' words come back to haunt them. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442537764", "commentID": 16119453, "userID": 40118532, "recommendations": 572, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119453}, {"approveDate": "1442565318", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442561718", "permID": "16119546", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ridgewood, NJ", "parentID": null, "userDisplayName": "Ira Jay", "commentTitle": "<br/>", "commentBody": "As I watched the debate, I felt real fear that one of these men -- any of them, with perhaps the possible exception of a slightly more rational Kasich -- might be my next President. But one thing amused me among these folks. <br/><br/>Here they were talking about the huge deficit we have and will face this year because of Obama, by his supposed reckless spending that got us to this fiscal point (never mind what GWB did to the economy under his watch). What amused me is that at least 10 of these scary jokers proposed programs that would cost many hundreds of billions -- probably many trillions -- to implement, and what would THAT do to the deficit -- from Trump's idiotic wall and the troops necessary to secure it and his plan to deport 11 or 12 million illegal immigrants, to Fiorini's (and other debaters') call for building the military and our naval fleet to unilaterally put down Syria and ISIS and any other country in our way. Who do these candidates think is going to pay for all of this. Yes, you, the public. Whatever Obama has spent over 6 years is chump change compared with what these clowns would spend.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442538716", "commentID": 16119546, "userID": 54877159, "recommendations": 487, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119546}, {"approveDate": "1442569744", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442566144", "permID": "16119609", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "Prof.", "commentTitle": "<br/>", "commentBody": "The second GOP debate on CNN, including both Group 1 and Group 2, was a fantastic display of politics as entertainment. This is the value derived from PAC money and rich donors. The excessive funding subsidies have attracted a crowded field of candidates, and the promise of winning access to more in the future has encouraged them to enter a primary competition that appears to function much like any of the formulaic reality shows on TV. Viewers will watch, cheer or boo in turn, and their votes for or against these candidates will be captured in polling data along the way, and eventually the ballot boxes of several states. A party convention will be held mid-way through next year, a winning representative declared, or last loser perhaps, and then the election will determine among the two finalists who gets to become the entertainer in chief. By then, the donors will no doubt be pleased with their entertaining investments, and congratulate themselves on the tremendous value derived from their purchased weapons of mass distraction.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442539324", "commentID": 16119609, "userID": 72888057, "recommendations": 108, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119609}, {"approveDate": "1442569803", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442566203", "permID": "16119615", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Honolulu", "parentID": null, "userDisplayName": "Ed", "commentTitle": "n/a", "commentBody": "\"Crazy\" might just win the race. It beats \"boring\" any day of the week. BTW Trump has moved beyond issues having barely discussed them and is now posing as the healer of the party. It was amazing to see him high-fiving some of the other candidates and then gently shrugging off their barbs. It was as if he was rising above the fray and already looking ahead to his Presidency. In the process of so doing he has put the very idea of Presidential debates in perspective diminishing their importance and turning them into reality TV--hollowly driven by the quest for ratings which is something he can actually deliver on. The result is a circus. and he is our modern-day P.T. Barnum, whose famous saying \"A sucker is born every minute\" is now more true than ever. It is amazing that the NYT in it's editorial should be at all surprised by this development.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6909/5761/cropped-69095761.jpg?0.16759147746404485", "createDate": "1442539381", "commentID": 16119615, "userID": 69095761, "recommendations": 160, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119615}, {"approveDate": "1442570168", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442566568", "permID": "16119699", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los angeles", "parentID": null, "userDisplayName": "Nadine", "commentTitle": "<br/>", "commentBody": "To me the clowns show we witnessed last night was alarming in many ways.<br/>For Trump to call for a multibillion dollar wall between Mexico and the US is much more than a waste of our taxpayers money vis a vis the complex realities of immigration reform. It's a discourse on punishment, cruelty, nativism which resonates with the deepest impulses of racism, authoritarianism and fear now prevalent in the US.  Listening to the other contenders trying to outdo each other in \"making America great again\", I kept wondering if any of them could relate to the concept of the common good, and the social and communal bonds we all need in a substantive  democracy. In the words of Hannah Arendt what I saw last night, glaring under the light of that stage was the \"banality of evil.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442540379", "commentID": 16119699, "userID": 70725066, "recommendations": 321, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119699}, {"approveDate": "1442571022", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442567422", "permID": "16119857", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Ann Gramson Hill", "commentTitle": "<br/>", "commentBody": "This growing divide between entirely different versions of reality is what I find really unsettling.<br/>It seems as if there is a diminishing amount of common ground, and we can't even agree on the basic tenets of reality.<br/>What kind of trajectory are we on? Where does this lead?<br/>And what do these candidates say about us as a nation?<br/>With so much of the world in turmoil, America, more than ever, needs to try to project an image of sanity.<br/>It seems like the country is on the verge of a collective nervous breakdown of some sort.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442542138", "commentID": 16119857, "userID": 56824692, "recommendations": 233, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119857}, {"approveDate": "1442571105", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442567505", "permID": "16119874", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, IL", "parentID": null, "userDisplayName": "ACJ", "commentTitle": "<br/>", "commentBody": "The base of the Republican party has always talked like this --- among themselves. The party has now \"evolved,\" to the point that it feels comfortable sharing their country club talk and humor with America ---- remarkably, they have found an audience amongst demographic groups whose everyday lives are very far from the towers and clubs these candidates inhabit. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3324/1678/cropped-33241678.jpg?0.32306929980404675", "createDate": "1442542430", "commentID": 16119874, "userID": 33241678, "recommendations": 147, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119874}, {"approveDate": "1442571548", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442567948", "permID": "16119969", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Saint Paul", "parentID": null, "userDisplayName": "Tiffany", "commentTitle": "<br/>", "commentBody": "The Republican Debate may have been a television mess, but it seems that the \"moderate\" Republican can't win anymore or at least get air time if they are \"too normal.\" Extremists, no matter how irrational, are the loudest, best remembered, and the most passionate even if they're wrong. But how different are the ideas and candidates this year compared to other years? The Republicans still want everything they wanted in 2000, which George Bush made happen. The Iraq War, No Child Left Behind, tax breaks, and etc, are the results of being out of touch with reality. And yet, as history has shown, even with all this Republican \"crazy talk,\" we may actually vote one of these candidates in. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6923/6786/cropped-69236786.jpg?0.660887124016881", "createDate": "1442543565", "commentID": 16119969, "userID": 69236786, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16119969}, {"approveDate": "1442579180", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442575580", "permID": "16120364", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "St.  Louis", "parentID": null, "userDisplayName": "WJL", "commentTitle": "<br/>", "commentBody": "And the most amazing is yet to come:  47 - 51% of us will vote for one of them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442548987", "commentID": 16120364, "userID": 53658262, "recommendations": 171, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16120364}, {"approveDate": "1442579329", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442575729", "permID": "16120396", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fort Lee,Nj", "parentID": null, "userDisplayName": "Mike Davis", "commentTitle": "<br/>", "commentBody": "The bottom line is that of all of them up there, Trump was the least scary. At least he did not promise to risk nuclear holocaust by refusing to deal with Putin, he made a strong defense for funding women's health care. He said he would take another look at the Iran nuclear deal and would not tear it up outright. The thousand mile fence and then getting Mexico to pay for it, well that's another story.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442549549", "commentID": 16120396, "userID": 22234536, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16120396}, {"approveDate": "1442579568", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442575968", "permID": "16120418", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "John Smithson", "commentTitle": "<br/>", "commentBody": "It all depends on your political persuasion. I watched about 8 hours of debate coverage last night, and found it entertaining and insightful. I think any of the 15 candidates would be a fairly decent president. <br/><br/>I would prefer any of the Republicans over Hillary Clinton, Bernie Sanders, or Joe Biden. But that's just political preference. In terms of being able to handle the presidency, all would be fine. <br/><br/>My problem is that there is no one I would enthusiastically support. The person who makes the most sense to me, Rand Paul, can't really appeal to a broad enough base. The Republicans don't like him, since he's from the libertarian side of the party. And of course, the Democrats would never support him. <br/><br/>What to do? I guess I'll sit this election out. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442549982", "commentID": 16120418, "userID": 65703212, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16120418}, {"approveDate": "1442584566", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442580966", "permID": "16121844", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "sun city center, fla.", "parentID": null, "userDisplayName": "paul mathieu", "commentTitle": "<br/>", "commentBody": "First, the media glorified Trump's rise in the polls even as his comments were as idiotic as ever. Now, one and all are putting Fiorina on a pedestal because crowds respond to her and her polls are up, even as she spouts so much nonsense and blatant lies. Any serious commentator should deplore this orgy of constant attacks on suffering people (the poor, the uninsured, the illegals), this orgy of warring against all foreign countries, except Israel, against science. One can understand that they would attack our thoughtful President, after all he is a Democrat, but every one of the candidates has shown that he/she would be a disaster after Obama.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442575928", "commentID": 16121844, "userID": 59309121, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16121844}, {"approveDate": "1442585189", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442581589", "permID": "16121443", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Texas", "parentID": null, "userDisplayName": "Darwin", "commentTitle": "<br/>", "commentBody": "First, we should stop calling them debates.  They are infomercials and should be aired only at 3:30 am.  The solution is relatively simple.....replay the Alan Alda v Jimmy Smits West Wing debate. Make that the standard for serious debate dialogue, and implement their format which is respectful of voter's intelligence.  If 11 or 15 candidates are in the mix, use our great American model for competition, and hold a March Madness single elimination tournament.  Seed them by poll numbers, and have them go head to head with a real moderator who drives toward solutions rather than ratings. Why not?....what we all saw Wednesday night was true madness.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6661/3113/cropped-66613113.jpg?0.9881536304019392", "createDate": "1442572441", "commentID": 16121443, "userID": 66613113, "recommendations": 92, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16121443}, {"approveDate": "1442585668", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442582068", "permID": "16120595", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Guam", "parentID": null, "userDisplayName": "RR", "commentTitle": "<br/>", "commentBody": "I was glad to see this spot-on editorial end with a shout-out to The Donald.  In my mind (and maybe only in my mind -- I understand that), Mr. Trump has been performing an outstanding service to America:  By dialing up the craziness WAY past \"10,\" he's doing more than anyone to expose the absurdity, the perfidy, the hypocrisy, and the threats in today's political landscape.  I like to think that's his plan -- to help restore political sanity by showing us, shockingly and without apology, what insanity looks like.  <br/><br/>But even if that's not his agenda -- i.e., if I'm as delusional as all my friends tell me I am -- The Donald may still trigger some creative political destruction for the better.  Either way, I think it's a worthwhile experiment.  <br/><br/>Keep it up and shake it up, Mr. Trump!  Americans can be tough nuts to crack.  Pile on the pressure and then finish by endorsing Bernie Sanders and proving that you're really the greatest political burlesque artist of all time. <br/><br/>That's what I want for Christmas this year. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442553111", "commentID": 16120595, "userID": 19094488, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16120595}, {"approveDate": "1442594613", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442591013", "permID": "16125611", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Halifax, Nova Scotia", "parentID": null, "userDisplayName": "Tim L.", "commentTitle": "<br/>", "commentBody": "The so-called \"debate\" was marketed relentlessly for what it turned out to be: a ludicrous \"reality show\" starring a poor cast of characters posing as real candidates.  Such is the present state of the civic enterprise in the U.S.  Don't bother with actual realities, just the made-up ones; don't bother with history, with science, with neighborliness, or with the genuine problems suffered by the citizens individually and collectively.  Play to the ignorant, to the slightly uncomfortable who claim they're truly suffering, to the selfish, the angry and to the thoughtless narcissist.  That is what I saw lined up in front of the Saint Reagan airship the other night.  It was astonishing.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4025/8121/cropped-40258121.jpg?9621214721137226584", "createDate": "1442592039", "commentID": 16125611, "userID": 40258121, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16125611}, {"approveDate": "1442595002", "commentType": "comment", "userTitle": "NULL", "updateDate": "1442591402", "permID": "16125746", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "illinois", "parentID": null, "userDisplayName": "ecbr", "commentTitle": "<br/>", "commentBody": "I heard ONE thing I agreed with, from Rand Paul, of all people.  He said we should apply wisdom when deciding whether to invade a country or not.  Sometimes both sides are bad, and power vacuums are even worse - as we see now in the Middle East.  <br/><br/>A point that needed to be made, but because he is Rand Paul I'm not sure anyone seriously listened to that salient point.  A debate filled with bombast.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1442592762", "commentID": 16125746, "userID": 23533025, "recommendations": 50, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16125746}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1581, "api_timestamp": "1488822324", "totalReplyCommentsFound": 629, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}