{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 7, "totalParentCommentsFound": 171, "totalEditorsSelectionFound": 9, "depthLimit": 0, "totalRecommendationsFound": 244, "comments": [{"approveDate": "1480939205", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480939205", "permID": "20696823", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hopewell Junction NY", "parentID": null, "userDisplayName": "Cathy", "commentTitle": "<br/>", "commentBody": "Trump's stump speech is focused on freeing up businesses from regulations so that they can expand and employ people. That makes any movement toward retaining labor regulations unlikely, especially since no one in Congress will be pushing him to do so.<br/><br/>We can expect to see fewer worker protections, fewer consumer protections, based on the myth that an efficient market will manage them.<br/><br/>The people who chose Trump because of their economic insecurity were sold a pig in a poke. At some point, if they emerge from the bubble of news-like posts in news-like media, they may notice. But most likely they will continue to blame liberal elites on the coast for their problems.<br/><br/>Don't expect the GOP or the Trump administration to do more than pay lip service to expanding jobs or wages.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480937697", "commentID": 20696823, "userID": 51087612, "recommendations": 168, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20696823}, {"approveDate": "1480939622", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480939622", "permID": "20697027", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Between Alpha &amp; Omega", "parentID": null, "userDisplayName": "Nemo Leiceps", "commentTitle": "<br/>", "commentBody": "When I hear grumblings from likely trump voters out in public (although not at work when I have it) about labor conditions and health care that were addressed by democrats, I'm making an effort to point out they voted for just what they're complaining about.  At first I get angry blow back but after I wait patiently for that to blow over I hit them with my best supporting points and where I got my info. It's especially effective in captive places like the line at the drug store where grumbling is rampant.<br/><br/>As soon as I heard about the hold on overtime pay, I made this my topic. Not only were most whom I met unaware of the law being passed, but that it was put on hold by one judge.  Let me tell you, it got attention from trump voters I encountered. And surprisingly, we had conversations not fights.  They saw they were being cheated and were interested.<br/><br/>In a world where we do not all read the same news it is essential that everyone who made up the popular vote point out to the people who voted for trump the impact of their actions every day--personally.  It's NOT an \"I told you so\" kind of thing. Most of the people I encounter really don't follow the news at all because it's too upsetting and confusing or are hardened into their views through the impact of their family and friends.<br/><br/>It's not up to politicians.  It's up to us, everyday to never let drop the harm that is being done to stop it.  Hold the people around you accountable--with kindness.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5950/3817/cropped-59503817.jpg?5441659221458807950", "createDate": "1480938985", "commentID": 20697027, "userID": 59503817, "recommendations": 330, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20697027}, {"approveDate": "1480951222", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480951222", "permID": "20696955:20700104", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Jimmy", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Covington Ky", "parentID": 20696955, "userDisplayName": "Lisa Schneider", "commentTitle": "<br/>", "commentBody": "As a business owner in manufacturing, every year I purchase automated equipment, in order to reduce my work force and increase my profit. It has nothing to do with taxes, I will continue to do that no matter my tax bill. I have doubled my output while reducing my workforce. It is also true every year I hire more employees. They are college educated and high paying jobs working on my shop floor running equipment that is programmed at a computer. I will pay for any employee to get additional education, and not at a for profit college either.<br/>I also voted for Hillary Clinton, because at the end of the day democrats have a far superior product for small business owners. (Republicans have a far superior product for large financial business CEO'S) On Novemebr 10th I met with my CPA to begin preparing my business for the next republican recession and in 4 or 8 years I will watch as the democrats once again dig us out of that financial mess. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480948703", "commentID": 20700104, "userID": 77965139, "recommendations": 190, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20700104}, {"approveDate": "1480951317", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480951317", "permID": "20700444", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salt Lake City, Utah", "parentID": null, "userDisplayName": "Andrew G. Bjelland, Sr.", "commentTitle": "<br/>", "commentBody": "I am still betting that the Ryan-Trump-GOP fast-tracking tried-and-found-wanting Reaganomic solutions will further diminish the prospects of American workers. Corporations will continue to exploit artificial intelligence, and will continue creating jobs for robots, computers and offshore employees. The enhancement of shareholder value and executive compensation will remain the chief objectives of corporate enterprises. Workers’ interests will be enthusiastically sacrificed to secure these goals. Unemployment will likely increase, and underemployment will become an established fact of American life.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480949547", "commentID": 20700444, "userID": 58063917, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20700444}, {"approveDate": "1480951428", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480951428", "permID": "20699083", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "LHW", "commentTitle": "<br/>", "commentBody": "Based on his own behavior with his businesses and reality show, it's highly unlikely that Trump will support guidelines and programs that protect the wages of hourly employees, independent contractors and other non-white collar (and even white collar) workers. How many contractors for his real estate development projects has he refused to pay, forcing them to settle for less than agreed on so that they at least get something? Despite its success, he didn't pay union wages on \"The Apprentice\". How many of the people who voted for him are in a precarious economic condition that will get worse, particularly as they lose affordable heath insurance? This of course is consistent with the scam the Republicans have foisted on us for years - that lining the pockets of the 1% will somehow benefit the rest of us. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480946257", "commentID": 20699083, "userID": 20251020, "recommendations": 74, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20699083}, {"approveDate": "1480952065", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480952065", "permID": "20699003", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Mexico", "parentID": null, "userDisplayName": "Jack", "commentTitle": "<br/>", "commentBody": "Making rational arguments to influence Trump is probably a waste of time better spent denouncing Trump for his terrible appointments. He is a well known fraud, and a terrible employer himself, so why do you think he is going to change. He is going to oppose the one way wages can be improved raising the minimum wage to a living wage, and attack unions as he has always done both in this country and by having his manufacturing done abroad. Which brings up another issue that I have not seen mentioned anywhere: how many jobs has Trump bought back that involve his many businesses abroad?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480946059", "commentID": 20699003, "userID": 69132042, "recommendations": 52, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20699003}, {"approveDate": "1480952091", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480952091", "permID": "20697807", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Highland Moors, Scotland", "parentID": null, "userDisplayName": "Thomas MacLachlan", "commentTitle": "<br/>", "commentBody": "\"Mr. Trump said his victory was not a rejection of what Mr. Obama has stood for, but a “repudiation of what’s been taking place over a longer period of time.” \"<br/><br/>This should illustrate clearly what an abject liar Trump is. What has been taking place over a longer period of time is the establishment of an American caste system, based on economic inequality and disenfranchisement of the majority of the people. And what has Trump done to relieve that with his Cabinet picks? He certainly hasn't \"drained the swamp\". He's turned the swamp into a cesspool full of voracious alligators, all of whom are just waiting to devour every last bit of the American economy for their own personal benefit. And HIS.<br/><br/>Most egregious of all, he has deceived the very people who need help in recovering from the financial ruin they're experiencing, because of dying industries, globalization, and frank obstructionism from the Republicans who worked diligently to block any legislation from the Obama administration to address these things. They are the people who voted for him, and they are the people he lied to. His entire strategy is \"deceive and betray\".<br/><br/>How in the world can ANYONE believe a single thing that comes out of the mouth of this man? Good Lord, Trump is America's Tweeter-In-Chief, playing with his smartphone like a 5 year old. This is leadership?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6595/5315/cropped-65955315.jpg", "createDate": "1480942655", "commentID": 20697807, "userID": 65955315, "recommendations": 83, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20697807}, {"approveDate": "1480952638", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480952638", "permID": "20698493", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ireland", "parentID": null, "userDisplayName": "FunkyIrishman", "commentTitle": "<br/>", "commentBody": "If you want to help working people, then give them security. <br/><br/>You give them security by making sure that all that put in an honest day's work get compensated with an honest day's pay.<br/><br/>You do that by raising the minimum wage so people are not working full time, yet still living in poverty. You do that by making sure that a women gets paid the same wage as a man, (Through the ERA ) You do that by allowing people to carry over their health insurance from job to job. You do that by fair and progressive taxes that does not put the burden on the middle class or the poor. You do that by enabling and promoting unions that share in the management of businesses. <br/><br/>You do that with a bottom up philosophy instead of top down .", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7401/4596/cropped-74014596.jpg", "createDate": "1480944778", "commentID": 20698493, "userID": 74014596, "recommendations": 100, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20698493}, {"approveDate": "1480953569", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480953569", "permID": "20697032:20701528", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "john", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Darien, CT", "parentID": 20697032, "userDisplayName": "Joanna Bridges", "commentTitle": "<br/>", "commentBody": "So you think having a billionaire real estate developer appointing his billionaire pals to cabinet positions and having a Republican dominated Senate which wants to destroy any safety net for working American and privatize anything it can is going to improve the plight of American workers? The Democrat administrations, despite the myth Republicans have created, leave this country in better condition and then the Republican administrations drive it into the ground again. Obama spent 8 years digging this country out of the mess the Republicans had left and with the Republicans opposing him every step of the way. The sad thing is that some real progress could have been made on reducing income equality in the next four years. Instead there will be tax cuts for the 1% and corporations (which have been recording record profits while the income and benefits of the lower and middle classes have eroded) and shredding of the safety net. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480952841", "commentID": 20701528, "userID": 48712836, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20701528}], "totalEditorsSelectionReturned": 9, "replyLimit": 3, "totalRecommendationsReturned": 9, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 287, "api_timestamp": "1488822329", "totalReplyCommentsFound": 116, "totalCommentsReturned": 9, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}