{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 880, "totalEditorsSelectionFound": 29, "depthLimit": 0, "totalRecommendationsFound": 881, "comments": [{"approveDate": "1471760440", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878290", "permID": "19548190", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Canada", "parentID": null, "userDisplayName": "Keith Ferlin", "commentTitle": "<br/>", "commentBody": "Think of this in terms of \"Silver Linings Playbook\". Yes it seems scary and the task is daunting. The really silver bright spot in this is that finally this discussion that America has been avoiding for a long time is now finally out in the open. It has also awakened spirit of take our country and government back, that you value immigrants because that is what has made America prosperous and vibrant, that all of you at some point were immigrants. There will be a decades long process undoing all of the mainly GOP wrong but Democrats have their share as well. Begin the de-polarization process, perhaps even before the election but do not waver from the task at hand. Defeat Trump, preferably a 50 State rebuke, a message delivered in a bigly way that even the Donald would get it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471719869", "commentID": 19548190, "userID": 66904355, "recommendations": 671, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19548190}, {"approveDate": "1471760653", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878870", "permID": "19548461", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 24, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "mt dora", "parentID": null, "userDisplayName": "Rick Gage", "commentTitle": "<br/>", "commentBody": "I'm not sure that those who support Trump understand the depths they have descended to in order to stand behind this man. People I have known, admired and, in some cases, loved have now entered into a pact with someone I consider, not just ill equipped to be president, but a con man easily recognizable to someone with half a brain or half a heart. How can you ever take seriously someone who tells you to respect their opinions, their religious convictions or their intelligence when they will, willingly, toss all that aside for a charlatan with the letter \"R\" on his chest. People who told me Bill Clinton didn't pass their moral litmus test now embrace a thrice married, ungenerous, unchristian Pharisee. People who swore to me that the Republican party was the home of sober judgement, fiscal responsibility and grownup solutions now defend a party led by a five year old with, what appears to be ADHD. And, sadly, those who I thought were smart turned out just to know a lot of words. I'll recover from Donald Trump, just fine, on Nov. 9th but my opinion of those that stood with him will, forever, be in intensive care.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471724868", "commentID": 19548461, "userID": 64318277, "recommendations": 2712, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19548461}, {"approveDate": "1471760674", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471757075", "permID": "19548696", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "usa", "parentID": null, "userDisplayName": "pam", "commentTitle": "<br/>", "commentBody": "I am more concerned about the 11 million people who follow Trump on Twitter, than the 11 million immigrants he wants to force out of our country. His twitter followers are a bigger threat to democracy and this country's values than immigrants fleeing Mexico and Syria for a better life here.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471729585", "commentID": 19548696, "userID": 26679436, "recommendations": 1619, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19548696}, {"approveDate": "1471765967", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471791225", "permID": "19549199", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "For all those who have supported the most vile, divisive, racist candidate for the presidency since George Wallace, how indeed will they recover? <br/><br/>When will they begin to realize the odious Trump brought out their baser instincts, conjured up hostile feelings of fear and loathing of their fellow citizens, that this was done purposefully by a candidate who played on those fears, churned his pot of hate of his fellow Man till it reached the boiling point, for the egotistical purpose of getting gullible low information poorly educated voters to support his greedy need, to indulge his narcissism with a cavalierly approach to the world of politics, as if he were hawking another one of his garish baubles of snake oil.   <br/><br/>Can America recover? Yes, most of us were never fooled by this odious excuse for a human. He has been plying his dishonest, deceitful wares about NYC for decades. We New Yorker's who know him best know him to be the last person anyone of reason would ever consider a viable candidate for the most powerful job in the world. Heaven forbid.<br/><br/>For the ones who will support this buffoon to the bitter end, who will go into the bunker with him on the eve of November the 8th, I don't know if they ever will recover. They are the ones who will have to explain to their children and grandchildren how they could have been so blind to vote for such a con artist. They will live knowing they were on the wrong side of history.<br/><br/>DD<br/>Manhattan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471735525", "commentID": 19549199, "userID": 22528152, "recommendations": 772, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549199}, {"approveDate": "1471766299", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471762699", "permID": "19549276", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Australia", "parentID": null, "userDisplayName": "KG", "commentTitle": "<br/>", "commentBody": "It is frightening to witness the amount of support that an egomaniac like Trump has in America.  Looking at things from the other side of the world, most Australians are shaking their heads and saying \"what is going on in America?\"; \"why is Trump even being considered appropriate for high office when he is clearly unfit for the job?\";  \"why do so many people embrace his racist, misogynistic, ignorant views\"?  <br/><br/>These are just some of the questions that will need to be seriously looked at and answers sought after Hillary is your next President.<br/>And it's thoroughly dishonest for Republicans to blame everything on '8 years of Obama'. <br/><br/>My son lives in America, married to an American and I travel over there regularly.  I'm deeply saddened to see the ugliness of Trumpism emerge. However, I've always been impressed by the optimism and energy of Americans and believe that Trump will, ultimately, be the Big Loser in November.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7378/0116/cropped-73780116.jpg?0.9738556914297953", "createDate": "1471736081", "commentID": 19549276, "userID": 73780116, "recommendations": 820, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549276}, {"approveDate": "1471770688", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878283", "permID": "19549448", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Detroit", "parentID": null, "userDisplayName": "Ed Jones", "commentTitle": "<br/>", "commentBody": "Trumpism is incorrectly portrayed in this editorial as a thing-in-itself; as a cause and not a product. The proposed cure? A change of heart on the part of post-election Republican moderates that have been shown the error of their capitulation to anti-democratic moods. More to the point is to ask the question - where have those moods sprung from? How has such an obvious fraud as a billionaire friend of the \"little people\" gotten more traction than the universal derision and howling incredulity it deserves? How about a closer look at the historical facts? Let me name just a few: the failure of Johnson's 1964 War on Poverty, Nixon's 1968 embrace of segregationists in his Southern Strategy, the Rehnquist court's 1972 obliteration of Brown v Board of Education in Bradley v Milliken, the death of the American labor movement with the cowardice of the AFL-CIO in the defeat of the 1980 PATCO strike, Clinton's 1990's assault on those most marginalized - welfare recipients, the wars in Iraq and Afghanistan, and the financial collapse of 2008 enabled by banking deregulation coupled with the economic non-recovery and the simultaneous enrichment of hedge fund managers, et al. Yes - there is a lot of blame to go around and not on a few occasions has the NYT been complicit over the last 50 years in the shielding of bad actors. Before you get too sanctimonious, honest reporting requires that you dig a bit deeper in your attempt at uncovering cause and effect.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471737356", "commentID": 19549448, "userID": 74076285, "recommendations": 499, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549448}, {"approveDate": "1471772176", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471788612", "permID": "19549985", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn", "parentID": null, "userDisplayName": "James Demers", "commentTitle": "<br/>", "commentBody": "Four years from now, the \"angry while male\" demographic that Trump is exploiting will still be male, and still be white -- and Fox \"News\" and the rest of the the right-wing media will see to it that they're still angry.  Let's not forget that what the GOP offered as their second choice for president was the equally repellent Ted Cruz.  Trump was an aberration - a hitch in their plans - but Ted and the GOP, and the angry white bigots they count on for votes, will definitely be back.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471741269", "commentID": 19549985, "userID": 70245222, "recommendations": 1098, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549985}, {"approveDate": "1471772240", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471788662", "permID": "19550010", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hilo. Hawaii", "parentID": null, "userDisplayName": "Moonlight Lady", "commentTitle": "<br/>", "commentBody": "Trump has uncovered the ugly underbelly of racist America.  It will be difficult to cover it up again, but maybe that is not the answer.  Maybe the answer is for all Americans to look it square in the face and deal with it by speaking up every time it is encountered.<br/>Maybe the reveal will help us teach our children that everyone is just human beneath their skin of whatever color.  If we begin that process, maybe in two or three generations, when all the present racists are gone and fewer are around, we can begin to heal.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1145/8995/cropped-11458995.jpg", "createDate": "1471741524", "commentID": 19550010, "userID": 11458995, "recommendations": 331, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19550010}, {"approveDate": "1471772670", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878862", "permID": "19550172", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charleston, WV", "parentID": null, "userDisplayName": "Didier", "commentTitle": "<br/>", "commentBody": "Don't be fooled looking at the reflection in the mirror.  Donald Trump is merely the reflection.  Alienated and disaffected white and less-educated voters who are  the core of his supporters are the real story.  They feel threatened because they are increasingly marginalized in a more diverse and technologically complicated world.  Their lower-skilled jobs that haven't been transferred to developing economies are increasingly assumed by non-white workers which further depresses their wages.  They think that by building a wall around America; deporting the non-white competitors for their jobs; and imposing tariffs on imports, their lower-skilled jobs will return and their wages will grow.  History proves they are wrong.  Their anger won't go away after November and either Trump or someone else will champion them, but the train has left the station and it is never coming back.  The sooner they can accept the new reality, the sooner they can hopefully start moving forward.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5021/0704/cropped-50210704.jpg", "createDate": "1471742811", "commentID": 19550172, "userID": 50210704, "recommendations": 366, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19550172}, {"approveDate": "1471775142", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471788700", "permID": "19549825", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Colorado", "parentID": null, "userDisplayName": "just Robert", "commentTitle": "<br/>", "commentBody": "Immigration reform?  Effective reform of the ACA?   Working with Democrats<br/>or anyone else to repair our infrastructure or higher education system? Republicans have shown through their treatment of president Obama that none of this matters.<br/><br/>Republicans are just sitting back hoping they can weather the Trump storm then continue their covert efforts to enforce their own brand of bigotry.  The House has always been the key.  No matter who sits as President they hope to control him or her with threats to shut down the government or just say no to anything.<br/><br/>In the end it doesn't matter to them whether the president is Trump, HRC or Sanders  they have a long term plan to control the demographic shifts happening in this country and threats to their power.  Most of this is done quietly at the state level and in the House.  So if we want any sort of change it as Republicans have learned it must happen at the grass roots and Democrats have a lot to learn.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471740027", "commentID": 19549825, "userID": 48063402, "recommendations": 434, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549825}, {"approveDate": "1471775216", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471771616", "permID": "19549847", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn, NY", "parentID": null, "userDisplayName": "Richard Grayson", "commentTitle": "<br/>", "commentBody": "The genie is out of the bottle. Pandora has opened the box. The Rubicon has been crossed. Whatever stale metaphor you use -- I prefer the more sublime poetry of Yeats' \"The Second Coming\" -- there is no going back before the Trump march to the Republican nomination for President 2016. In my lifetime, the U.S. will never be the same again. The damage to Madisonian democracy and public discourse has been done. Four years from now we may be looking with 2020 hindsight at the time before this year's presidential campaign and wondering how a man who promised to make us great again found the soft spot under the belly of our culture and let loose many of us who love to hate.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5060/5484/cropped-50605484.jpg?0.16325811303784576", "createDate": "1471740163", "commentID": 19549847, "userID": 50605484, "recommendations": 289, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549847}, {"approveDate": "1471775280", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471788669", "permID": "19549866", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "This editorial confuses cause and effect. I don't think that Trump created the bigotry and nativism we see abroad. He simply identified it and gave voice to that skein of hatred and racism that the Republican part has quietly exploited since the days of Nixon. I view Trump as a form of creative destruction because his idiotic proclamations are impossible to ignore. He has substituted a bull horn for the dog-whistle. His candidacy will serve as a wedge to fray the unholy trinity that is the modern Republican party: racism, religious fundamentalism and economic conservatism. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471740353", "commentID": 19549866, "userID": 10924140, "recommendations": 449, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19549866}, {"approveDate": "1471775478", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471771878", "permID": "19552775", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "SouthernView", "commentTitle": "<br/>", "commentBody": "There is a question about whether Republican leaders will put their country above party and clean up Trump's toxic waste? Our two most powerful elected Republicans, Speaker Paul Ryan and Senate Republican leader Mitch McConnell have already given us the answer: a resounding \"no.\" After over a year of Trump's poisonous diatribes, and a month past his formal nomination, Ryan and McConnell have not wavered in their support for his candidacy. <br/><br/>Now, four days after Trump appointed the noxious alt-right extremist Bannon as his campaign chief, Ryan and McConnell remain steadfast in their support of Trump as president, thereby sending the clear message that they support putting Breitbart's extremism in the forefront of the Republican Party's agenda. And never forget:Ryan and McConnell also believe Sarah Palin is fully qualified to be president. What enlightenment can be expected from these two?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471774160", "commentID": 19552775, "userID": 17933355, "recommendations": 795, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19552775}, {"approveDate": "1471776667", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471773067", "permID": "19550208", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland", "parentID": null, "userDisplayName": "LFremont", "commentTitle": "<br/>", "commentBody": "For one thing, make government reforms. Gerrymandering  of Congressional districts, for example, make  many elected offices not really contestable by the opposing party thus making congressmen answerable to their political party, rather than the electorate.  It's easy to get cynical about \"big government\" when it seems out of control.  Donald Trump and the other \"outsiders\" who ran made some valid points and if people don't see some reforms I can imagine the same thing will happen next election cycle.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471743059", "commentID": 19550208, "userID": 27797828, "recommendations": 114, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19550208}, {"approveDate": "1471776722", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471791199", "permID": "19550237", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "JW", "commentTitle": "<br/>", "commentBody": "NYT: Give us a break. Please.<br/>The Alien and Sedition Act of 1798.<br/>The killing of a former US Secretary of the Treasury by a former Vice President of the US in a duel.<br/>The murder and ethnic cleansing of tens of thousands of Native Americans.<br/>The Confederacy, institutionalized slave labor and a Civil War that cost more lives than WWI, WWII, Korea and Vietnam combined.<br/>The 1920s when the Ku Klux Klan had a membership of over 3 million -- now down to 5000 by most recent estimates.<br/>Huey Long.<br/>Father Coughlin.<br/>Joseph McCarthy.<br/>And we're still here democratic warts and all towards the end of the second term of office for the first Black president in US history and soon the first woman president in US history.<br/>Give it rest, guys!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471743283", "commentID": 19550237, "userID": 48184428, "recommendations": 170, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19550237}, {"approveDate": "1471777328", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471773728", "permID": "19550405", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Indiana", "parentID": null, "userDisplayName": "Salim Akrabawi", "commentTitle": "<br/>", "commentBody": "Let me tell you about the story of 3 young Moslem Arab men who arrived in the United States in the mid 1960s seeking knowledge from the greatest universities in America and graduated with doctorate degrees in sciences. One was plucked by DuPont company and after a life long career retired in the mid 2005, the other became an academician and just retired as a full professor and the third continued his education, graduated from Vanderbilt School of Medicine and practiced for almost 40 years saving lives and treating the sick. Our children are physicians, bankers, software engineers, teachers and social workers. Some are Christian, some are Moslems and some are agnostics. They are as Americans as apple pie. This is our country and nothing that Mr. Trump or his followers say or do will ever make us regret the decision we made to stay here, marry, raise our American born children and grandchildren, contribute and prosper. We are all saddened by what Mr Trump and his followers say about us but we believe the majority of our American fellow citizens don't share their bigotry and hate and we cherish the ever present support of our relatives, neighbors, colleagues and communities in this great country of ours.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471744560", "commentID": 19550405, "userID": 61403986, "recommendations": 1191, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19550405}, {"approveDate": "1471784979", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878216", "permID": "19551240", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Johndrake07", "commentTitle": "<br/>", "commentBody": "This is a joke. What is there to recover from? \"Trumps America\" has been around for a few centuries, as has \"Hillary's America\"…the core belief's of this country haven't changed, only the labels we have given them. Democratic racism and Republican racism have gone hand in hand for two hundred years. Democratic and Republican militarism hasn't changed. Democratic and Republican corporatism hasn't changed. The media and public's focus shifts depending upon who is in power and which media outlet is kowtowing to them for advertising bucks. <br/><br/>What this country really needs to be concerned about is the growth of elite wealth at the expense of EVERYONE else. We have a systemic problem that cannot be rectified - unless there is top down change. Call it revolution. Call it whatever. But you have to nip the top rot in the bud and replace it with a more egalitarian and truly democratic system. <br/><br/>But the status quo doesn't allow change - it only allows for an arrangement of the chairs in the room. Once year Big Dog. Next Year Obama. Following year Bush/Cheney/Rumsfeld. It all depends upon what political agenda needs to be fulfilled and which military industrial corporation will profit from this agenda. We no longer control this country. We are spectators who have no power but are allowed to sit back and watch what unfo;lds like some youtube video on our idiotic iphones and social media. <br/><br/>And, with the Hillary Brand® its only going to get worse.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471750631", "commentID": 19551240, "userID": 60397338, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19551240}, {"approveDate": "1471786143", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471782543", "permID": "19551541", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Medford Ma", "parentID": null, "userDisplayName": "Milliband", "commentTitle": "<br/>", "commentBody": "As scary as Trump is he will be dealt with in the coming election with such force that I would wager that Trumpism could very well be consigned to the dustbin of history, or at least the permanent  political margins.  A more serious threat is that of Mitch McConnell, who would use Senate rules to block and negate any possible Democratic majority, and might be one of the most dangerous men in our history in subverting the popular will. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471753654", "commentID": 19551541, "userID": 19111801, "recommendations": 254, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19551541}, {"approveDate": "1471787020", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471791213", "permID": "19548651:19552093", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": 19548651, "userDisplayName": "Salim Haider", "commentTitle": "<br/>", "commentBody": "Amen, brother!  What the liberal, agenda-driven pundits at the NY Times and their followers and like-minded ilk fail to understand is that this election is really not about Republicans and Democrats.  This election is NOT about Republicans and Democrats - it's about the elite versus the masses.  Trump represents the masses - and Clinton the elite.  The elite will lose - just like what happened with Brexit.  This will include a lot of \"elite\" republicans too like Mitch McConnell etc.  <br/><br/>I live in California - and in a town that is almost 100% liberal democrat (as am I).  In 2008, and 2012, every house had an Obama/Biden sign and a Kerry/Edward sign in 2004.  This year, I spotted just one (gasp!) - just one sign for Clinton.  That can only mean that everyone's afraid to put Trump signs on their yards, but in private discussions, many have told me \"we're not voting Hillary - and likely won't vote at all\".  <br/><br/>I think secretly, many here in CA are going to hit the Trump button.  It is not that far fetched to think of Trump carrying CA.  Or NY.  Or PA, NJ, OH, IA, WI, MI, CO, NH, etc.  <br/><br/>I am appalled at the notion of a Trump Presidency, but Hillary is a terrible candidate for this day and age.  Sadly, I think she'll lose in the landslide.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471760284", "commentID": 19552093, "userID": 34123709, "recommendations": 26, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19552093}, {"approveDate": "1471788464", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471784864", "permID": "19552159", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salem, Oregon", "parentID": null, "userDisplayName": "Bob Woods", "commentTitle": "<br/>", "commentBody": "The answer is \"no.\" No matter what happens.<br/><br/>The soul of the country is irretrievably stained.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5319/3353/cropped-53193353.jpg?0.3308368163792843", "createDate": "1471761511", "commentID": 19552159, "userID": 53193353, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19552159}, {"approveDate": "1471788696", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471785096", "permID": "19552712", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta, GA", "parentID": null, "userDisplayName": "here2day", "commentTitle": "<br/>", "commentBody": "Calling people bigots and accusing them of being haters is not the way to get over Donald Trump.  Although I hope the Democrats sweep everything, not every word spoken by Trump or his followers is stupid.  Some of it makes good common sense.  After the election, it would do us well to acknowledge that.  Moreover, I believe that with over 300 million folks populating the U.S., why do we still have to be lifeboat America?  I think that time is finished. . . . . . . . . .  What we need to think about is overpopulation.  ", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471773429", "commentID": 19552712, "userID": 38447552, "recommendations": 54, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19552712}, {"approveDate": "1471788908", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471786459", "permID": "19552980", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NH", "parentID": null, "userDisplayName": "Sajwert", "commentTitle": "<br/>", "commentBody": "Mitch McConnell's famous remark that the job of the Republicans in congress was to work hard to make sure Obama was a one term president didn't work very well, did it.  But the anger and the downright hate that prompted that statement lasted for 12 years.  Almost nothing has been done by the Republicans in congress except to deny any possibility of compromise and getting something done.<br/>Does anyone in their right mind believe that things are going to change if Clinton wins the presidency?<br/>The GOP birthed Trump.  They laid the framework for his bigotry, racism, mysogyny, his warped version of what a christian is, his support by whites only attitudes, his intentions to destroy all that America has tried to do that was decent and right.<br/>I think America is going to have more than 12 years ahead of them to try and root out the evils that have been allowed to fester and to grow for so long.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471776415", "commentID": 19552980, "userID": 38498973, "recommendations": 125, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19552980}, {"approveDate": "1471789314", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471785714", "permID": "19549940:19553164", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Bruce Rozenblit", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "worcester county, ma", "parentID": 19549940, "userDisplayName": "sharon", "commentTitle": "<br/>", "commentBody": "Bruce-\"Let's face it. People are not rational. Most do not have towering intellects. Most don't analyze their way through life. They feel their way their way through life. Being an analytical nerd will not make you the life of the party.\"<br/>What a sad commentary on our society. People keep blaming the education system but when one looks at Trump's rallies there is an awful lot of boomers in the audience. How many generations back do we keep scapegoating teachers and our education system. I'm 57.  Many of my teachers are dead. Are they still blamed for this willful ignorance of an angry electorate that doesn't even know what it is angry about? I keep reading that the median income of Trump supporters is around 80K. Hardly the poor and \"disenfranchised\" I keep hearing about. To quote Steve Earle \"you have two of everything but you think that you are down and out.\" Most of my friends are Trump supporters. None are anywhere near poor and some are quite financially well off. I don't know what drives their anger. I do know that they stubbornly support their candidate and totally dismiss any evidence that tarnishes his image. They are very quiet in their defense, almost like they are embarrassed by defending the indefensible but they still will vote for the indefensible hate-filled Trump. The willful ignorance is frightening. Does their inability to admit they were conned overcome their ability to do what is right for our country? Will they vote for this despot out of stubborn pride?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471778074", "commentID": 19553164, "userID": 57543070, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19553164}, {"approveDate": "1471789496", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471785896", "permID": "19553309", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Austin", "parentID": null, "userDisplayName": "Kevin", "commentTitle": "<br/>", "commentBody": "Before we satisfy ourselves that this dark cloud is going to safely drift by, I think it would be wider to wait until election day to start making plans about \"recovery\".", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471779052", "commentID": 19553309, "userID": 12285180, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19553309}, {"approveDate": "1471794429", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471878278", "permID": "19554900", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "dbb", "commentTitle": "<br/>", "commentBody": "Let's be fair:  many, not all, from the dust bowl, rust belt, and Appalachia saw factories outsourced to include to Mexico ... many, not all, locals lost many of the few remaining jobs to illegal immigrants -- again many, not all-- coming from Mexico, and along with the impact on local culture and schools, etc. Locals raised concerns but were labeled bigots and racists.  Really?   Trump likely will lose in November, and working class whites will be pushed further down.  They have no affirmative action, no trust funds, no NAACP, no La Raza, and make for ridicule from NYT readers. I'm sorry to say this, but U.S. elites are watering the seeds of possible future political instability.  Best to check your smugness.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471786868", "commentID": 19554900, "userID": 74633498, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19554900}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1339, "api_timestamp": "1488822334", "totalReplyCommentsFound": 459, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}