{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 1528, "totalEditorsSelectionFound": 31, "depthLimit": 0, "totalRecommendationsFound": 1507, "comments": [{"approveDate": "1470129127", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470147171", "permID": "19352017", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palm Beach, FL", "parentID": null, "userDisplayName": "Jane Maestro", "commentTitle": "n/a", "commentBody": "It was time for the republican party to die and Trump came along to do the job. A political party in power for only one reason, to disrupt and prevent the people's business from getting done does not deserve to exist let alone hold the Congress hostage. The party that decided when the president was elected to stop any and all of his programs to pass does not deserve to exist. A party that permits racists and sexists to take over does not deserve to exist. A party that is against women's healthcare choices and equal pay does not deserve to exist. Trump may be sickening to watch but the Republicans deserve him.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470128241", "commentID": 19352017, "userID": 15258149, "recommendations": 2038, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352017}, {"approveDate": "1470136277", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470685851", "permID": "19352441", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 42, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Warsaw, Poland", "parentID": null, "userDisplayName": "Michal Niedzielski", "commentTitle": "<br/>", "commentBody": "Perhaps it is also time for the Democratic Party to open to dialogue with those Republican leaders who actually stay true to their values - to not be condescending or arrogant but to openly discuss what is best for the future of the country (and who knows, perhaps even convince them, or the other way around). A fascist candidate has emerged - the issues that brought the United States to this point ought to be addressed and resolved, and the people who feel desperate enough to vote for such a candidate should be brought into the political process, their concerns understood. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470133705", "commentID": 19352441, "userID": 69561922, "recommendations": 1317, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352441}, {"approveDate": "1470136458", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470132858", "permID": "19352452", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 25, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "Marc Rabinowitz", "commentTitle": "<br/>", "commentBody": "Mr. Trump has done a fine job of disclosing his views of how to make America Great Again. In my opinion these views go against what makes America great. Their are many voices deploring Mr. Trump so we are not short Trump critics. Off the top of my head we have Romney, Buffet, Bloomberg, Cuban and the absence of endorsements by former Republican Presidents. We have McCain, Ryan and McConnell castigating Trump for his blatant racism. This makes for interesting articles but these people all only have one vote. So in my mind the question and articles we should be asking is how did such a deplorable person achieve so many votes to win the Primary. He didn't lie about his intent and his intent and comments have been properly disclosed for what they are.  The real story here is what nerve has he connected with and how are we going to help those with such a poor view of what makes America great understand that Mr. Trump is not the answer. This is not about the Republican leadership but about the Republican citizens who exercised their constitutional privilege of voting. My question is why have they voted for Mr. Trump, a narcissistic skin thin individual who makes fun of others for his own benefit. Who are my fellow citizens that believe this is what is best in America. Come November if enough of them exist the greatest country in the world will become a place few will recognize. Bashing Trump has proved ineffective so we need a Plan B or their is a possibility of a Trump presidency", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470133757", "commentID": 19352452, "userID": 63530327, "recommendations": 1666, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352452}, {"approveDate": "1470137655", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470134055", "permID": "19352492", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Gothenburg", "parentID": null, "userDisplayName": "Erik", "commentTitle": "<br/>", "commentBody": "\"Mr. Trump seemed confused about Russia’s 2014 annexation of Crimea and its efforts to wrest other parts of the country from Ukraine’s control. “He’s not going into Ukraine, O.K., just so you understand,” Mr. Trump said, apparently unaware that Mr. Putin sent troops there two years ago...\"<br/>As a citizen in a country close to Russia I listened to these statements by Mr Trump and it made me really, really scared. What me and my friends usually would be critical of when it comes to Republican candidates to the presidency is a tendency of (too much) hawkishness - the reflex to say that you just must send more troops to whatever world conflict there is going on. But Mr Trump is something much worse - he is ignorant and seems gladly to throw foreign security issues out of the window. He plays directly into the hands of an increasingly authoritarian ruler, Mr Putin. How can the party of Ike and Reagan come to nominate a guy with these views and this type of agenda?", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470134080", "commentID": 19352492, "userID": 57008519, "recommendations": 1446, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352492}, {"approveDate": "1470142486", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470138887", "permID": "19352575", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Asheville NC", "parentID": null, "userDisplayName": "Ray Gibson", "commentTitle": "<br/>", "commentBody": "We are condemned to act out this sad, once unimaginable farce. I have convinced myself this self obsessed vulgarian will lose, and that in the months to come a majority of the voters will become so disgusted that they will reject him. But even in that best of results we will emerge damaged as a country. If those honorable few in the Republican establishment would reject Trump and what he stands totally, then the healing could begin. But no, they will continue to support him in hopes of salvaging as much of their power as possible. They are not going to turn their back on the basest elements of his support or what they stand for - racism, bigotry, and guns. They need them to retain the regional power that allows them to hold onto congressional and state power. Trumpism is not going to be their past, it is their future. They will just repackage it in a more attractive, less raw and honest, message. And Donald Trump will be with us forever, an even larger presence in our shallow celebrity driven culture.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470134661", "commentID": 19352575, "userID": 50168457, "recommendations": 788, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352575}, {"approveDate": "1470142600", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470139000", "permID": "19352580", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ithaca ny", "parentID": null, "userDisplayName": "Deborah", "commentTitle": "n/a", "commentBody": "There's another story out today showing that stubborn, self-interested, and divisive Republican strategies have backfired. <br/><br/>It's being reported that a number of lower courts have roused themselves to challenge discriminatory state voting laws since Anthony Scalia's death and the consequent 4-4 split in the Supreme Court ... a 4-4 condition engineered by intransigent Republicans. <br/><br/>The GOP  wants a strong man for the presidency? Great! They get Donald Trump, a mean, petulant baby in gilded diapers. They want to block Obama's (constitutional) right to nominate a Supreme Court justice? They get a 4-4 court, and that leads to results they didn't predict. And it doesn't look like RBG is ready to retire soon. <br/><br/>(Ah. Oedipus. The Greeks grasped irony. If one tries  hard to avoid one's deserved fate there's no doubt you're racing straight at it.)<br/><br/>Such ironies must damage and upset the (gutless) guts of Republican pols. Think: backfire. Think: pain in the belly. <br/><br/>But they give me ... a Democrat, readily amused .... a healthy appetite and longer nights of quiet sleep. <br/><br/>Maybe there is a god.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470134696", "commentID": 19352580, "userID": 34373870, "recommendations": 667, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352580}, {"approveDate": "1470142652", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470139052", "permID": "19352587", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Martin", "commentTitle": "<br/>", "commentBody": "Of course the Republicans only criticize Trump when he insults people or advocates racist or discriminatory policies.  Which only helps him with his supporters, because in their fantasies he's this honest maverick standing up to ''political correctness.''  They rarely criticize him for the ignorance and falsehoods about the world situation, or about his own past, that fill every speech he makes.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1168/1479/cropped-11681479.jpg?0.8069487004540861", "createDate": "1470134721", "commentID": 19352587, "userID": 11681479, "recommendations": 634, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352587}, {"approveDate": "1470142737", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470139137", "permID": "19352598", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London, England", "parentID": null, "userDisplayName": "Londoner", "commentTitle": "<br/>", "commentBody": "The most perplexing thing to me remains the comfort of the Republican leadership over Donald Trump having access to the nuclear codes. Does the thought never cross their mind when they tuck their children in at night, that this man is utterly unequipped with the temperament or judgement to hold such grave responsibility?<br/><br/>The Republican campaign of 2016 will go down in history as a permanent stain on the Republican Party and on the nation. It will be unsparing on the character of those who stood by and did nothing to intervene.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470134849", "commentID": 19352598, "userID": 66370021, "recommendations": 1202, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352598}, {"approveDate": "1470142857", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470139257", "permID": "19352613", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Martin Alter", "commentTitle": "<br/>", "commentBody": "It is the rare Republican who is prepared to repudiate Trump.  They will run from his remarks; they will claim he doesn't represent their views; they will wring their hands.  But they fail to withdraw their support.  And they won't withdraw their support until they feel it will harm their own political lives.  As regards the Khan family, and on so many other issues, Ryan, McConnell, Ayotte and even John McCain are proving themselves to be significantly less than profiles in courage.  Perhaps profiles is pandering is the more appropriate term.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470134962", "commentID": 19352613, "userID": 46589542, "recommendations": 884, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352613}, {"approveDate": "1470143624", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470151994", "permID": "19353674", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 27, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Diogenes2014", "commentTitle": "<br/>", "commentBody": "I am certain that Hillary will be an inept and ineffective President whose pandering, lying and propensity to lead by mindless polls rather than heartfelt principles have the potential to complete the rudderless journey to the destruction of the American experiment.  I was absolutely convinced that I could never vote for her. Donald trump has unearthed many of the issues that have touched the nerves and hearts of the American people and I was seriously considering voting for him; hoping that he was not the narcissistic buffoon that I thought he was prior to the campaign.  Despite his innumerable schoolboy tweets, I kept looking for him to learn and mature as he cashed in on his unprecedented, golden opportunity to \"Make America Great Again\".  After his adolescent, unconscionable lunacy in attacking a \"Gold Star Mother\" and a fire marshall, it is irrefutable that he is incapable of acting like a \"big boy\" and will never be anywhere near \"Presidential\".  This election was his to win easily and he blew it!  If he really wants to make \"America Great Again\", he should realize that he cannot do the job, graciously withdraw and pave the way for a qualified Republican to run.  Before you start laughing at my maniacal pipe dream, please realize that it's early in the morning and I just woke up after having a bunch of scary nightmares; none of which was more terrifying than the specter of a Trump or Hillary presidency.     ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470140175", "commentID": 19353674, "userID": 66140276, "recommendations": 96, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19353674}, {"approveDate": "1470143779", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470140179", "permID": "19353117", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salt Lake City, Utah", "parentID": null, "userDisplayName": "Andrew G. Bjelland, Sr.", "commentTitle": "<br/>", "commentBody": "Our last GOP president left much to be desired in intelligence, knowledge, curiosity, experience, language skills and a focused interest in governance.<br/><br/>To my mind and to the mind's of many others, the presidency of George W. Bush was a major disaster, with respect to both foreign and domestic affairs, that this nation could ill afford and from which it has yet to recover.<br/><br/>The current GOP nominee, Mr. Trump, throughout this campaign has evidenced his own peculiar deficiencies in intelligence, knowledge, curiosity, experience, language skills and focused interest. In addition to all of these deficiencies, Mr. Trump, as his responses to the Khan's have so blatantly demonstrated, manifests a malignant narcissist's total lack of empathy and sympathy.<br/><br/>Would anyone in his/her right mind want to sit down and have a beer with this man?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470137576", "commentID": 19353117, "userID": 58063917, "recommendations": 484, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19353117}, {"approveDate": "1470143877", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470140277", "permID": "19353139", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Asheville, NC", "parentID": null, "userDisplayName": "Terry Neal", "commentTitle": "<br/>", "commentBody": "if it weren't so tragic that he's wanting to be my President, I might actually feel a tinge of sympathy for Mr. Trump. But he wants to be a powerful world leader and instead he presents himself as something akin to a sociopath. He sees no reason for being attacked by foreign policy strategists because he wants to have a warm and fuzzy relationship with a demagogue like Putin. Instead of grieving with parents who lost a son to war he responds to their anger with vitriol, begging for sympathy because he's being \"viciously attacked.\" It's one thing to avoid war with deferments but quite another to rub veteran's noses in it with pleas of self righteousness. It's becoming painfully obvious, if it wasn't already, that we can't afford to have such a thin-skinned bigoted bully as our leader. I've lived through some odd presidential elections, and had doubts about several candidates who made it to election day. But Mr. Trump makes me more than a little worried that if he is elected leader, it will not be safe to move to Canada or New Zealand (as Justice Ginsburg remarked), for by 2020 he will have offended every friend and befriended every enemy and our democracy, our way of life will never be the same.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2284/1158/cropped-22841158.jpg?0.992933010449633", "createDate": "1470137693", "commentID": 19353139, "userID": 22841158, "recommendations": 466, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19353139}, {"approveDate": "1470143937", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470140337", "permID": "19352627", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Eastham, MA", "parentID": null, "userDisplayName": "Daset", "commentTitle": "<br/>", "commentBody": "The irony that a war hero who was Muslim, and his Gold Star family are doing more to derail the Trump campaign than any single or group of candidates could is just too beautiful for words.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4019/5285/cropped-40195285.jpg", "createDate": "1470135033", "commentID": 19352627, "userID": 40195285, "recommendations": 1619, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352627}, {"approveDate": "1470144494", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470140894", "permID": "19352717", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tillson, New York", "parentID": null, "userDisplayName": "Ken", "commentTitle": "<br/>", "commentBody": "When the Khans spoke at the Democratic Convention it was about immigration. Their son immigrated to this country at two years old, joined the army and died in the line of duty. He was proof that one could be a Muslim and a patriot and that the country shouldn’t ban an all members of a particular religion.<br/><br/>When Donald Trump commented upon the Khans, it no longer was about immigration or Islam. It no longer was about terrorism or security. He changed the nature of the debate. After Trump’s comments it was about respect.  The president is the person who might ultimately put American troops in life threatening situations. How could we possibly entrust this responsibility to a Commander-in Chief who doesn’t understand the sacrifice made by Gold Star families?  For this reason alone, Trump is not qualified to be president and should lose the support not only of any Republican but any decent, thinking, respectful voter as well.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470135591", "commentID": 19352717, "userID": 42901451, "recommendations": 888, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352717}, {"approveDate": "1470144726", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470141126", "permID": "19352740", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westchester, NY", "parentID": null, "userDisplayName": "Michael Steinberg", "commentTitle": "<br/>", "commentBody": "Trump’s “good brain” is incapable of understanding anything longer than 140 characters.  Actually, reduce that to two characters.  His binary code: “I” or “Me.”", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5885/2258/cropped-58852258.jpg?0.5861089222598821", "createDate": "1470135709", "commentID": 19352740, "userID": 58852258, "recommendations": 441, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352740}, {"approveDate": "1470144938", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470141338", "permID": "19352776", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Port Washington", "parentID": null, "userDisplayName": "FrankWillsGhost", "commentTitle": "<br/>", "commentBody": "I have to admit, I had a lot more respect for Ted Cruz when he told his party to vote their conscience and he did not endorse Trump.  That took courage to do that in front of the world and 16,000 hostile, angry, Republicans", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3573/655/cropped-3573655.jpg?0.7300491880939974", "createDate": "1470135894", "commentID": 19352776, "userID": 3573655, "recommendations": 485, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352776}, {"approveDate": "1470145643", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470142043", "permID": "19352885", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "MIckey", "commentTitle": "<br/>", "commentBody": "You are dreaming.<br/><br/>This is the same political party that gathered around Mitch McConnell and chose racism over patriotism.<br/><br/>Over and over again.<br/><br/>And you want THIS party to stand up to Trump?<br/><br/>Trump represents his party perfectly.<br/><br/>The only difference between Ryan, McConnell and the Republican Party and Trump is that Trump is louder.<br/><br/>Not meaner (check out the government shut down over health care that the Republicans knew in advance wouldn't work) (check out the Supreme Court nominee that they won't even talk to because THAT MAN chose him) .<br/><br/>Check out the demeaning things other Republicans have said about Obama, Muslims, Mexicans before Trump made it his call to trumpet the Republican hidden racist agenda ... proudly.<br/><br/>Mr. Trump and Spineless Republicans?<br/><br/>Nonsense, they've all been on the same page, reading from the same playbook since McConnell created his Party of No.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470136503", "commentID": 19352885, "userID": 36997138, "recommendations": 1161, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352885}, {"approveDate": "1470145778", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470142178", "permID": "19352896", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Central Connecticut", "parentID": null, "userDisplayName": "Sharon from Dallas", "commentTitle": "<br/>", "commentBody": "Mr. Trump already sets an example for the country and the future of the Republican Party. A bad example. It would take a lot of political courage for Senator McCain, Senator McConnell, and Speaker Ryan to withdraw their support, but if they value their country over their party, they'll do it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470136557", "commentID": 19352896, "userID": 56806714, "recommendations": 242, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352896}, {"approveDate": "1470145885", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470142285", "permID": "19352918", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Billybob", "commentTitle": "<br/>", "commentBody": "If nothing else, the Trump candidacy has revealed how many political cowards are lurking within the GOP. But perhaps the something else is more frightening. Trumps popularity has revealed how many American citizens have \"black souls\". He has successfully plumbed the depths of hate, anger and bigotry. He is really good at bringing out the worst in people.<br/>And the very worst part of all this is that Donald Trump as the Republican nominee to be President of the United States (yes, I just typed that, hard to do as it is) gives cover and legitimacy to racism, sexism and all kinds of despicable attitudes that most people would have never displayed in the past. He is authorizing a horror. I don't believe in angels or devils...but maybe I should.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3304/2661/cropped-33042661.jpg?0.532899038400501", "createDate": "1470136652", "commentID": 19352918, "userID": 33042661, "recommendations": 401, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352918}, {"approveDate": "1470145947", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470142347", "permID": "19352944", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "North Carolina", "parentID": null, "userDisplayName": "Jim", "commentTitle": "<br/>", "commentBody": "McCain spent five years in a POW prison, was tortured, and locked away for two of those years in solitary ... and refused to give in and be allowed to leave earlier, just on principal. He has 10 times the force of will and character of Mitch McConnell and Paul Ryan. And he was mocked for that war record by the draft dodging Trump.<br/>And yet McCain himself won't withdraw his endorsement.<br/>It's highly unlikely his spineless cohorts will withdraw theirs either.<br/>\"Expediency\" has a new poster child.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470136770", "commentID": 19352944, "userID": 39324214, "recommendations": 446, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19352944}, {"approveDate": "1470146387", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470142787", "permID": "19355301", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Baltimore", "parentID": null, "userDisplayName": "Tom Blanpied", "commentTitle": "n/a", "commentBody": "What drives corruption in politics and stagnation in Washington? Greed. Lust for power, and lust for money. Trump supporters think they’re going to get a change and get someone on their side. But they’d get the opposite with him. He embodies that greed. They’d get someone who’s spent his life picking fights and bullying people just to get his way or to make more money. Look at the chaos that surrounds him—not just now in the campaign but for decades through his businesses. Fights, lawsuits, insults, defensiveness, childish mockery, blame. These are not politically motivated attacks—this is what he brings on himself because of how he wants to command the world around him. Only he would turn the rebuke from the parents of a soldier killed fighting for us into a playground brawl. Why expect anything else in the presidency? Except then, the power he would finally get to wield would be unimaginably greater than that he throws around through his army of lawyers so far. Other presidents have found the authority and instruments of such presidential force to be humbling. But certainly not Trump. There can be no doubt that he would use all the awesome tools at his disposal simply to fight his petty fights and pursue ever-greater power.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470145700", "commentID": 19355301, "userID": 71853769, "recommendations": 239, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19355301}, {"approveDate": "1470147547", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470143947", "permID": "19355515", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Richard Gordon", "commentTitle": "<br/>", "commentBody": "Its hard for me to understand why every American would not repudiate Mr. Trump.  Do American's realize what a threat he is to everything American?<br/><br/>America sits at the apogee of its power and influence in the world.  Unlike previous empires the world has seen that power and influence has not been won at the end of a gun.  The American Empire is unique in history because it has evolved through aspirational forces rather than imposed or compelled by a conquering power.  Japan, China, Europe even Russia and many of the middle eastern countries aspired to be like America.<br/><br/>Moreover, America's values of freedom, rule of law, free trade and co-operation are so effective and intoxicating in building wealth that even dictatorships have turned away from their former oppressive ways to embrace the American way of life.<br/><br/>Why then would anybody embrace Donald Trump's dark and oppressive vision of the world?  It will destroy the American miracle that has revolutionized the way we think and live.  It will systematically, dismantle the freedoms and prosperity that American's take for granted.<br/><br/>Worse yet, it appears that Donald Trump understand less about the world than Nicolás Maduro, the bus driver currently running Venezuela.   One only needs to look at the chaos and anarchy running rampant in Venezuela to get a  glimpse into America's possible future under Trump.  <br/><br/>Bad leaders like Trump are catastrophic for their societies.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470146340", "commentID": 19355515, "userID": 66098434, "recommendations": 303, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19355515}, {"approveDate": "1470147887", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470144287", "permID": "19353718", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Joe From Boston", "commentTitle": "<br/>", "commentBody": "The Cult of Trump has taken over the Republican Party.<br/><br/>If it is not already obvious, Donald Trump is incapable of changing.<br/><br/>He has said that he is the same person that he was when he was a school kid.  <br/><br/>Looking at his history and business record, it is clear that for his entire life he has done what he wanted to do, when he wanted to do it, right or wrong.  He ran his privately held companies as a fiefdom, with no attempt to control his behavior.  His \"advisors\" are his children, whom he listens to when it suits him.  He has said he listens to himself most of the time.<br/><br/>Plain and simple, he does what he thinks is good for him, however it affects others.  His ego does not permit him to let go of a controversy until he has \"crushed\" the \"opponent\" in his own mind.   That is why he goes after a Gold Star mother and a fire marshall for perceived slights. \"Losing\" seems to be some kind of a personal repudiation in his mind, so he battles on over  in winnable or trivial issues.<br/><br/>His lack of knowledge of history, world events, the US Constitution, and how the US government work are additional disqualifiers.<br/><br/>He isn't going to change. He isn't going to learn.<br/><br/>Normal people have to decide whether or not that is acceptable, because \"that is how it is.\"<br/><br/>I have concluded that Donald J. Trump is unquestionably unfit to hold any public office, and certainly not POTUS.  I am voting straight D, top to bottom, on November 8th.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4952/842/cropped-4952842.jpg?0.7945210032630712", "createDate": "1470140359", "commentID": 19353718, "userID": 4952842, "recommendations": 423, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19353718}, {"approveDate": "1470148930", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1470145330", "permID": "19353553:19354712", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta, GA", "parentID": 19353553, "userDisplayName": "Diane Eaton", "commentTitle": "<br/>", "commentBody": "So what you're saying is that when Donald Trump says he'll build a wall, that he doesn't really mean it.<br/>And that when he demeans a fallen soldier's parents, he doesn't really mean it.<br/>And when he invites Putin to hack into American databases, he's really only joking.<br/>And when he wants to build a wall across the US/Mexican border, he doesn't really mean it.<br/>And when he derides Sen. John McCain as a loser, he doesn't really mean it.<br/>And that when he refuses to show his tax returns, he has nothing to hide.<br/>And that when he wants to prevent one quarter of the world population from entering the U.S. and wants to economically isolate it from the rest of the world, in spite of the fact that the US economy is essential dependent on the rest of the world for its wealth, that he's got a bigger vision.<br/>And that when he talks about making America great again, he doesn't mean making America White again.<br/>And that when he backs up his grandiose claims by saying, \"Believe me,\" that he actually has brilliant plans and innovative ideas to solve some of the toughest and most complex problems our world has ever seen.<br/><br/>Sure. Right.<br/><br/>Which is it? Is he a delusional liar playing on the fears of the American public? Or is he simply a self-important, short-sighted, simple-minded, uninformed, power-hungry megalomaniac, obsessed with winning, who only wants to \"win\" the biggest prize in our country: the US presidency? What will he do if he does and he's no longer the center of attention? Abdicate? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470143990", "commentID": 19354712, "userID": 67942079, "recommendations": 385, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19354712}, {"approveDate": "1470149728", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470146265", "permID": "19356156", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "GwyneDD", "parentID": null, "userDisplayName": "Biochemist", "commentTitle": "<br/>", "commentBody": "It cannot be put better than this editorial comment: \"The truth is, it’s time for Mr. McCain and other Republican leaders to set an example for their party by withdrawing support for Mr. Trump.\"  If they don't they show they are exactly like Mr. Trump, constitutionally devoid of even a minimum sense of decency.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470148530", "commentID": 19356156, "userID": 55714098, "recommendations": 248, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19356156}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 2673, "api_timestamp": "1488822342", "totalReplyCommentsFound": 1145, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}