{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 11, "totalParentCommentsFound": 320, "totalEditorsSelectionFound": 12, "depthLimit": 0, "totalRecommendationsFound": 517, "comments": [{"approveDate": "1469930388", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469969335", "permID": "19330134", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, D.C.", "parentID": null, "userDisplayName": "Kirby", "commentTitle": "<br/>", "commentBody": "Reject the false choice presented in this editorial. Liberals wanting to make immigration a referendum on whether or not you're a xenophobe is as silly as when conservatives seek to make raising or lowering taxes a measure of whether you're for freedom or tyranny. <br/><br/>Immigration policy that focuses on the right skill sets in proper proportions helps make our economy more dynamic and our country more diverse. But too much stifles wages, tears at social cohesion, and puts enormous economic stress on small communities and lower classes. Calling for a reduction in immigration levels is not the same thing as being against immigration, and is certainly not the same thing as calling for a suspension of all immigration.  <br/><br/>You can't claim to be fighting for working people at the same time you're flooding communities with low skill labor from outside the country's borders. The economic mobility of those people who work with their hands for a living or lack college education will be stymied by this onslaught. It never ceases to amaze me how people can wrap their heads around \"outsourcing\" jobs to another country where labor is cheaper, but can't understand how rampant immigration, legal or otherwise, accomplishes the same feat.<br/><br/>I'm against drowning, too, but that doesn't make me anti-water. Everything in its right proportions. Again, reject the false choice.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6737/3341/cropped-67373341.jpg?0.5485811764705399", "createDate": "1469909581", "commentID": 19330134, "userID": 67373341, "recommendations": 424, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19330134}, {"approveDate": "1469930487", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469948078", "permID": "19330375", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "The Khans have much to teach Trump about immigrants, about the United States, about sacrifice, and about our Constitution.<br/>Trump misses that America is a nation of immigrants.<br/>Trump misses that immigrants and refugees have the same inherent worth as a native-born, far from being \"criminals,\" or \"a Trojan Horse.\"<br/>Trump misses that immigrants are among our soldiers who risk their lives for the rest of us, unlike Donald \"dodging STDs was my Vietnam\" Trump.<br/>Trump misses that our Constitution prohibits the kind of religious tests he espouses.<br/>The Khans are much better emblems of the United States than The Donald.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469913929", "commentID": 19330375, "userID": 40118532, "recommendations": 349, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19330375}, {"approveDate": "1469931667", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469948141", "permID": "19331908", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn, New York", "parentID": null, "userDisplayName": "Matthew Carnicelli", "commentTitle": "<br/>", "commentBody": "Here's one simple truth on immigration.  <br/><br/>The H-1B program is being widely used to economically disenfranchise skilled, experienced, and hard-working naturalized Americans, illegally in many instances - and yet the most recent Senate immigration bill proposed to dramatically expand the scope of this program instead of reforming and dramatically curtailing it.<br/><br/>There are many complicated reasons why the flow of immigration from Latin America is as heavy as it is - such as blowback from our failed war on drugs (which has residents of the region running here for their lives),  repeated military inventions in the region on the behalf of regimes that depend on death squads, and the impact of trade deals that tend to disadvantage subsistence farmers, and thus leave them little choice but emigration.  <br/><br/>As a nation of immigrants, one would hope that Americans would be more understanding of the plight of these emigres, and our role in the causes that impel them here.<br/><br/>But their patience may be simply exhausted as a result of watching too many of their highly skilled and fully-qualified countrymen be given the boot all so a corporate CEO and his or her flunkies can get a bigger bonus, while circumventing the actual intent of Congress.<br/><br/>What Drumpf is proposing is a crude tool, as befits a crude man.  But perhaps he would be making less headway on this issue if our coalition of the bribed in Washington was doing a better job representing the economic interests of actual Americans.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5567/8593/cropped-55678593.jpg?0.11945834088370622", "createDate": "1469931658", "commentID": 19331908, "userID": 55678593, "recommendations": 435, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19331908}, {"approveDate": "1469971337", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469967737", "permID": "19331902", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WA State", "parentID": null, "userDisplayName": "Dairy Farmers Daughter", "commentTitle": "<br/>", "commentBody": "We focus too much on the immigrant and not enough on the employer.  If immigrants were unable to become employed, the numbers would fall drastically.  If visa programs were tightened so we made sure that qualified citizens were hired before imported workers willing to work for lower wages, this would be a benefit.  We vilify the immigrant, but do nothing to hold employers accountable who exploit these workers (as Mr. Trump reportedly has done).  Comprehensive immigration reform needs to be two-pronged - yes we need to focus on limiting illegal immigration - but we also need to crack down on employers who are hiring undocumented workers at cheap wages and exploiting visa programs in order to hire skilled workers at lower wages than they would have to pay citizens.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469931602", "commentID": 19331902, "userID": 65160147, "recommendations": 219, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19331902}, {"approveDate": "1469971676", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469968076", "permID": "19334947", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Richard Green", "commentTitle": "<br/>", "commentBody": "There's this beautiful copper-clad statue standing on a large pedestal on a small island in NY Harbor.  There are bronze tablets attached to the pedestal bearing the words to a poem titled \"The New Colossus\"<br/><br/>I suggest that Mr. Trump take the ferry over to that island and read that  bit of poetry.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469971640", "commentID": 19334947, "userID": 57710245, "recommendations": 84, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19334947}, {"approveDate": "1469971906", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469968306", "permID": "19332491", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florida", "parentID": null, "userDisplayName": "John Harlow", "commentTitle": "<br/>", "commentBody": "I think that most people understand that steady stream of legal immigrants has always been critical to this country's prosperity and also believe that there are inequities in our immigration laws that need to be fixed. At the same time, securing our borders is a fundamental responsibility of the federal government. A country that can't secure its borders cannot long remain a country.  The nation needs a solution that fixes the laws, grants amnesty to a large portion of the illegal immigrants in the country while simultaneously securing our borders. To grant yet another amnesty without securing our borders (like every other amnesty we've had) would be a major mistake and would do nothing to bring immigration under control. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469937788", "commentID": 19332491, "userID": 29157217, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19332491}, {"approveDate": "1469972561", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469968961", "permID": "19333063", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "ALB", "commentTitle": "<br/>", "commentBody": "It never fails.  There's always a large group of \"real Americans\" -- who either immigrated here themselves or are the descendants of immigrants -- trying to pull up the ladder from the next group of would-be immigrants.<br/><br/>Yes, we absolutely need sensible immigration policies.  No, we absolutely don't need to drink the poisoned Kool-Aid being offered up by Trump.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469944982", "commentID": 19333063, "userID": 70148353, "recommendations": 142, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19333063}, {"approveDate": "1469974147", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469970547", "permID": "19332399", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "PeterS", "commentTitle": "<br/>", "commentBody": "My parents ran a small store with a few employees. While the shop had not been profitable for decades, they didn't close it until many of the employees were ready to retire. Their management style is clearly not brilliant. Capitalism dictates that when the business is no longer competitive, it should be restructured or shuttered and resources, including humans, should be deployed elsewhere to maximize efficiency. For small business, human relationship often prevails over efficiency. Clearly, our multinational cooperation today operates very differently. The mantra is that the executives must fulfill their fiduciary duty to the shareholders. This is very reasonable given that they are only hired to manage shareholder's money. I think that here lies the dilemma with large modern corporation. They are very efficient but treat employee no better than a clog in the machine. Mom and Pop businesses are humane but will never be competitive in today's world. One answer is clearly labor unions that protects the right of the workers. A complementary answer lies in rethinking and restructuring the mandate for corporate executives; it may not be radical for society to dictate that the responsibilities of company executive may lie beyond that of the shareholders but also the welfare of the employees and the local community. Both these changes will somewhat reduce economic efficiency but maximizing economic efficiency is not the only measure of social good as my parents knew. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469936612", "commentID": 19332399, "userID": 50973161, "recommendations": 96, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19332399}, {"approveDate": "1469978362", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469974762", "permID": "19334265", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MA", "parentID": null, "userDisplayName": "CDC", "commentTitle": "<br/>", "commentBody": "Here are a few of my \"simple truths\" about immigration. <br/><br/>First of all, the way to stop radical Islamic terrorism is not to bar all Muslims from the US, any more than the way to solve gun violence is to take guns away from everyone who owns one. Broad-brush \"solutions\" just penalize the 99.9% of Muslims (or gun owners) who are doing nothing wrong. <br/><br/>However odious and reprehensible Mr. Trump's comments about Mexican immigrants are, he is right about one thing. They are here to rob Americans of jobs. Period. End of story. And there are 11 million of them who have done just that. At the Democratic Convention, I would have liked to see a speech by an American worker who lost his job because of illegal immigration and its evil stepsisters NAFTA and the other trade deals (otherwise known as job giveaways). Instead, we were encouraged to feel sorry for illegals. Sending millions of manufacturing jobs out of the US (and letting laid-off US workers pay the price) didn't even work. Now unemployed Mexicans just sneak across the border and take whatever jobs are left HERE.  And then ask for our sympathy. Or demand their \"rights.\" Unbelievable. <br/><br/>We need E-Verify NOW. We have needed it for years and years and years. Why don't the candidates ever mention E-verify? Gosh, I wonder...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469967241", "commentID": 19334265, "userID": 29699545, "recommendations": 91, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19334265}, {"approveDate": "1469979859", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1469976259", "permID": "19333944:19334578", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Lynn", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sweden", "parentID": 19333944, "userDisplayName": "Larry Lundgren", "commentTitle": "<br/>", "commentBody": "@ Lynn New York - Lynn, very fine comment that suggests homework assignment for every person expressing anti-immigration (various kinds) thoughts.<br/><br/>Homework: Write your family history stating how your forebears were treated when they came, what their educational and economic status was, how long they spoke a mother tongue in the home. Then visit the cemeteries as far back in time as possible. We did that in May, visiting the Gamla Svenska Kyrkogården in Worcester MA. Our forebears are there. Some came as economic and religious migrants, spoke Swedish for a long time, and for the most part finally did well.<br/><br/>One more thought. When I retired in 1996 and we moved to Sweden one thing that disappointed me was the relative lack of diversity in the population. I missed the US on that count. Then we started finding Kurds, Assyrians, and Iranians and then the new floods of refugees started coming. My two cities were transformed and if I am downtown in Linköping or Sweden I will move through a diversity I never experienced in my America (most New England states + Rochester/Brighton, NY)<br/>Larry<br/><a href=\"http://Only-NeverInSweden.blogspot.com\" title=\"Only-NeverInSweden.blogspot.com\" target=\"_blank\">Only-NeverInSweden.blogspot.com</a>", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4501/886/cropped-4501886.jpg?0.33114592609561044", "createDate": "1469969358", "commentID": 19334578, "userID": 4501886, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19334578}, {"approveDate": "1469979918", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469976318", "permID": "19334589", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chas. SC", "parentID": null, "userDisplayName": "Gloria Utopia", "commentTitle": "<br/>", "commentBody": "The NYTimes and the Democratic party are not listening to the people.  (I am not a Trump supporter.)  We're not against immigration, we're against injudiciously allowing anyone who wants to come to this country into this country.  We can't do it.  We don't have the resources, we don't have the mechanisms for security.  We can't even protect ourselves from the gun-wielding citizens threatening us daily.  Our economy, though better than most countries is struggling, our infrastructure is failing.  It's a sad picture for America.  How many companies have fired their workers (Disney is one) to bring in foreign help at a lower price.  Another commenter  called this cannabalistic capitalism.  This isn't outsourcing, this is maintaining the job in this country, but having foreign workers doing it for less.  I don't know Muslims that might kill themselves, and me, here, but we've seen that happen.  Why should we send our troops to die in Middle Eastern countries, when their able-bodied youth are fleeing those countries for entry into the West?  These are complex issues, and a blanket statement from the Democratic party, saying that we love everyone and want everyone here just doesn't resonate with us, liberal or not-so liberal.  We're losing battles from within and without and pandering to the Hispanics or Muslims, doesn't make this country stronger, nor does it make the Democratic party more lovable.  It just puts them less in touch with their base.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469969447", "commentID": 19334589, "userID": 42499822, "recommendations": 96, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19334589}, {"approveDate": "1469986051", "commentType": "comment", "userTitle": "NULL", "updateDate": "1469982451", "permID": "19336287", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Athens, GA", "parentID": null, "userDisplayName": "JXG", "commentTitle": "<br/>", "commentBody": "The biggest mistake of the Democratic party was to include the Muslim couple just to attack Trump. Their presence reminded liberals of the repression and censorship of a culture that still represses women, gays, etc. This reminder and blatant support in a convention might lead some to vote for Trump. It is not about terrorism. And the issue is not about stopping immigration itself. Liberals as well want controlled immigration. We have too much unemployment and underemployment. To highlight Muslims and Hispanics in the convention was not a very efficient strategy in the fight against Trump.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1469979787", "commentID": 19336287, "userID": 50443654, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19336287}], "totalEditorsSelectionReturned": 12, "replyLimit": 3, "totalRecommendationsReturned": 12, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 691, "api_timestamp": "1488822331", "totalReplyCommentsFound": 371, "totalCommentsReturned": 12, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}