{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 15, "totalParentCommentsFound": 756, "totalEditorsSelectionFound": 16, "depthLimit": 0, "totalRecommendationsFound": 622, "comments": [{"approveDate": "1481014262", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481014262", "permID": "20711009", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "NM", "commentTitle": "<br/>", "commentBody": "Mike Pence told ABC’s George Stephanopoulos that it was Mr. Trump’s “right to express his opinion as president-elect.”<br/>We are all entitled to our own opinions, but not to our own facts.  Trump, yet again, did not opine, but lied.  And whether or not Trump has a title, or an impending title, does not excuse him from treating fantasy as reality.  If anything, the weight of office makes him that much more responsible for the fluff he speaks.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480992363", "commentID": 20711009, "userID": 40118532, "recommendations": 1239, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711009}, {"approveDate": "1481014449", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481014449", "permID": "20711127", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MA", "parentID": null, "userDisplayName": "C.L.S.", "commentTitle": "<br/>", "commentBody": "The Democrats, like me, have to accept the results of the election.  And I certainly do.  And, presidential elections are won via electoral votes allocated to the 50 states plus the District of Columbia.  They are not won by a national popular vote tally.  No questions.  That's it.<br/><br/>Too many Republicans, however, and apparently including most of the Republican leadership, seem incapable (ignorance?) or unwilling (cynicism?) to accept the overall +2 million popular vote count in favor of Hillary Clinton.  Why not?  It's very easy to explain, i.e, large Democratic majorities in states with very high numbers of voters, most notably California and New York.  <br/><br/>There was no significant voter fraud anywhere.  The recounts in WI, MI and PA are not showing it, nor would there be any reversals of results in other close states such as FL and NH.  Republicans who spread the idea of voter fraud are indeed playing a very dangerous game, affecting perceptions of the integrity and legitimacy of our national elections.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480992845", "commentID": 20711127, "userID": 32675915, "recommendations": 424, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711127}, {"approveDate": "1481014576", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481014576", "permID": "20711167", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cordoba", "parentID": null, "userDisplayName": "Louis", "commentTitle": "<br/>", "commentBody": "This is a very serious issue, and I dont know why it get so little attention.  There has been a straight line of efforts to construct barriers to voting since shortly after Lincolns death -- 150 years now.  Its has taken various forms, scaling back from overt violence centered in the deep south, to what is now more subtle and more widespread.  But in any form it seeks to suppress votes of people who are poor, less educated and historically non-participants.  This goes right to the heart of whether we have full or limited democracy in America.  I cannot think of a core principle that is more important than one person = one vote. Its truly \"deplorable\" for elected officials, courts and judges to aid and abet this.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480992986", "commentID": 20711167, "userID": 63255400, "recommendations": 507, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711167}, {"approveDate": "1481018362", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481018362", "permID": "20711404", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Vine", "parentID": null, "userDisplayName": "Heather", "commentTitle": "<br/>", "commentBody": "We know that Republicans do not actually believe what they are saying because, if they did, they would seek to investigate and prove their allegations.  Imagine, after all, the implications for down ballot GOP candidates if millions of illegal votes had been cast.  No.  They do not call for such investigation or proof, because Ryan and Priebus and the rest are incredibly cynical and opportunistic.  They have no care how they come to power or how they maintain it.  All along, they have been content to go along with Trump, undermining our democracy and sense of national unity in favor of an authoritarian who is gas lighting all so that, in the end, we believe truth and lies are equal.  Ryan has enjoyed a reputation for conscientiousness and wonkishness.  Of course, Krugman has repeatedly demonstrated such reputation to be undeserved, and Ryan's preferred policies are really remarkable only for their cruelty.  I wonder if historians will reconsider Ryan's current reputation as a result of his craven surrender to Trump and come to see Ryan for what he is: a power-hungry phony. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480994052", "commentID": 20711404, "userID": 77790510, "recommendations": 889, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711404}, {"approveDate": "1481018456", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481018456", "permID": "20711431", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 16, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Phoenix", "parentID": null, "userDisplayName": "Michjas", "commentTitle": "<br/>", "commentBody": "The desired response here us that Trump is a devious liar who wants to become a dictator.   But, for a change, let's try the truth.  <br/><br/><a href=\"http://Factcheck.org\" title=\"Factcheck.org\" target=\"_blank\">Factcheck.org</a> reports that Trump's misstatements are based on legitimate published sources that were misinterpreted.  Trump is not the first to make these misinterpretations.  And when his staff recants, as it did, the Board's claims that Trump is going on a voter id rampage is excessive. It did the same thing when McCain's staff recanted about blocking Supreme Court nominations.  Apparently, Republicans don't get to recant.<br/><br/>That having been said, there is no meaningful evidence of voter fraud.  But it wouldn't hurt if Democrats got on board to clean up the system.  There are, in fact, a large number of the deceased who are still registered.  And those who move out of state are often registered in more than one state.  And finally,, there are many in-state instances where people are registered in other districts but have since moved.  <br/><br/>Lots of folks make comments here about casting votes, and they are always well-received.  Voting is extremely important and when the registration system is so loose, that's a problem.  Alaska can communicate with Arizona to assure that it get points on my license for speeding out of state.  But it can't erase my former voter registration.  <br/><br/>If Democrats showed some concern about the sloppiness of registration, it would be a good effort to meet the Republicans halfway.  I think that should be tried.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4814/7869/cropped-48147869.jpg?1475980521793890914", "createDate": "1480994192", "commentID": 20711431, "userID": 48147869, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711431}, {"approveDate": "1481018786", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481018786", "permID": "20711545", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Colorado", "parentID": null, "userDisplayName": "just Robert", "commentTitle": "<br/>", "commentBody": "In the face of this relentless push to delegitimize our elections we can not give up and turn inward to our personal lives as tempting as this might be as our country turns nastier and nastier.  <br/><br/>Republicans can't have it both ways.  Trump wants to be a legitimate President, but if he insists that the system is rigged he can never be as he undermines his own credentials.  it is also true that taking away voter rights will undermine our election system and turn it into a white priviledge.  Republicans want it both ways.  We do not like Donald Trump, but for the sake of Democracy we will honor the system, btu will Republicans do the same even in the face of victory?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480994702", "commentID": 20711545, "userID": 48063402, "recommendations": 269, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20711545}, {"approveDate": "1481031021", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031021", "permID": "20715629", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "ALB", "commentTitle": "<br/>", "commentBody": "Republicans get into the gutter to find any way to win, including: (1) disenfranchisement in the name of completely fake/zero evidence of \"voter fraud\"; (2) voter intimidation (e.g., Trump, on national TV, urging off-duty law enforcement officers to intimidate voters at the polls; (3) removing early voting days; (4) reducing the number of polling places and polling booths in areas with large populations of minority voters; (5) setting up robocalls telling minority voters that their candidate has already won and that there is no need for them to go to the polls; (6) purging lawfully-registered voters from registration lists because their names are \"similar\" to names of voters registered in another state, etc.<br/><br/>This is going to get so much worse it will make our heads spin.  Why should Republicans stop this illegal activity when it's helped them elect Donald Trump, keep control of the Senate and House, and gain 100% control of 33 State legislatures?  \"Republican morality\" is an oxymoron, and has been since the election of St. Reagan.  <br/><br/>\"Whether there's widespread voter fraud or not, the people believe there is.\"  Sure, and Republicans have zero moral duty to inform them otherwise.  This is like Keyllanne Conway saying Trump's spreading the lie that he would have won the popular vote but for voter fraud is \"presidential\" because he's the president-elect.<br/><br/>Mark my words: Democrats are never going have meaningful wins again unless they are willing to get into the gutter too.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481028065", "commentID": 20715629, "userID": 70148353, "recommendations": 200, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20715629}, {"approveDate": "1481031235", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031235", "permID": "20714276", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NC", "parentID": null, "userDisplayName": "Al", "commentTitle": "n/a", "commentBody": "In my own state, Democrat Cooper won the governorship, but Republican Governor McCrory stalled for days,  refusing to concede,  claiming that the vote was tainted in the hope that by some obscure law the state could appointment a Republican against the wishes of the people.<br/><br/>During this election, the voters of NC replaced a conservative justice with a progressive one so that the court would now lean left. In response the state is attempting to add two more seats to the court in order to tilt the power back against the wishes of the people.<br/><br/>Conservatives then worked overtime to match felon names with Democratic voter names in an attempt to invalidate their vote. People who had never been arrested were receiving notices that they had been identified as having voted illegally.  As mentioned in the editorial, every election cycle Republicans attempt to limit access to polls because they run when people don't vote.<br/><br/>I feel as if I'm living in a third world Banana Republic.<br/><br/>The fix is in.. districts are so gerrymandered here that even when the majority vote Democratic, their choices will never see the light of day. <br/><br/>All three branches of government have now been taken over.  Because of the minimum 3 representative rule, citizens of  small population states wield a ridiculous amount of power over the rest of us. <br/><br/>Republicans have rigged the system so they will remain in control indefinitely, and we are now trapped in a Tyranny by the Minority.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481015017", "commentID": 20714276, "userID": 52068757, "recommendations": 493, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20714276}, {"approveDate": "1481031345", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031346", "permID": "20712626", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hanoi", "parentID": null, "userDisplayName": "BP", "commentTitle": "<br/>", "commentBody": "While there are many lessons to draw from this election perhaps the clearest and most dangerous has been the death of facts. While conspiracy theories and populist ideas loosely linked to reality are not new, this election cycle took fake news mainstream and gave baldfaced lies equal consideration as (what should be) clear facts. In this new world unsubstantiated claims are given airtime and room to fester and grow in ideological echo chambers. With the death of facts, no need for evidence, and skepticism of evidence even when presented we are thrown into a world of uncomfortable uncertainty where anything is possible and any proclamation, no matter source, is worthy of consideration. It is impossible to disprove a negative so we will never be able to disprove Trump's claims of mass voter fraud, giving the lie a limitless lifespan. Just as we can't disprove a mass conspiracy in which 99% of the world's climate scientists who have come together to collectively advance a radical environmentalist agenda to... to what?... I'm not sure. But it's possible and can't be disproven so it must be true.<br/><br/>So here we are in a world where facts subjective. Gone are the days when everybody's newsman was Walter Cronkite and we debated policy solutions based on a set of shared facts. This is sad and dangerous, solidifying our differences and divisions and all but destroying any common ground for pursuing our collective interests as a nation...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480999834", "commentID": 20712626, "userID": 32227858, "recommendations": 232, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20712626}, {"approveDate": "1481031644", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031644", "permID": "20713242", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Illinois", "parentID": null, "userDisplayName": "Richard", "commentTitle": "<br/>", "commentBody": "The underlying truth of the \"illegal voter\" scam is that Trump is incredibly embarrassed that he lost the popular vote by such an historic margin--2.6 million votes and counting. Trump has 46.2 percent of the popular vote to Hillary Clinton's 48.2. Only Grover Cleveland in 1892 (46.02 percent), received a lower percentage of the popular vote in a two-person race and still won the presidency. (Two-person race meaning no third- or fourth-party candidate received at least 10 percent of the vote, like Theodore Roosevelt in 1912, George Wallace in 1968 or Ross Perot in 1992). Throwing up the smokescreen of \"illegal votes\" is Trump's way of trying to explain the deficit.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481003189", "commentID": 20713242, "userID": 58415557, "recommendations": 209, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20713242}, {"approveDate": "1481031765", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031765", "permID": "20715007", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Austin", "parentID": null, "userDisplayName": "slimjim", "commentTitle": "<br/>", "commentBody": "Somehow, I just don't think they can pull it off.  They are unprincipled, and that helps them, but it is still heavy lift. In addition to his widening popular loss in a Presidential race that had Russian and FBI thumbs on the scale, Trump and the Republican Party have minority support on most important issues, a murky and self-contradicting agenda, and extremely low approval ratings relative to their political power and the public perception of Obama and the Democrats.  Every word Mitt Romney said about Trump prior to being publicly gelded was true, and most Americans either know that or strongly suspect it.  Given that many of Trump's promises are either impossible, unpopular, or, on closer inspection, very bad ideas, he will fail to deliver on an epic level.  Coal will come back just when buggy whips do, climate change denial will become a sign of a mental disorder, and he will find that he cannot actually decree a trade war.  Nuclear, yes, but trade, no.  And he will continue to randomly Twitter out self-inflicted headaches and distractions that leave his palace guard scrambling to come up with narratives to reassure us he is not insane, completely incompetent or in the thrall of crackpots, but had thoughtfully and knowledgeably considered the ramifications of casually throwing hand grenades into every area of diplomatic stability.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481024384", "commentID": 20715007, "userID": 52033678, "recommendations": 263, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20715007}, {"approveDate": "1481031814", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481031814", "permID": "20716480", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dallas, TX", "parentID": null, "userDisplayName": "A. Stanton", "commentTitle": "<br/>", "commentBody": "Look at what this vile, wild man has presented us with thus far. An election campaign and now a transition period unequaled for lies, coarseness, conspiracy theories and the dredging up of old prejudices and hatreds. Cries of lock her up and throw away the key. The re-emergence of Klan figures and right wing talk-show nutsos many of us had thought would never again dare to show themselves in broad daylight. Crazies sporting Nazi salutes while addressing us on the subject of international bankers. Men and women now being appointed to cabinet positions and key advisory posts displaying little attachment to values like caution, honor, devotion to the rule of law, careful study of the issues before us and a decent regard for the opinion of others. <br/><br/>It would remind me of wild zoo animals being loosed from their cages and allowed to run free in the streets, except for the fact that wild zoo animals command no armies, no nuclear strike forces, no government bureaucracies, no printing presses that print money; and are primarily interested in finding warm places to sleep. enough food to eat and going about their business in the world in a safe, dignified manner without imposing their bogus ideologies on the rest of us.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7643/0734/cropped-76430734.jpg", "createDate": "1481031132", "commentID": 20716480, "userID": 76430734, "recommendations": 312, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20716480}, {"approveDate": "1481035586", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481035586", "permID": "20712557", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "lee ny", "parentID": null, "userDisplayName": "sherm", "commentTitle": "<br/>", "commentBody": "My view is that Trump only lies for his own self interest. I don't think he would lie to protect Pence or Banon, or Priebus, or Ryan. He Insists on their loyalty but it is not reciprocal.  I think the loss of the popular vote by about 2.6 million votes is for Trump an almost unbearable burden. Gaining office by a fortuitous geographical distribution of about 100,000 votes in three states is not very braggable.<br/><br/>Trump, in terms ego satisfaction, wants to crush opponents, but he lost the street battle to this guilty of all things-till-proven-innocent, Wall St-beholden, smart woman. So his only defense is to say it didn't happen. Those 2.6 million votes were fraudulent, and therefore he won the popular vote. He lies therefor he is.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480999508", "commentID": 20712557, "userID": 20019851, "recommendations": 221, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20712557}, {"approveDate": "1481037813", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481037813", "permID": "20715312", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Highland Moors, Scotland", "parentID": null, "userDisplayName": "Thomas MacLachlan", "commentTitle": "<br/>", "commentBody": "Other Republicans might say there was voting fraud because they want to enact more wide scale voter disenfranchisement schemes aimed at minorities and other Democrats. But not Trump. He started this nonsense because he's acting like a spoiled two year old who isn't getting enough attention, so he stomps his feet and cries and yells until someone gives him a cookie. And he can't stand to lose. If he doesn't win everything, he goes into full diaper mode. It's disgusting to see how immature and explosive this lying liar of a narcissist is. <br/><br/>Votergate is no more than just birtherism redux. 40 percent of Republicans still believe in that claptrap, and this voter fraud nonsense is entirely the same delusional mentality.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6595/5315/cropped-65955315.jpg", "createDate": "1481026452", "commentID": 20715312, "userID": 65955315, "recommendations": 191, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20715312}, {"approveDate": "1481039351", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481039351", "permID": "20716531", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Pa", "parentID": null, "userDisplayName": "Howard Beale", "commentTitle": "<br/>", "commentBody": "When Trump says millions voted illegally he is speaking in code. He means millions of blacks and other minorities who voted legally shouldn't be permitted to vote at all. And he is saying, in code, that efforts to disenfranchise them will find favor in his administration. As many Trump supporters would have it, only those who are white and hold property free and clear of a mortgage (Freeholders) should be permitted to vote. He just can't say that clearly and publicly...yet! ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481031262", "commentID": 20716531, "userID": 71835948, "recommendations": 136, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20716531}, {"approveDate": "1481039631", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1481039631", "permID": "20711545:20716342", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "just Robert", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Decatur, Alabama", "parentID": 20711545, "userDisplayName": "MVH1", "commentTitle": "<br/>", "commentBody": "I had thought things would settle down after the election and everyone would go to their corners, the defeated lick their wounds and try to make the best of a crushing defeat.  But the winners this time are just as rageful and angry as they were before they won.  Poor, poor winners which is far and away worse than a poor loser.  A man I've know for over 70 years in the Trump camp is calling for Megyn Kelly to be jailed.  For what?  This was a reasonable human most of my life.  I sadly do not recognize many of my life-long friends.  Nor do I want to be in their presence. any longer.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481030654", "commentID": 20716342, "userID": 46980284, "recommendations": 171, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20716342}], "totalEditorsSelectionReturned": 16, "replyLimit": 3, "totalRecommendationsReturned": 16, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1072, "api_timestamp": "1488822325", "totalReplyCommentsFound": 316, "totalCommentsReturned": 16, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}