{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 724, "totalEditorsSelectionFound": 28, "depthLimit": 0, "totalRecommendationsFound": 838, "comments": [{"approveDate": "1449576189", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589041", "permID": "16889990", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 22, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Clawson, Mich", "parentID": null, "userDisplayName": "Mark Thomason", "commentTitle": "<br/>", "commentBody": "Rubio put his finger on the Republican problem when he said, \"a growing sense that we have a president that’s completely overwhelmed.\"<br/><br/>They have worked hard to undermine the President on everything -- everything, no matter what he does.<br/><br/>Now that we have a national problem, they can not be part of the national conversation. They have reduced themselves to the political equivalent of bomb-throwers.<br/><br/>Yesterday, I got an email circulated by Republicans, saying that Obama only makes sense \"when you realize he isn't on our side.\" With talk like that, they abandoned the old maxim of politics ending at the water's edge. It never really did exactly end there, see for example the League of Nations fiasco, but there were limits. They've thrown aside all limits. <br/><br/>Those limits made sense for those respecting them, because it kept them part of us in any us-vs-them confrontation. The Republicans have now lost that. They are no longer on side, when it comes down to confrontation of us vs them. <br/><br/>They'd rather attack the President than side with America against foreign enemies. They'd rather be part of the problem, serve the ends of the terrorists to distort and cause fear. They have made themselves our enemies, in this too, not just our economy.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3767/4938/cropped-37674938.jpg?0.41398809710517526", "createDate": "1449576142", "commentID": 16889990, "userID": 37674938, "recommendations": 2000, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889990}, {"approveDate": "1449582762", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589081", "permID": "16889851", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 29, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London", "parentID": null, "userDisplayName": "Diana Windtrop", "commentTitle": "<br/>", "commentBody": "President Obama is confronted with a Republican Party agenda that resembles a rogue Lynch mob. <br/><br/> Obama may be arguably the best American President since John F Kennedy but he will not get credit until many decades after his Presidency. His speech was classic, we are not going into a War against a religion, just the bad people.<br/><br/>Statistically less than 1% of Muslims have committed a terrorist act.<br/><br/>There is a dirt agenda in the congress against President OBama, the Republicans have decided to denounce anything this man says, and it is unprecedented in American politics. <br/><br/>It boarders on treason. <br/><br/>The right wing party fueled by envy, anger and overt racism resembles a very dangerous militia <br/><br/>When Obama walks into the White House, I see a picture of those little African American girls who were spit on by adults when they first walked into an American all white School in the 1950’s. <br/><br/>These Republican don’t want to fight terror, they want to disgrace Obama.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7232/1815/cropped-72321815.jpg?0.3425476534757763", "createDate": "1449574451", "commentID": 16889851, "userID": 72321815, "recommendations": 1524, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889851}, {"approveDate": "1449582808", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449588911", "permID": "16889852", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Mike", "commentTitle": "<br/>", "commentBody": "The NYT characterizations are correct: the GOP candidates' empty words and posturing are ignorant and laughable. Of course, these poseurs don't really care what the NYT says and, worse, use its editorials and comments to solidify their positions with their bases. I support the president's measured words and actions. Still, I understand what I suspect is a near-universal desire to see some type of meaningful if not decisive action. The dissatisfaction with his recent speech stems from its \"stay the course\" theme and lack of a particular action directly focussed on ISIL and its nominal base of operations. Continuing air sorties and infrastructure destruction are necessary, but they're too subtle for many, don't produce dramatic short-term results and don't capture the popular imagination. The GOP candidates' professed actions are absurd, empty, immoral and likely illegal, but they are dramatic actions nonetheless. (And, yes, Mr. Bush, I do think that extremist Christians are a threat to Western civilization.) What one action could the president take that would clearly harm ISIL and rally popular support? Perhaps the recent successful raid that freed ISIL prisoners is a decent example. The additional SOF capabilities recently committed may be a basis or source for the kind of action that I think most Americans would cheer. I trust the president and his advisers are open and alert to opportunities to damage ISIL without dragging the US further into the Middle East quagmire. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449574471", "commentID": 16889852, "userID": 26406894, "recommendations": 351, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889852}, {"approveDate": "1449582839", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449588930", "permID": "16889616:16889864", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Burroughs", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "nj", "parentID": 16889616, "userDisplayName": "richie", "commentTitle": "n/a", "commentBody": "What exactly was he supposed to do that we are not already doing? Announce a draft and sending of a million of Americans to invade Syrua? How about some tax increases to pay for such expedition?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449574666", "commentID": 16889864, "userID": 55025237, "recommendations": 522, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889864}, {"approveDate": "1449582848", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449588956", "permID": "16889870", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": null, "userDisplayName": "Marie", "commentTitle": "<br/>", "commentBody": "Radicalization and extremism in the name of a belief--any belief--scare me. In light of Trump's crazy, un-American proposal to not let Muslims into the US, I would say that he has officially become self-radicalized. And what scares me almost more are the throngs of rabid followers. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449574757", "commentID": 16889870, "userID": 44568292, "recommendations": 737, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889870}, {"approveDate": "1449583183", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589011", "permID": "16889873", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Painesville,OH", "parentID": null, "userDisplayName": " ejsnyder618 ", "commentTitle": "<br/>", "commentBody": "This couple in San Bernadino took 14 precious lives - horrible - but otherwise these people are stupid failures.  They had thousands of rounds of ammunition and how many did they fire off?  Hundreds.  They had a dozen pipe bombs and what did they blow up?  Nothing.  They had a 6-month old daughter whose live and love they will completely miss out on.  Stupid!! Except for the fact that, apparently,they have turned  a many Americans - including presidential candidates!! - into intolerant, irrational, hyperventilating cowards.  We are allowing them to turn failure into success by so easily giving up our american ideals. I would like to think that the President is correct when he says that we are better than that - but I am beginning to doubt it.  The last time this happened, we got the Iraq War.  Do we really want to go there again?  Couldn't we all please count to ten and breath deeply, square our shoulders, suck it up, and think about what we are saying and doing and be smart instead of stupid?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449574796", "commentID": 16889873, "userID": 38239889, "recommendations": 953, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889873}, {"approveDate": "1449583373", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449583373", "permID": "16889890", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "<br/>", "parentID": null, "userDisplayName": "mj", "commentTitle": "<br/>", "commentBody": "\"There are no radical Christians that are organizing to destroy Western civilization.\"<br/><br/>Really? How soon we forget a self proclaimed Evangelical walked into a Planned Parenthood clinic and shot two people, wounding 14. <br/><br/>I guess if you are a radical Christian this is just fine. Mr. Bush must fall into this category. <br/><br/>We need to stop the Right from terrorizing the populace. Yes, I said the Right. It's a game of bait and switch. 30 people are shot and killed every day in the US. 30. That's more than half of all the people who have died by Muslim terrorism in the years since 9/11. <br/><br/>I don't want to hear about Muslims anymore. They are a small problem. I want someone to address gun violence in the US. <br/><br/>These people are a disgrace and it's time we called them out. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449575052", "commentID": 16889890, "userID": 29419789, "recommendations": 1357, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889890}, {"approveDate": "1449585960", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449585960", "permID": "16890494", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Kelly", "commentTitle": "<br/>", "commentBody": "The President told us the truth. What we have to fear is fear itself. This struggle, not a \"war\" as envisioned by political opportunists and hate mongers, but a close in face to face struggle for civilization, can't be won with bombs or dishonest rhetoric. This struggle will only be won with resolve. Resolving to stand by our beliefs. It is a struggle that will require patience and will sadly result in casualties on our side, sometimes including citizens just living their lives. Here is what we know from bitter experience: Our massive armies and firepower are ineffective in this struggle. We cannot prevent every would be attacker from succeeding. Despite searching mountains of hay for the needles that might hurt us massive intrusions of our privacy cannot protect us from a determined husband and wife armed to the teeth. Fear mongering and reactionary responses set the table for failure. That of all the claims and admonitions we have heard since 911, the one that has stood the test of time is that this will be a long and difficult struggle. I am with my President. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449580195", "commentID": 16890494, "userID": 32533590, "recommendations": 413, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890494}, {"approveDate": "1449586060", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589020", "permID": "16889987", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Barnesville, OH", "parentID": null, "userDisplayName": "rareynolds", "commentTitle": "<br/>", "commentBody": "While I may not agree, I understand that many Americans are fearful of terrorist attacks and also have seen jobs evaporate and pay decline, so on two levels they can't comprehend why any rationale leader would let floods of people, even if only 20,000, into this country. The fears may be irrational, but as with a person afraid of flying or of open spaces, you first try to listen and understand. The constant leftwing ridicule and lecturing doesn't help. Telling terrified people they are wrong and irrational won't help. The first step is to try some empathy. The Republicans get that, oddly enough. Also, they no doubt see that Le Penn is  rising in France. I hope more moderate elites will understand that people need economic prosperity, a feeling of economic and physical security, and a sense they are valued in a national family or we will see the further rise of a nationalist right. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1272/5850/cropped-12725850.jpg?0.08734734216704965", "createDate": "1449576116", "commentID": 16889987, "userID": 12725850, "recommendations": 99, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16889987}, {"approveDate": "1449586201", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589048", "permID": "16891281", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Missouri", "parentID": null, "userDisplayName": "Chris", "commentTitle": "<br/>", "commentBody": "Trump has always been a bigot, as was seen when Obama won the presidency.  Who else continued the \"birther\" rant with such obvious pleasure for so long?  With his latest monologue about Muslims, is there any doubt as to his bigotry?  <br/><br/>Yes, folks, this is the leading candidate of the Republican party.  How sad to see the death throes of what used to be a reasonable political organization; one that has degraded since the 70's into a smoldering cesspool that thrives on fear, dissension, and dubious campaign \"donations\".<br/><br/>I miss Ike.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449583976", "commentID": 16891281, "userID": 5237253, "recommendations": 399, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16891281}, {"approveDate": "1449586258", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449586258", "permID": "16891266", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Plano,Texas", "parentID": null, "userDisplayName": "KB", "commentTitle": "<br/>", "commentBody": "I am liberal and supports Obama and greatly supports our democratic value. At the same time, I am started feeling that our government is not fully understanding the present conflict - an ideology, mems, that is against the life and civilization. <br/><br/>Fighting Cold War was easy - economic and military supremacy and creation of global alienates helped us to destroy communism. But the present enemy is on the individual minds - not visible. How you fight this enemy?<br/><br/>Our next door neighbours, our friendly coworker, our classmates, our fellow soldiers, ....any possible human relation in our life can be our enemy. This corrupt minds are living with us and at the same time are planning all the time to destroy us. How our leaders will protect the society under this situation. I agree the brute force method of Donald Trump is not right - but what is the correct method. <br/><br/>In his speech, Obama gave a cold war strategy and I do not believe that will work in this case. All soft targets in our society are exposed and our state could not protect its citizens - very dangerous reality.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449583911", "commentID": 16891266, "userID": 65816625, "recommendations": 41, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16891266}, {"approveDate": "1449586361", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449586361", "permID": "16890255", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "calif", "parentID": null, "userDisplayName": "dig", "commentTitle": "<br/>", "commentBody": "Its not fear that is motivating many Americans, but anger. And part of the anger is for those on the left who insist that Islam is solely a religion of peace, despite all the evidence that it spawns more terror these days than all the others combined. Anger also stems from frustration in seeing a naive approach to immigration, assuming that all immigrants will readily assimilate and contribute to our society, when it's more realistic to acknowledge that at least some, and more likely a significant many, will not and the US, like the EU, will be left with recalcitrant communities who do not share our vision and prefer to live in an Islamic theocratic state that honors the culture they brought with them. Wake up. The time for bleeding hearts is over.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449578511", "commentID": 16890255, "userID": 3689715, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890255}, {"approveDate": "1449587063", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449587063", "permID": "16891848", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Michigan", "parentID": null, "userDisplayName": "George S.", "commentTitle": "<br/>", "commentBody": "My, how easy it is to send America into a panic. One ebola death (due to bungling by a private hospital in Texas) and fears of an epidemic are stoked by the right, and Obama and CDC director are excoriated for stating the truth, i.e. our medical system will handle the problem, ebola does not spread that easily, there will be no epidemic. <br/><br/>One disgusting attack by a homegrown terrorist and his wife leads to right wing hysteria and political opportunism, tough talk by know nothings, and calls to<br/>abandon the First Amendment of the Constitution with regard to Muslims, that document that conservatives supposedly hold sacred. <br/><br/>Kasich calls for \"bold action.\" Such as? Iraq was certainly a bold action. And a naive and costly one that cleared the field for terrorist groups to fill the power vacuum. So we should listen to those who stupidly blundered into the Middle East? I think not.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449586109", "commentID": 16891848, "userID": 47209588, "recommendations": 502, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16891848}, {"approveDate": "1449587181", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449587181", "permID": "16890491", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Miami", "parentID": null, "userDisplayName": "Beyond Karma", "commentTitle": "<br/>", "commentBody": "The trouble with this editorial and the one on the front page of the NYTimes is that it will will not change one mind. You are preaching to the choir. Yes, it is important to state these opinions, but the voters these Republicans are speaking to will only take it as further proof that \"we\" are out of touch. Unfortunately, with all of the positive news (unemployment down, economy doing well, etc., etc.) The fear factor is the best argument they have.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449580174", "commentID": 16890491, "userID": 51564024, "recommendations": 179, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890491}, {"approveDate": "1449589348", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589348", "permID": "16891232", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlotte", "parentID": null, "userDisplayName": "Kenan Porobic", "commentTitle": "<br/>", "commentBody": "I am always simultaneously amazed and stunned when I read that somebody blames the faith for existence of “us-vs-them” mentality.<br/><br/>In real faith there is only “us”.<br/><br/>If you succumb to “us-vs-them” frenzy and hatred, you are not a believer.<br/><br/>As you should know, the believers love their neighbors…", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449583767", "commentID": 16891232, "userID": 67801059, "recommendations": 86, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16891232}, {"approveDate": "1449589442", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589442", "permID": "16890782", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "usa", "parentID": null, "userDisplayName": "seeing with open eyes", "commentTitle": "<br/>", "commentBody": "NYTimes Editors:<br/>You correctly point out that attempts to stop ISIL propagand by closing social media accounts is futile.<br/>I refer you to a December 4, 2015 investigative article in the German newspaper, Der Spiegel.<br/>This article describes how ISIL is dependent on Satellite Inernet. Further, it states that European manufacturers of such technology are profiting from sales to ISIL and its representatives; people buying 10s of satellite connections at once .<br/><br/>The US and its true allies should step in and stop this free-market-at-any-cost approach to capitalism by these manufacturers.  This would go far towards reducing ISIL online recruiting and propoganda.<br/><br/><a href=\"http://www.spiegel.de/international/world/islamic-state-uses-satellite-internet-to-spread-message-a-1066190.html\" title=\"http://www.spiegel.de/international/world/islamic-state-uses-satellite-internet-to-spread-message-a-1066190.html\" target=\"_blank\">http://www.spiegel.de/international/world/islamic-state-uses-satellite-i...</a>", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449581828", "commentID": 16890782, "userID": 40343536, "recommendations": 110, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890782}, {"approveDate": "1449589746", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449589746", "permID": "16892676", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Ferdinand", "commentTitle": "<br/>", "commentBody": "So the Republican response to DAESH is to radicalize Americans.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449589378", "commentID": 16892676, "userID": 26149859, "recommendations": 215, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16892676}, {"approveDate": "1449592075", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449592075", "permID": "16893186", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "nc", "parentID": null, "userDisplayName": "mark", "commentTitle": "<br/>", "commentBody": "Why is Mr. Obama obsessed with \"what ISIL wants\"?  This is nothing more than a plea for inaction.  What matters is \"what we want\", which is to be free of Islamic terrorism.  And he offers no plan for that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449591700", "commentID": 16893186, "userID": 58185016, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16893186}, {"approveDate": "1449593239", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449593239", "permID": "16890385", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlotte", "parentID": null, "userDisplayName": "Kenan Porobic", "commentTitle": "<br/>", "commentBody": "An excerpt from this editorial:<br/><br/>“I don’t know if sand can glow in the dark, but we’re going to find out,” whatever that means.<br/><br/>Dear editors, even the conventional bombs contain a miniscule amount of radioactive material. Even the conventional bombs can contain phosphorous.<br/><br/>Dropping an overwhelming amount of such bombs on any territory would make even the sand glow in a dark. Making a sand glow in a dark means, as clearly stated in previous sentence by Mr. Cruz, that he plans to carpet bomb the Arab population, regardless whether they are the soldiers or civilians.<br/><br/>For this US Senator there is no difference between them. All of them should be killed. That’s the very purpose and objective of the carpet bombing.<br/><br/>I hope this short comment helps the NYT editors better understand what the GOP presidential candidate really meant to say...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449579505", "commentID": 16890385, "userID": 67801059, "recommendations": 137, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890385}, {"approveDate": "1449593831", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449593831", "permID": "16893127", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arizona", "parentID": null, "userDisplayName": "Chris W.", "commentTitle": "<br/>", "commentBody": "As a salesman Mr. Trump knows the first rule: Say anything to get their attention and get them excited about what you are selling. After you've closed the deal what you do afterward is unimportant. What you've promised during the sales pitch does not need follow through. By the time you are questioned about it you have already moved on to the next potential sell. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449591382", "commentID": 16893127, "userID": 65298627, "recommendations": 95, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16893127}, {"approveDate": "1449595687", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449595687", "permID": "16893223", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CO", "parentID": null, "userDisplayName": "Tsultrim", "commentTitle": "<br/>", "commentBody": "Republicans can't get behind their President. They've invested seven years in Obama-bashing. How can they now go back on that stance? They have ranted themselves into a corner where they are exhibiting anti-American behavior. <br/><br/>Despite the horrible shooting last week and the Boston bombing, we are still safer now than we were at 9/11, when Bush ignored the briefings and part of NYC was destroyed along with 3,000 people. President Obama is not a blusterer. So he isn't going to be bragging about how he is fighting ISIS. I find it hard to believe he isn't doing everything possible to stop the violence and the extremism within his and our power. He is keeping us out of another horrible war in the MIddle East. He is bringing other world powers into the conflict so that the effort is not unilateral. This is simply smart. I like smart. Those who prefer stupid, those who prefer violence, let's send them over there first. They can put their money where their mouths are. Then report back how well it's going and how wonderful they feel. The real battle is about fighting propaganda and indoctrination. The real enemy all around us is small mind. The real weapon is fear. We would do best to support our President right now, and let the right wing extremist, facist clowns running for president fade into obscurity, footnotes in some future history book.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2841/5751/cropped-28415751.jpg?0.3974221598002029", "createDate": "1449591829", "commentID": 16893223, "userID": 28415751, "recommendations": 262, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16893223}, {"approveDate": "1449595770", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449595770", "permID": "16890334", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Europe", "parentID": null, "userDisplayName": "Agnostique", "commentTitle": "<br/>", "commentBody": "Trump reminds me of old Mousolini clips that seemed so absurd in my youth - the facial expressions, body language, and statements - I had trouble believing Italians could have fallen for it.  Innocence lost.<br/>Expectations of rational thought by a healthy majority seem to be more and more misguided.  Certain have understood this and the buttons to push to achieve their goals (Trump, le Pen, Cruz, Jeb...).  At any cost?  Do they believe all they are saying?  Probably not but the end justifies the means.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449579090", "commentID": 16890334, "userID": 30617198, "recommendations": 117, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890334}, {"approveDate": "1449595824", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449595824", "permID": "16893082", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Half Moon Bay, CA", "parentID": null, "userDisplayName": "Steve Okonek", "commentTitle": "<br/>", "commentBody": "As a political independent, frankly unimpressed with any of either slate's candidate roster, I am perplexed about all the hoopla of Donald Being Donald.  Did you truly think a candidate who advocated a wall between Mexico and us was going to roll out the red carpet for Muslims following the massacres in Paris, San Bernardino and Boston?  Mr. Trump, who now seems to be losing favor, clearly targets the current wide majority of U.S. residents who don't want Syrian refugees coming into our country and then ups the ante to cover all Muslims.  The backdrop of his entire campaign is name/brand recognition: \"I don't care what anyone says about me, so long as they say something.\" Will it play in the primaries, public opinion polls and next November's election?  I doubt it, but should the real story be on ideas coming from other candidates as to how they'll handle this mess, so we can eliminate ones who say there is no credible threat?  This is news I'd like to see.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449591126", "commentID": 16893082, "userID": 48889040, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16893082}, {"approveDate": "1449596773", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449596773", "permID": "16890023", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hillsdale NY", "parentID": null, "userDisplayName": "James Burns", "commentTitle": "<br/>", "commentBody": "If this is total war as the pols are saying then let's reinstate the draft and find our how committed we really are.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449576468", "commentID": 16890023, "userID": 34792057, "recommendations": 169, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890023}, {"approveDate": "1449597000", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449597067", "permID": "16890165", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MN", "parentID": null, "userDisplayName": "RCH", "commentTitle": "<br/>", "commentBody": "The Tough Guys - like Trump, Cruz, Rubio, etc. - all seem to forget that Iraq would have been a lot nastier were it not for Muslim allies, the very same allies they would throw under the bus for a few extra points in an opinion poll or a few extra donations.  Self-defeating behavior, to say the least.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449577797", "commentID": 16890165, "userID": 55158749, "recommendations": 113, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16890165}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1262, "api_timestamp": "1488822326", "totalReplyCommentsFound": 538, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}