{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 4, "totalParentCommentsReturned": 10, "totalParentCommentsFound": 243, "totalEditorsSelectionFound": 14, "depthLimit": 0, "totalRecommendationsFound": 412, "comments": [{"approveDate": "1471003441", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1470999841", "permID": "19464827:19465431", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Look Ahead", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": 19464827, "userDisplayName": "Peter", "commentTitle": "<br/>", "commentBody": "Close the loopholes, put some enforcement behind it, and we could begin to put in place tuition free state schools, universal health care, and a $20 minimum wage - the start of a trickle-up economy, where fairness trickles up and keeps a healthy, secure, educated population on top.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471001775", "commentID": 19465431, "userID": 67105521, "recommendations": 188, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19465431}, {"approveDate": "1471003817", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471000217", "permID": "19465663", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "Trump's followers are like the proverbial frogs in a pot.  They've jumped in willingly.  Snookered by his Primary Promises.  But now the pot is set on boil.  And they don't even see it.  How their votes - once cooked - will be served to fund the rich.  He promises something so exciting!  What a crock!<br/><br/>Meanwhile Hillary is serving up a saner menu.  A more honest effort, where the rich are assured that their prosperity will become a shared societal prosperity.<br/><br/>It's an election between snookering the poor to feed the rich.  Versus honesty to both rich and poor.  Sharing.  Something we all learned in the sandbox.<br/><br/>Simple as that.  Kind of like \"Lord of the Flies\" versus common sense.  May not be exciting.  But we'll all live!   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1471003572", "commentID": 19465663, "userID": 32195826, "recommendations": 189, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19465663}, {"approveDate": "1471005395", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471001795", "permID": "19465701", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "East Setauket, NY", "parentID": null, "userDisplayName": "Paul Wortman", "commentTitle": "<br/>", "commentBody": "Clearly, Clinton has a better economic plan than Trump who just adopted the old Republican \"tax cuts for the rich\" policy.  But, what is still missing from the Clinton plan is any really BIG idea like an interstate high-speed rail system that as with the Eisenhower era highways would revitalize transportation using green, non-polluting energy and could start by linking all major metropolitan areas with 300-400 miles of one another and also allow those trapped in the inner cities of America access to suburban jobs, cut down on polluting air travel and reduce auto and truck congestion on our roads.  A visual like those of most subway systems, but one connecting American cities would be attention-getting and would make her plan comprehensible to most voters who never read the details or understand what they mean.  And why not pay for it with an increase in the federal gas tax that hasn't changed since 1992?!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471003876", "commentID": 19465701, "userID": 57715665, "recommendations": 108, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19465701}, {"approveDate": "1471007300", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471003700", "permID": "19465948", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, Il", "parentID": null, "userDisplayName": "Andy W", "commentTitle": "<br/>", "commentBody": "Remaining Trump voters need to take note of reality for once. So called \"crooked Hillary\" has an achievable, comprehensive and fact-based plan to increase fairness and drive growth. The \"you're fired\" candidate only seems to want to \"make America great again\" for the sake of those who are already rich. His kids get a tax-free inheritance, while your kids get to pay off an extra ten trillion in debt. If Hillary has any flaws, they are around slicing the details too finely in her explanations. She attempted to create a veil of privacy that crossed too far into the public space. Mr. Trump on the other hand, is a proven serial liar. He obliterates major facts on a nearly hourly basis. Donald J. Trump is also a purveyor of divisiveness and bigotry to a degree unseen since the days of George Wallace. Hillary's few flaws are understandable and forgivable. Her entire campaign has been based on compassion and a desire to help. They are the product of a person who always does her homework and sweats every detail. Trump's plans are the product of a lazy street thug who constantly confuses threats and intimidation with leadership.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471005405", "commentID": 19465948, "userID": 57641454, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19465948}, {"approveDate": "1471007450", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471003850", "permID": "19466009", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Highland Moors, Scotland", "parentID": null, "userDisplayName": "Thomas MacLachlan", "commentTitle": "<br/>", "commentBody": "And yet, as good a start as Hillary's plan is, it has no chance of ever being implemented unless the Democrats win both houses of Congress. And while winning the Senate back is possible, winning the House back is much less likely.<br/><br/>This is why it is crucial to get the vote out. Trump is doing his part by demonstrating his instability and incompetence every time he opens his mouth. Now it's up to the Democrats to put a good enough ground game in place so that the House turns Blue. Without that, all this talk from Hillary is just well-intentioned dreamscapes.<br/><br/>This election really is a chance to take America back again - back from the oligarchy who have been ransacking the economy and abusing the American worker, just to fill their overflowing back accounts with more pilfered gold. But it will take work to win the downstream races which would make this a reality.<br/><br/>Overturn the voter ID laws. Get the vote out. Win.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6595/5315/cropped-65955315.jpg", "createDate": "1471005706", "commentID": 19466009, "userID": 65955315, "recommendations": 247, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466009}, {"approveDate": "1471007801", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471004201", "permID": "19466284", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 31, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cary, NC", "parentID": null, "userDisplayName": "Henry Miller", "commentTitle": "<br/>", "commentBody": "In other words, Clinton's plan is the same tired old tax-and-spend foolishness that rarely has any positive effect.  All it really does is make government bigger, more expensive, and more intrusive while simultaneously making the economy less efficient and limiting its growth potential.<br/><br/>The Democrats are all about control, but just don't seem to be able to get it that some things are just too complex to control.  A national economy can no more be controlled than the weather and any attempt to do so not only will not achieve the results the controllers plan on, it's guaranteed to result in \"unintended consequences,\"  usually bad ones.<br/><br/>Raising taxes always slows the economy down--that's why raising taxes never achieves the additional revenue goals the raise was intended to achieve.  These days, raising taxes generally just drives wealth out, either to other states or to other countries.  But raising taxes is always the first thing Democrats think of doing--and Clinton's \"solution\" of \"tax penalties to prevent corporations from moving abroad\" smacks of communist-style iron curtains.<br/><br/>Government-controlled command economies never work well, but the Democrats just don't seem to be able to see that.  Or, maybe, they do understand it but are so determined to control things that they don't care how much damage they do.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471007018", "commentID": 19466284, "userID": 74989965, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466284}, {"approveDate": "1471007859", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471004259", "permID": "19466311", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dubin, CA", "parentID": null, "userDisplayName": "Ron Mitchell", "commentTitle": "<br/>", "commentBody": "\"Plans are nothing; but, planning is everything.\"<br/>Dwight Eisenhower<br/><br/>The specific details of any political plan are worked out during the legislative process. What the Trump and Clinton plans do is define the values each would follow during the negotiations. Trump working to help the few at the expense of the many and Clinton working to help the many at the expense of the few. That is really all we need to know about their \"plans\" and their values. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471007104", "commentID": 19466311, "userID": 64540670, "recommendations": 90, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466311}, {"approveDate": "1471009571", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471005971", "permID": "19466475", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Liberally minded", "commentTitle": "<br/>", "commentBody": "There is no reason to believe that Hillary wouldn't remain true to her word. The role of president means too much to her as the first woman to hold that office and her own sense of accomplishment, not to forget her ambition will keep her on track. The big issue. of course, is getting a Democrat congress. elected. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471007849", "commentID": 19466475, "userID": 63258400, "recommendations": 116, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466475}, {"approveDate": "1471010377", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471006777", "permID": "19466284:19466890", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Henry Miller", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": 19466284, "userDisplayName": "Sage", "commentTitle": "<br/>", "commentBody": "Tax and spend wisely on projects that put Americans to work with decent jobs, such as building our infrastructure is right!  Austerity causes misery and hurts the economy.  The facts bear that out.  The blighted-right-wing that ONLY wants to protect the wealthy, while Americans suffer with stagnant wages while corporate earnings soar is lousy, unnecessary policy.  Yes to tax and spend wisely!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471009490", "commentID": 19466890, "userID": 71801375, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466890}, {"approveDate": "1471010621", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471007021", "permID": "19466284:19466967", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Henry Miller", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles, CA", "parentID": 19466284, "userDisplayName": "Vesuviano", "commentTitle": "<br/>", "commentBody": "Hello, Mr. Miller -<br/><br/>You make a lot of strong statements in your post, as well as generalizations, but I don't think you know your history very well.  We can feel free to use my state, California, as an example.<br/><br/>The Republicans are so few in California government that they can't indulge in their usual mischief.  As a result, we've raised taxes, and more money has gone to our schools.  Our employment situation is good, and if California were a country it would have the sixth largest economy in the world.  Not bad for a place run by \"tax and spend\" liberals.<br/><br/>By contrast, let's look at Kansas, which is entirely run by Republicans.  They've cut taxes, cut the social safety net, demonized and neutered unions, and bragged that all of this would make Kansas pretty much a wonderful place to do business.  \"Stand back\", they said, \"and watch the Kansas economy take off!\"  Didn't happen.  The state's financial rating has been lowered twice, it's deficit is ever-growing, and it might be sued by the feds because its schools are inadequately funded.<br/><br/>By the way, in case you forgot, President Reagan raised taxes on eleven different occasions.  Nixon at one point froze prices.<br/><br/>In conclusion, for any American to talk about the damage done to the country by Democrats only eight years after the end of the most incompetent, disastrous administration since Hoover (That would be the administration of George W. Bush.), indicates what I can only describe as a severe disconnect from where I sit.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2368/8396/cropped-23688396.jpg", "createDate": "1471009745", "commentID": 19466967, "userID": 23688396, "recommendations": 219, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19466967}, {"approveDate": "1471012399", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471008799", "permID": "19467428", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "white plains", "parentID": null, "userDisplayName": "roger", "commentTitle": "<br/>", "commentBody": "For those of us who are tired of 35 years of Voodoo Economics--a term coined by Reagan's own budget director, David Stockman, I believe--Clinton's plan is a breath of fresh air.   The idea that we can give the rich huge tax breaks and stimulate the economy at the same time has pretty much run it's course.   Hillary's plan is the latest evidence of a sea change in thinking about economics--and it's about time!  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471011664", "commentID": 19467428, "userID": 46571955, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19467428}, {"approveDate": "1471012544", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471008944", "permID": "19466296:19467622", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Ralphie", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Berkeley", "parentID": 19466296, "userDisplayName": "Rich", "commentTitle": "<br/>", "commentBody": "Wow, such a short memory. Slowest recovery from what exactly? Let me remind you: it was the near meltdown of the global economy under GW Bush. The GOP masterminds left this country in a deep hole and your complaint is that the Dems didn't climb out of it fast enough?<br/><br/>Try reviewing the history of the party in power when the national debt has ballooned (Republicans) and when the economy has improved (Democrats). Review the history of how well \"trickle-down\" economics has worked in practice. It's not theory; the experiment has been run and the results are in. It's \"voodoo economics\" as GHW Bush called it when running against Reagan.<br/><br/>If you can't get the facts right, why should anyone listen to your opinions?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6597/5063/cropped-65975063.jpg", "createDate": "1471012503", "commentID": 19467622, "userID": 65975063, "recommendations": 94, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19467622}, {"approveDate": "1471012594", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471008994", "permID": "19467624", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "Of course Hillary's proposals are serious and incremental. Her policies are projections of her personality, a dogged pursuit to improve political discourse and get things done, as modest as they may seem. We are a nation of built upon compromise. How else could Massachusetts and South Carolina exist within the same borders. Or Texas and Pennsylvania, Florida and Alaska, Wyoming and California. It's amazing.<br/><br/>Take a look at how hard it has been holding together the European Union. Different cultures, different approaches to governing, and yet all those cultures inhabit the United States, plus hundreds of others. Take a trip to our humble burgh and see how hundreds of those cultures exist side by side within the confines of NYC. Then throw in the United Nations for good measure. Tourists who visit the Outer Boroughs outside of Manhattan will see it all. That is why we have been called, The Capital of the World. Now if we can manage this here why can't the rest of America realize with all the space that separates themselves outside of our major cities we can all get together on some common solutions to solving our nation's problems while still retaining our differences from sea to shining sea. The United States has never stopped being great. We as a people just need to realize a marvel such as the US always needs tending to. We can never rest of our laurels. We need to move forward, however slow, to achieve that perfect union. We are a constant work in progress.<br/><br/>DD<br/>Manhattan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471012505", "commentID": 19467624, "userID": 22528152, "recommendations": 60, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19467624}, {"approveDate": "1471013149", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471009549", "permID": "19467714", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Manhattan", "parentID": null, "userDisplayName": "vanreuter", "commentTitle": "<br/>", "commentBody": "Economic proposals by candidates are just that, proposals. They are the window into the overriding fiscal philosophy of that candidate. The Times rightly recognizes that Secretary Clinton's vision for a more fair and equitable system stands in sharp contrast to the sketchy outline of Mr. Trump's revised economic plan.<br/>The respondents here citing emails, Benghazi, and the various other unrelated issues to attempt to criticize a series of public policy proposals, have issues that prevent them from viewing any issue (including this one ) clearly.<br/>Blinded by blind ideology, blind hatred, or both, they stumble from issue to issue shouting the same denouncements regardless of their pertinence or their veracity.<br/>Secretary Clinton is presenting what she proposes as her economic philosophy, the framework that she will work to enact legislatively over the course of her administration. If you agree with that philosophy or not, that is the issue here, and I tend to agree with the assessment of the Times editorial board as regards which of the two plans are better for the majority of Americans.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471012996", "commentID": 19467714, "userID": 26014480, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19467714}], "totalEditorsSelectionReturned": 14, "replyLimit": 3, "totalRecommendationsReturned": 14, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 549, "api_timestamp": "1488822366", "totalReplyCommentsFound": 306, "totalCommentsReturned": 14, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}