{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 651, "totalEditorsSelectionFound": 27, "depthLimit": 0, "totalRecommendationsFound": 855, "comments": [{"approveDate": "1471334886", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471353754", "permID": "19502039", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 157, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "What may irk the editors most about Trump's speech was his assertion that ISIS incubated in the vacuum left by the American retreat in Iraq and Syria. “The failure to establish a new Status of Forces Agreement in Iraq, and the election-driven timetable for withdrawal, surrendered our gains in that country and led directly to the rise of ISIS,” he stated. This is no more than truth, although the left never tires of denying it, not willing to acknowledge that it all happened on President Obama's and Sec. of State Clinton's watches, not on Dubya's. Add to that error of judgment their willingness to allow Syria to disintegrate into a hideous civil war and you pretty much have the explanation for the rise of ISIS and its regional metastasis. We just didn't care enough about it to stop it when we could.<br/><br/>It was a pretty good speech, despite the editors' resolve to spin it as \"confused\". It sets out bones of contention between Trump's view, which is the overwhelming view of Republicans, and those of Mrs. Clinton and Mr. Obama, who understandably remain defensive.<br/><br/>But a presidential debate on national security would be an excellent opportunity to parse competing arguments. But some advice to Mrs. Clinton: if her argument, like Mr. Obama's, is that George W. Bush is to blame for everything bad on this Earth since Eve took a surreptitious bite of an apple, despite EIGHT YEARS of Obama stewardship, then she won't convince DEMOCRATS not already sold, forget about Republicans.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1471334847", "commentID": 19502039, "userID": 47123844, "recommendations": 102, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502039}, {"approveDate": "1471340925", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471337325", "permID": "19502193", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fort Worth, TX", "parentID": null, "userDisplayName": "nkda2000", "commentTitle": "<br/>", "commentBody": "Every time I listen and try to rationally look at Trump’s Foreign Policies, I come away more and more confused.  Trump’s latest version is just another example of an ill thought out policy using catchy slogans that contradict each other.<br/><br/>Trump says he does not want to nation build, yet he says he will destroy ISIS quickly with no mention of what he will do with this new power vacuum he will create.  Likewise, Trump blames President Obama for pulling out of Iraq too soon thus causing ISIS.  Yet if President Obama kept US troops in Iraq, that sounds just like the “nation building” policy Trump says he is against.  <br/><br/>Trump wants to take Iraq’s oil.  Trump obviously has not learned from history.  After WWII, the US did not demand war reparations from the defeated Germans or the Japanese.  The US leaders wisely realized war reparations would lead to another war.  If the US had seized the Iraqi Oil, this would require a huge US military presence in Iraq. Also, Iraq would have been in even worse economic shape and be even more unstable then it is today.<br/><br/>Trump has laid bare the one truth now accepted by all parties: the US invasion of Iraq and removal of Saddam Hussein was a fiasco. Trump has continually attacked the Bush/Cheney Iraq War over the past year BUT this time not one word by Cheney defending his war.  By 2008 non of the Democrats supported the Bush/Cheney Iraq War.  Now in 2016, a majority of the Republican base no longer support Bush/Cheney reasons for the Iraq War.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471338497", "commentID": 19502193, "userID": 56845759, "recommendations": 828, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502193}, {"approveDate": "1471340951", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471337351", "permID": "19502200", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Earth", "parentID": null, "userDisplayName": "CityBumpkin", "commentTitle": "<br/>", "commentBody": "Even someone who doesn't follow global affairs should see problems with Trump's proposals, if you can call them that. His ideas are self-contradictory. He wants to be partners with everyone that will combat ISIS, yet that would include Iran which is on Trump's list of enemies. Some of those would be partners are also more opposed to each other than to ISIS. How do you build a coalition with them? Trump doesn't explain how all these conflicting positions will compute. Trying to make sense of Trump's bizarro worldview is trying to square a circle. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471338681", "commentID": 19502200, "userID": 60909833, "recommendations": 943, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502200}, {"approveDate": "1471343866", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471353677", "permID": "19502264", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 37, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Steven", "commentTitle": "n/a", "commentBody": "We already have an \"ideological test for newcomers.\" <br/><br/>Anyone from another country wanting to become s citizen of the US must take an oath swearing allegiance to the US, and renouncing allegiances to any other country. <br/><br/>If the oath didn't exist, and Trump first proposed it yesterday, I have no doubt you would condemn the idea as imposing an \"ideological\" requirement for citizenship.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471339951", "commentID": 19502264, "userID": 63373004, "recommendations": 103, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502264}, {"approveDate": "1471350002", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471346402", "permID": "19502377", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Joachim", "commentTitle": "<br/>", "commentBody": "I agree fully that the so called Foreign Policy Speech was nothing else then a collection of confused random thoughts which no one else than Trump can garble together. Clearly he was uncomfortable with a speech someone has written together and Trump and although he was trying to adhere to \"looking presidential\" the speech was total garbage. Mr. Trump simply has no knowledge of word affairs or of the constitution. Much of what he proposed would be contradictory to our constitution and the bill of rights. He keeps telling us we should have sent our boys and guard the pipelines and take \"their\" oil. He made the comment that NATO has changed now its policies because of his comments. If it is not visible to anyone that he is unfit and clearly lacks knowledge, yesterdays speech was another element of demonstrating that he is totally unfit for the high office.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471342299", "commentID": 19502377, "userID": 72424499, "recommendations": 395, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502377}, {"approveDate": "1471350015", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471353376", "permID": "19502383", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 39, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Netherlands", "parentID": null, "userDisplayName": "WimR", "commentTitle": "<br/>", "commentBody": "Trump is new to foreign policy and is still finding his way in its labyrinth. And occasionally he makes radical statements.<br/><br/>Yet I trust him a lot more than Clinton. Trump may stumble and make errors, But with Clinton it is policy to destroy countries and polarize international relations.<br/><br/>Trump reminds me of Reagan. His \"evil empire\" statements about the Soviet Union were extreme too. Yet he was also the guy who found an opening and ended the Cold War.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471342416", "commentID": 19502383, "userID": 65143923, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502383}, {"approveDate": "1471350036", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471346436", "permID": "19502384", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ca", "parentID": null, "userDisplayName": "Jane Connolly", "commentTitle": "<br/>", "commentBody": "I viewed Trumpster's speech this evening and all I heard was fear, hate, and anger spewing out of his mouth. He isn't fit to be a president of our nation. He is ill tempered and frankly paranoid of all muslims and other religions. He is causing a problem asking us to join Putin in the fight against ISIL. We don't pal around with an KGB operative. He must be getting all his ideas from Manafort who loves Russia and Putin. What a combination of two men who shouldn't be in our politics. I am afraid that Trump is causing his voters to go out an police our polling places which is completely wrong. I can see me now at my polling place having to contend with my right to vote and a crazy follower of Trump showing up and causing problems where there is none. We already have poll watches at voting places. These followers can't come within 100 feet of a polling place. All Trump is doing is inciting his own version of terrorism asking his followers to go out there and cause problems at voting places. They should depart Manafort and Trump and send those to back to Putin.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471342447", "commentID": 19502384, "userID": 60875945, "recommendations": 295, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502384}, {"approveDate": "1471350098", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471346498", "permID": "19502393", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 22, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "the new world", "parentID": null, "userDisplayName": "fastfurious", "commentTitle": "<br/>", "commentBody": "Listening to his prattle, I was reminded of Trump hounding President Obama about releasing his college transcripts. Nag nag nag.<br/><br/>And I thought - how did Trump get a bachelors' degree from U. of Penn?  We've all seen that he isn't rational, has no ability to concentrate, can barely speak a coherent sentence, doesn't ever bother to prepare.  <br/><br/>Trump speaking about Obama to the Associated Press in 2014: \"I heard he was a terrible student, terrible. How does a terrible student go to Columbia and then to Harvard?  I'm thinking about it.  I'm certainly looking into it.  Let him show his records.\" <br/><br/>After the idiotic mess Trump's revealed himself to be, how did he ever get a degree from the University of Pennsylvania?<br/><br/>It's incredible that this ignoramus hounded President Obama for years about his college transcripts.  What nerve that took, given what Trump must have done to get his bachelor's degree.  The chutzpah.  <br/><br/>What a jerk.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471342603", "commentID": 19502393, "userID": 68481286, "recommendations": 1044, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502393}, {"approveDate": "1471350205", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1471346605", "permID": "19502202:19502429", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Concerned EU Resident", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island, NY", "parentID": 19502202, "userDisplayName": "Lorraine Huzar", "commentTitle": "<br/>", "commentBody": "Trump could care less about the people in the \"heartland\"  The problem of the people in the middle of the country keeps reelecting by and large the same Republicans who could care less about their needs.  These Republicans have obstructed every jobs bill and every other piece of legislation that would benefit these people. They're angry with the government? They should be angry with themselves for allowing these frauds to continue working in the government for the benefit of their big donors.  They didn't even have the decency to allow a clean bill for Zika Virus funding to pass before they took of for vacation. Trump is a New York socialite.  As a New Yorker I have had to hear about his exploits for years. He is no populist. He has no regard for anyone or anything  but his own interests. He's another example of how a rich man's son who has gone far on his father's money and reputation, but has not accomplished what he would have you believe", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471343195", "commentID": 19502429, "userID": 60998173, "recommendations": 542, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502429}, {"approveDate": "1471350551", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471346951", "permID": "19502541", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mahomet Illinois", "parentID": null, "userDisplayName": "rjon", "commentTitle": "<br/>", "commentBody": "Donald Trump's tortured and strained misunderstanding of the United States' place in the world is not worthy of counter argument.  Those who support him will read into his \"positions\" what they want to hear.  That's what Trump, the rhetorician, wants.  He wants people's sympathies, not their rational arguments.  He is himself not trying to present well-considered arguments concerning policy.  He knows that fact is fashioned by rhetorical power. We mustn't underestimate him nor his handlers.  Above all, he wants power and he knows that if he can leave his audience speechless, he will get his message across--the message that only he can solve our problems and allay our fears.  For most of us he is not persuasive, but he can only be countered with persuasion that garners even greater sympathy.  Facts and rationality are pretty much beside the point.  Basic human fairness, democratic sensibility, and the instinct to do no harm are not.  Trump fails with respect to these sympathies--and many others valuable, even essential, to living together and in this world.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471344622", "commentID": 19502541, "userID": 63590787, "recommendations": 243, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502541}, {"approveDate": "1471351658", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471348058", "permID": "19502557", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charleston, WV", "parentID": null, "userDisplayName": "Didier", "commentTitle": "<br/>", "commentBody": "This article has one obvious error:  \"Mr. Trump seems also to be suffering from amnesia . . . ,\" because one cannot forget what one never knew in the first place.  <br/><br/>Mr. Trump has displayed his ignorance on so many things on so many occasions, but the scary thing isn't what he doesn't know, or what he has forgotten, it is that he doesn't care what he doesn't know.  <br/><br/>As far as I've been able to observe, he has less intellectual curiosity than anyone in the history of presidential politics.  <br/><br/>In his acceptance speech, he said, \"I alone can fix it.\"  <br/><br/>When asked about foreign affairs, he said, \"I know more about ISIS than the generals do. Believe me.\"<br/><br/>Ask whether he has ever asked God for forgiveness, he said, \"I don't think so, . . I don't bring God into that picture. I don't.\"  <br/><br/>If this unprecedented combination of ignorance, arrogance, and pathological narcissism doesn't scare a majority of voters on Election Day, I'll say it because apparently you never will, Mr. Trump: \"God, forgive us.\"", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5021/0704/cropped-50210704.jpg", "createDate": "1471344798", "commentID": 19502557, "userID": 50210704, "recommendations": 450, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502557}, {"approveDate": "1471351825", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471348225", "permID": "19502630", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Everywhere", "parentID": null, "userDisplayName": "Publish this already", "commentTitle": "n/a", "commentBody": "\"But Mr. Trump’s attempt to blame (Obsma and Clinton) for unleashing the Islamic State and destabilizing the Middle East shows either misunderstanding or ignorance. \"<br/><br/>You miss a more likely reason; he's lying to stir emotions and get votes. A very dangerous game because combined with his pre-emptive charges of cheating in the election as the \"only possible way\" he could lose, he is setting the stage for riots or worse if he doesn't get the outcome he and his supporters want. At what point should this reckless behavior that literally threatens our political system and peaceful transfer of power be considered a crime? Wherever that line is, Trump seems to have crossed it long ago.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471345496", "commentID": 19502630, "userID": 55088932, "recommendations": 379, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502630}, {"approveDate": "1471351916", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471348316", "permID": "19502643", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "Marc Rabinowitz", "commentTitle": "<br/>", "commentBody": "Mr. Trump is not trying to win based on facts or coherent policies. If facts or coherent policies were a pre cursor to his nomination we would not be where we are. Mr. Trump tactics demonize his competitors and he says  he is the solution to all our problems. It's not his tactics that bother me, although I find his tactics deplorable, it's the million of people who are willing to support Mr. Trump. By supporting Trump you support his tactics and in essence weaken what has made this country great since its founding.  Although our country still has much work to do to support our constitution that all women/ men are created equal, having someone of Mr. Trumps temperament  would move us backwards. Folks who are narcissistic and play to our fears and demonize opponents should not be President of the United States. The sad thing is there are million of people in our Country who believe Mr. Trump is the answer to what ails us. Mr. Trump will loose but the millions of folks who support Mr. Trump will not go away and that should worry everyone.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471345647", "commentID": 19502643, "userID": 63530327, "recommendations": 273, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502643}, {"approveDate": "1471352195", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471348595", "permID": "19502771", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bay Area", "parentID": null, "userDisplayName": "Yuri Asian", "commentTitle": "<br/>", "commentBody": "Trump, his campaign and GOP chaos (which is a convincing case for alien abduction) have degenerated way beyond farce, well into the realm of mockery and over the bridge to felony national insult.<br/><br/>I recall how America screeched to a halt after 9/11, with the economy defaulting to super slo mo and Bush elevating shopping to an act of patriotism. For months it wasn't business as usual and a pervasive uneasiness settled in like night fog in San Francisco that holds daybreak hostage, denies the horizon and suspends all sense of time.  <br/><br/>Because of 9/11 we got stuck in time and when we next checked what day it was, shock and awe barged into our living rooms, invaded every conversation, and offered as many bitter cups of dismay and disillusionment as we could drink.<br/><br/>Trump has now far exceeded 9/11 with his circus act demanding our collective attention while the planet burns and we bicker with idiots over their idiocy.<br/><br/>Trump's foreign policy?  Is that a punch line or a pratfall? Warren Buffett noted how a chimp tossing darts at a board would have earned a higher return than Trump has with his inheritance. By Buffett's estimation we would be better off if GOP had nominated J. Fred Muggs this year. <br/><br/>This can't go unpunished. Bill Trump for wasting our time, force yet another bankruptcy just to shut him up for good. And those who voted for him should lose their vote for at least one election. Or until they pass a citizenship test. <br/><br/>Stupid does not a great nation make.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3719/6826/cropped-37196826.jpg?0.02378307383427969", "createDate": "1471346731", "commentID": 19502771, "userID": 37196826, "recommendations": 302, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502771}, {"approveDate": "1471352218", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471348618", "permID": "19502775", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jersey City", "parentID": null, "userDisplayName": "SteveS", "commentTitle": "<br/>", "commentBody": "The most interesting aspect of this to me is that Trump seems totally unaware of the extreme level of his own ignorance.<br/>Trump does not seem to understand that he knows so little about the world and that his solutions are so naive.<br/>He may actually believe that all the commentary against him is a plot by Crooked Hillary to steal the election because the alternative is to accept that he is really ignorant, and he wont accept that.<br/>Analysis by the NYT and 538 give Clinton about an 80% chance of winning the election.  What is not included in that analysis is that Trump is incapable of changing and will continue to exhibit his ignorance and incompetence through the remainder of the campaign and the debates.<br/>He does not understand that he is too ignorant to debate Clinton.<br/>The Donald will continue to damage the Republican Party, thank you Donald, and the Trump name and brand will become associated with ignorance, racism, misogyny, and incompetence.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471346764", "commentID": 19502775, "userID": 547542, "recommendations": 271, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502775}, {"approveDate": "1471354236", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471350636", "permID": "19502852", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Johnson City, Tenn.", "parentID": null, "userDisplayName": "G. Sears", "commentTitle": "<br/>", "commentBody": "Another teleprompter constrained Trump speech. Gee, he can now read a script without launching into nuclear gaff-mode. The Trump transformation has finally emerged entirely un-resplendent.<br/><br/>Who is writing this stuff for the Donald? Who are the wacky wizards behind the green curtain?<br/><br/>In many ways this is reminiscent of the wild ride of the neocons as the GW Bush disaster inexorably unfolded under their and Dick Cheney’s perverse tutelage.<br/><br/>Absent any semblance of a coherent world view, or vision for America, Trump becomes no more than a hapless figure head parroting pretty much whatever the back room boys put up on the screen. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6452/7736/cropped-64527736.jpg?0.5053697326220572", "createDate": "1471347363", "commentID": 19502852, "userID": 64527736, "recommendations": 167, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502852}, {"approveDate": "1471354255", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471350655", "permID": "19502880", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": null, "userDisplayName": "Jenny", "commentTitle": "<br/>", "commentBody": "The Middle East is a three-dimensional chess game.  However, Trump's contradictory and nonsensical proposals make it obvious he is ignorant of the players and the complicated dynamics of the region.  What is worse, he is not even interested in learning.  In true Trump style he prefers to flim-flam and then watch in glee as pundits and press dissect and analyze his \"policies\" as if they were serious.<br/>He continues to appall, but no longer to surprise.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471347533", "commentID": 19502880, "userID": 62639659, "recommendations": 195, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502880}, {"approveDate": "1471354317", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471350717", "permID": "19503616", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnati, Ohio", "parentID": null, "userDisplayName": "sd", "commentTitle": "<br/>", "commentBody": "Donald Trump wants to transform the war against terrorism into a war of civilizations. That has been the thrust of his campaign all along, which he has now clarified with his speech yesterday. Trump's \"extreme vetting\" does indeed smack of the Cold War, but then so does the incessant Putin-bashing of the Democrats and their supporters. The inconsistencies of Trump's foreign policy mirror the incompetence of the liberal interventionists in their disastrous attack against Libya and their fumbling responses in Syria.  It is sad but true that those of us who advocate for a non-interventionist policy do not have a good choice between these two candidates on questions of foreign policy. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471351473", "commentID": 19503616, "userID": 51535620, "recommendations": 15, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19503616}, {"approveDate": "1471354421", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471350821", "permID": "19503226", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sacramento", "parentID": null, "userDisplayName": "Joe Barnett", "commentTitle": "<br/>", "commentBody": "It is hard for a person who goes to work everyday, takes care of    paying the bills at night and gets the news in three minute segments between advertisements suggesting what new medicine will cure that ailment they never knew they had, to understand the Middle East.  For some it is convenient to think of Muslims as one group openly or secretly out to get us and to them Trump makes sense.  What is unforgiving is that Mr. Trump, who has wealth and means to access information, would believe this or prey on those who do.   Donald Trump is intentionally misleading the American people  to get their vote, just as he misled the consumer/students of his \"university\" so he could take their money.  He is a charlatan, a huskster,  and will do or say anything if he thinks he can profit from it.  Our country can not afford to buy what he is selling.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6375/2771/cropped-63752771.jpg?0.17809617697501567", "createDate": "1471349717", "commentID": 19503226, "userID": 63752771, "recommendations": 301, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19503226}, {"approveDate": "1471354990", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471353712", "permID": "19503768", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT", "parentID": null, "userDisplayName": "Mike S", "commentTitle": "n/a", "commentBody": "Of all the issues that represent vulnerabilities for Trump, foreign policy should be lower on the list. I state this because whether or not you agree with his campaign policy prescriptions, we have exactly 0 historical evidence to judge him on. On the other hand, Ms Clinton's track record as SoS was questionable at best. Sometimes bad experience is not preferable to no experience.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471352111", "commentID": 19503768, "userID": 65632480, "recommendations": 11, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19503768}, {"approveDate": "1471355427", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471362202", "permID": "19502978", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 19, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "jpduffy3", "commentTitle": "<br/>", "commentBody": "Like it or not, Trump is trying to put forth a program that will directly address radical Islamic terrorism and prevent radical Islamic terrorists from having easy access to the United States. A central part of his presentation was that anyone who denies the existence of radical Islamic terrorism and its effects cannot deal with it effectively. The Editorial Board, in their obvious dislike for Trump and everything he does and thinks, completely ignores the very important issue of radical Islamic terrorism and what should be done about it. <br/><br/>Notably, the Editorial Board could only bring itself to talk briefly about \"Islamic extremism\" and nothing about its effects. It is easy to criticize. It is more difficult to come up with workable solutions. The Editorial Board chose the former and ignored the latter. This article was a complete waste of time for anyone interested in advancing the discussion of what needs to be done to deal with radical Islamic terrorism. At least Trump is trying.<br/><br/>The Editorial Board does not seem to be aware that the official text of Trump's speech contains over 100 footnotes citing to sources for the factual statements made. Anyone interested in seeing that information can find it at <a href=\"https://assets.donaldjtrump.com/Radical_Islam_Speech.pdf\" title=\"https://assets.donaldjtrump.com/Radical_Islam_Speech.pdf\" target=\"_blank\">https://assets.donaldjtrump.com/Radical_Islam_Speech.pdf</a>. It might be worth a read for those who want to get a better perspective.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471348252", "commentID": 19502978, "userID": 36458645, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502978}, {"approveDate": "1471355867", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471352267", "permID": "19502830", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "manhattan", "parentID": null, "userDisplayName": "rick", "commentTitle": "<br/>", "commentBody": "Maybe the Republicans should employee \"extreme vetting\" in selecting their nominee and spare the country from enduring the global embarrassment of Donald J. Trump. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471347139", "commentID": 19502830, "userID": 63543308, "recommendations": 283, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502830}, {"approveDate": "1471357562", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471353962", "permID": "19502947", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "No teleprompter can help him. No amount of coaching will do. Trump won't listen to any of them. Trump is in charge, you see. He is the only one who knows what to do. <br/><br/>Trump knows all. He knows more than any Justice what allegiance to the Constitution means. He'll write the \"Extreme Vetting\" test himself f he has to. <br/><br/>He has a brilliant brain, you know? Trump knows more than the Generals and Admirals who conduct our numerous foreign entanglements do. He'll set them straight and let them know how things should be done. Trump knows what's best for all of us. <br/><br/>Remember? Trump told us that he and only he can help us. He told us so during his acceptance speech at the RNC convention in Cleveland, a city which has been doing its best to rid it of the bad rap that was once applied to it: The Mistake By The Lake. <br/><br/>That Cleveland is no more. It has shed that albatross. That definition now belongs to Donald J. Trump. Whether he's by a lake or not, wherever Trump goes he is the mistake America deserves as a wake-up call to see what a dictatorship is all about. Trump is the accident waiting to happen should America ever stoop so low as to believe this nincompoop actually is the answer to our problems. Trump is not the solution to our problems, he is the problem.  <br/><br/>DD<br/>Manhattan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471348074", "commentID": 19502947, "userID": 22528152, "recommendations": 133, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19502947}, {"approveDate": "1471359802", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471356202", "permID": "19504411", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Mor", "commentTitle": "<br/>", "commentBody": "One of the worst consequences of Trump's embarrassing campaign may be that certain subjects will become so tarred by his brush that a rational and informed discussion will become impossible. It is harder, not easier, to criticize Islam after Trump's outpouring of ignorant xenophobia. Like any religion or ideology, Islam should be a legitimate target of intellectual analysis and critique - but try to suggest that Islamic theology may have elements that give rise to political violence, and you risk to be called Trump's supporter. While I voted for Obama twice, I am unhappy about his lack of international leadership and weak foreign policy - but if I voice my reservations, I may sound like Trump. I am against admitting Syrian refugees into the country unless they belong to the groups who are the target of genocide: Yazidis, Alawites, Christians, and secular Muslims. But even discussing this issue honestly has become impossible after Trump. Please, can he just concede to Hillary and go away?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6506/7919/cropped-65067919.jpg?0.6406161307822913", "createDate": "1471355208", "commentID": 19504411, "userID": 65067919, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19504411}, {"approveDate": "1471360012", "commentType": "comment", "userTitle": "NULL", "updateDate": "1471362242", "permID": "19504238", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MT Vernon, NH", "parentID": null, "userDisplayName": "Ken", "commentTitle": "n/a", "commentBody": "You have turned what was supposed to be a Trump hit job into a halfhearted defense of Obama's and Hillary's abject failures in Middle East policy. <br/><br/>Extreme vetting of immigrants, as described, makes perfect sense.  Our immigration policy defines under what circumstances people may immigrate to the US.  Should we not expect new immigrants to accept their new country's social norms and laws as a prerequisite?  Should we allow people to immigrate here if they refuse to accept LGBTQ individuals and women as equals?  Of course not.  Our immigration policy is designed to bring in individuals that will positively contribute and we get to choose who they are.  The NYT's open border, anyone can come, immigration policy is not what our laws say. <br/><br/>Trump is espousing a much less interventionist foreign policy. It is shameful that the NYT now describes the possibility of a less warmongering US as \"dangerous\".   It is the height of hypocrisy. <br/><br/>Trump is some kind of quisling for having the audacity to suggest that we should build better relationships with Russia?  The NYT apparently believes that we should continue to irritate Russia in the hope of starting some kind of conflict or threat of conflict to continue a steady revenue stream for the military industrial complex as Hillary will do. <br/><br/>Hillary has been and is an interventionist.   Virtually every foreign policy she was involved in was a complete failure for everyone but arms merchants.  We need a new and fresh direction.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1471354353", "commentID": 19504238, "userID": 46900727, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19504238}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1269, "api_timestamp": "1488822327", "totalReplyCommentsFound": 618, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}