{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 22, "totalParentCommentsFound": 468, "totalEditorsSelectionFound": 22, "depthLimit": 0, "totalRecommendationsFound": 576, "comments": [{"approveDate": "1467454473", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467450873", "permID": "19020482", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "Andy", "commentTitle": "n/a", "commentBody": "Trump supporters have already processed and accepted his faults. Just running negative ads depicting him as a buffoon won't work. Hillary has to make a positive emotional connection with the angry white guys, which, given her personality and gender, will be a challenge.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467425671", "commentID": 19020482, "userID": 34511279, "recommendations": 228, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19020482}, {"approveDate": "1467454892", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467451292", "permID": "19020771", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "The Village", "parentID": null, "userDisplayName": "Sera Stephen", "commentTitle": "<br/>", "commentBody": "At this point, the thing that American want most is simply not to be lied to. <br/><br/>That was Bernie Sanders’ strongest quality, and it got an old Jewish socialist farther than anyone thought possible a year ago.<br/><br/>Trump is a born liar, he can’t help himself. But a lot of his fans consider that a feature, not a fault.<br/><br/>Hillary needs to look America in the eyes and tell the truth, every chance she gets. It’s the one area Trump can’t possibly compete.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6463/5526/cropped-64635526.jpg", "createDate": "1467428220", "commentID": 19020771, "userID": 64635526, "recommendations": 469, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19020771}, {"approveDate": "1467454932", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467451332", "permID": "19020772", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "Part of the problem in coping with a candidate like Trump stems from the temptation to imitate his methods.  Some pundits have stressed the effectiveness of his stump speeches, in which he appeals to the emotions rather than the intellect.  Clinton, by contrast, delivers wonkish orations that clarify her proposals but fail to arouse enthusiasm even among her supporters.<br/><br/>The editorial implies that Clinton should infuse more emotion into her message without incorporating the toxic elements that infect the very core of Trump's proposals.  Clinton has the capacity to alter her approach, as she did in the speech that demolished Trump's pretensions to expertise in foreign policy.  But she cannot shift the focus of her entire campaign unless she first decides on a theme that encapsulates her goals for this country.<br/><br/>Bernie Sanders challenged her effectively, because he hammered incessantly at the problem of growing economic inequality and championed a few policies to reverse that harmful trend.  Clinton, by contrast, has emphasized the need to ameliorate a litany of weaknesses in American society and the economy. She has  not developed an overarching theme that would link the reforms she proposes and clarify her vision of the nation's future.  <br/><br/>Trump has championed an America that protects itself from hostile outsiders through walls.  Clinton needs to counter with a passionate reminder that our openness to, and engagement with, the outside world made us great in the first place.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467428222", "commentID": 19020772, "userID": 63418614, "recommendations": 173, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19020772}, {"approveDate": "1467459271", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467455671", "permID": "19022395", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Wisconsin", "parentID": null, "userDisplayName": "A. Bloom", "commentTitle": "n/a", "commentBody": "Elizabeth Warren is the obvious solution to Clinton's less-than-inspiring campaign. Warren's fiery attacks on Trump attract the same excited media coverage as his crazed rants do, but Warren's remarks have substance. She combines an intellectual grasp of the political and economic forces that are driving this election with a fierce delivery that excites crowds the way Clinton never will. Warren's entire political career aligns with the defining issue of this election -- the anger of workers and the middle class about the plundering of our economy by the wealthy. Clinton's newfound concern with the concentration of wealth at the top at everyone else's expense is a tough sell, given her past trade stances and Wall Street connections, but Warren's impassioned arguments ring true. The Sanders following that can hardly bring itself to back Clinton, even against the infantile and fascist Trump, would come roaring out with Warren on the ticket.<br/><br/>Clinton can choose a \"safe\" running mate and slog along with a conventional campaign in this anything-but-conventional election, hoping Trump's own incompetence drags him down and that cooler-headed voters will prevail in a most heated contest; or she can address the issues and the mood of the electorate head-on with the choice that would bring real fire to her campaign: Elizabeth Warren.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467457832", "commentID": 19022395, "userID": 213789, "recommendations": 192, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022395}, {"approveDate": "1467459276", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467455676", "permID": "19021174", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rochester", "parentID": null, "userDisplayName": "Dwain", "commentTitle": "<br/>", "commentBody": "Hillary could forget about Trump if she were to take off the 'establishment blinders' and recognize what people are worried about. We are worried about a Congress that cannot protect us from \"free but not fair\" trade deals, a tone-deaf political establishment that only listens to the loudest voice in the room, then goes back to DC to work on laws that appease that voice. American workers are suffering while the oligarchs keep pushing for more and more of the economic pie. In effect, if Hilary were to realize the power inherent in Bernie Sanders' surprisingly successful campaign, she could forget about Trump. She could run with the people. Not with the bankers.<br/><br/>To her credit, she does that with reproductive rights, children's health, and many other issues. But in the central disenchantment of the American working class who get by with earning a living, she has a base. But so far she is unwilling to play to it except for occasional teasers made to look genuine and failing. We are fed up with the .1%, the 1% and the best government money can buy. She seems clueless that this is the issue. It is the issue all over the world, and political establishments are failing everywhere because the politicians are tone deaf to it. Probably because they owe their existence to the very thing that is making life intolerable for the majority of people: the overweening greed and blind desire for profit of the rich and powerful.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2611/8710/cropped-26118710.jpg?0.3417148418836835", "createDate": "1467432817", "commentID": 19021174, "userID": 26118710, "recommendations": 224, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19021174}, {"approveDate": "1467459281", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467455681", "permID": "19021688", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Guy", "commentTitle": "<br/>", "commentBody": "If Clinton right now can't do better than a statistical tie with Trump among all registered voters - as a Quinnipiac poll just reported - it's Democrats (and the country), not Republicans, that are facing a disaster in November.<br/><br/>Clinton has always been a weak candidate, widely disliked and mistrusted for whatever reasons. But that's not the main reason she (and we) are in trouble.<br/><br/>If half of the nation's registered voters are saying now they would vote for Trump, then not all of his support is coming from ignorant, uneducated, racist, sexist, xenophobes as her supporters keep telling us. It also means that half the country is still not scared of a Trump victory, despite the best efforts of most of the mainstream media.<br/><br/>The problem is that she is unsuited and unable to convince most voters that she stands for anything more than the status quo. That might work in a normal election year, but this is not a normal year.<br/><br/>She may be throwing Sanders a grudging bone or two, but she doesn't seem to get that the majority of voters are sick of the status quo. They believe, with  justification, that they have been betrayed by the status quo, that dramatic, even inspiring, changes are needed. Incrementalism isn't selling this year.<br/><br/>If Clinton cannot show convincingly that she's ready and willing to make dramatic changes, she (and we) will likely lose. The mood of the country demands inspiration, as provided by Obama and now Sanders. Otherwise, we will get impatience and anger.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467440657", "commentID": 19021688, "userID": 53389822, "recommendations": 212, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19021688}, {"approveDate": "1467459288", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467455688", "permID": "19022436", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rochester, MN", "parentID": null, "userDisplayName": "OldBoatMan", "commentTitle": "<br/>", "commentBody": "I'm a Democrat and I'm worried.  This election is shaping up to be one of the toughest elections ever for the Democratic Party.  My friends and neighbors view Donald Trump with fear and loathing.  He is losing my home state faster than a snowball melts on the 4th of July.  But Minnesota is not a bellwether state.<br/><br/>Donald Trump is not a leader or even a politician.  He's a reality TV celebrity giving the performance of a lifetime.  Mr. Trump is neither a fool nor an evil genius.  He knows that working-class voters have grievances and are angry.  Mr. Trump senses that he can win by using his showmanship to channel that anger.  He is the perfect Republican candidate because he realizes that angry voters won't even listen to solutions until they have been assured that they  have been heard and their grievances are just.<br/><br/>The challenge is not to underestimate Hillary Clinton's continuing ability to ignore the concerns of aggrieved working-class voters. Ignoring their grievances, as Mrs. Clinton does, is different from addressing those grievances  and assuring working-class voters that their grievances are just and will be addressed by her administration. That is the task that remains ahead for Hillary Clinton.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467458441", "commentID": 19022436, "userID": 20818051, "recommendations": 230, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022436}, {"approveDate": "1467460709", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467457109", "permID": "19021218", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Santa Monica", "parentID": null, "userDisplayName": "Dana", "commentTitle": "<br/>", "commentBody": "For many people voting for Mr. Trump, this isn't a substantive choice based on the issued.  They either like him and everything that spews from his mouth or they dislike Hillary Clinton so much that she could be running against a three headed alien and they would vote for it.  To the rest of us, who understand what's at stake this election - its' frightening and infuriating.  But, at this point - i'm not sure what, if anything, Ms.  Clinton can do?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467433282", "commentID": 19021218, "userID": 71481505, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19021218}, {"approveDate": "1467461076", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467457476", "permID": "19022754", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palmer Township, Pa.", "parentID": null, "userDisplayName": "David", "commentTitle": "<br/>", "commentBody": "A good number of people will always follow the \"party line\" though matter the candidate.   Another number will actually analyze the situation and make their decision on either who is best for their own interest and/or our nation's. If Hillary is elected the gridlock in Congress will not be broken unless people vote out the GOP crowd who put their party's interests ahead of the nation.  The problem is that many have no idea how our system works.  If people really cared about \"the voice of the people\" there would have been rage against the Electoral College system in 2000, instead of barely a whimper.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467460879", "commentID": 19022754, "userID": 47494064, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022754}, {"approveDate": "1467461281", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467457681", "permID": "19022701", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnati, Ohio", "parentID": null, "userDisplayName": "PaulB", "commentTitle": "<br/>", "commentBody": "If the FBI investigation concludes that HRC's private email violated national security, all bets are off. If it recommends that she be indicted, the race is over.<br/><br/>But even if she survives this latest self-inflicted wound, Hillary is vulnerable simply because many voters are tired of her and tired of the Clinton's constant skating along the edge of ethical behavior. People seem to be in a nasty mood, and they are venting their anger at a political process that is both toxic and inefficient. In such a negative environment we could be looking at a cathartic moment in our history, leading to a total charlatan in Trump winning in November, and four or eight long years of remorse to follow.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467460521", "commentID": 19022701, "userID": 6136710, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022701}, {"approveDate": "1467461566", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467457966", "permID": "19022628", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Milwaukee", "parentID": null, "userDisplayName": "Cheeseman Forever", "commentTitle": "<br/>", "commentBody": "The question is whether you can win without a sizeable share of the \"disaffected white man\" vote. I think it's arguable that the answer is \"yes\" -- that changing demographics and the growth of the Millennial age group (which has now surpassed Boomers) make it less critical to appeal to the bloc of voters that Trump is speaking to. <br/><br/>Pittsburgh is a good example of a city that is being redefined by tech and biomedical research, and by a surge in younger and more diverse residents. The pandering appeal that \"we'll bring back the steel industry\" (not very likely) is falling on a diminishing set of ears. You can make this case for city after city around the country, and it's the cities and suburbs that will define this election. <br/><br/>All this being said, can Clinton take a more consistently populist tone? Sure, and \"I feel your pain\" was a Bill Clinton specialty during the 1992 recession. I often feel that she is trying to cover every possible wedge issue (check her Twitter feed on any given day) instead of remembering that \"it's the economy, stupid.\" ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467460023", "commentID": 19022628, "userID": 8142502, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022628}, {"approveDate": "1467461911", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467458311", "permID": "19022557", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "The Clintonistas need to recognize that, in Trump, it's nothing person between the two of them.  Politics at the level being played is a blood sport.  There will be anger, vitriol and tactical/strategic gaming of the field of battle; and in huge amounts, and by both sides.  But the Clintonistas need to recognize they are battling a figurehead; a mist.  One that has arisen out of a populist anger, and that angers need for making itself felt among the Elites who don't comprehend it.  Trump represents inchoate rage and fear, much as the Brit vote did for the United Kingdom.  The Clintonistas should not be taking the war to the figurehead.  They need to address the source of it, directly.  <br/><br/>And this is their main problem.  For as good as the Clintonistas may be; as capable as they like to think they are they - like all of their ilk in our American Political class - seem tone deaf to some fundamental realities being lived day in and day out by the average American.  Let me be clear, I will not vote for Trump.  He does not have the qualities of leadership I require.  He's more an ambitious grifter aiming at the prize.  But it's matched by my distaste for the Clintonistas and the bastion of privilege they represent.  A more clueless group I have not seen in some time.  Which leave me, the voter, in something of a pickle.  Regardless, it'll be interesting to see how this all plays out.<br/><br/>John~<br/>American Net'Zen", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467459463", "commentID": 19022557, "userID": 65500914, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022557}, {"approveDate": "1467461994", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467458394", "permID": "19022915", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Hartford", "parentID": null, "userDisplayName": "nzierler", "commentTitle": "<br/>", "commentBody": "The issue is not old-style politics beating Trump. The real question is can Trump continue to trip himself up enough to lose the election by default? So far, it's working.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467461971", "commentID": 19022915, "userID": 13957398, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022915}, {"approveDate": "1467462304", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467458704", "permID": "19022826", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CT, USA", "parentID": null, "userDisplayName": "DK", "commentTitle": "<br/>", "commentBody": "The real challenge is that Trump's candidacy exists in a fact-free zone, an alternative reality based on a web of innuendo, rumor, fabrication and outright lies, all intended to stoke the fear and hatred of a low-information populace.  Outlets like FOX News, WorldNetDaily, and Drudge are reaping the diseased harvest they have sown over decades when a virtual industry of Clinton hatred arose and flourished on talk radio and in right-wing propaganda publishing, all laying the groundwork for a Trump candidacy.  Trump voters are not, by and large, NYTimes readers.  Following the poison pen Tweets of their reality TV avatar, they are not likely to be swayed by detailed documentation of Trump's House of Cards birtherism, hucksterism, and outright lies.<br/>Trump true believers take the worst allegations against the Clintons as accepted truth to the point that many view Hillary as the Devil incarnate.  The anti-Clinton forces have so poisoned the well of public perception that the innuendo of Clinton untrustworthiness became a factor in the Democratic primary campaign.  Hillary's years of child advocacy, leadership in the struggle for healthcare for all, her grueling work to forge and strengthen diplomatic ties as an advocate for human rights and world peace are for naught in the face of the onslaught of innuendo and outright hatred that have already contaminated this discourse.<br/>In the face of such opposition, Hillary's campaign is a source of reassurance and hope.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467461348", "commentID": 19022826, "userID": 3460493, "recommendations": 106, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022826}, {"approveDate": "1467462857", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467459257", "permID": "19021406", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "PeterS", "commentTitle": "<br/>", "commentBody": "I hope that Mrs. Clinton would win but I am fully aware that historical tide is with Mr. Trump. I am an immigrant and a liberal. However, I may not be aware earlier that I am also a patriot. I do not care about campaign style but I do care about what America stands for. For me, America stands for everyone to have the same right and opportunities regardless of your race, religion, wealth, background or personal choices. If Mr. Trump would win, what saddens me most are not my personal disadvantages but his win would sully one of the best society that mankind has created. I think that fighting for the ideals that are America is enough for me to oppose the rise of Mr. Trump and his ideology. We may not win but this is a generational fight for the American soul. If you support Trump just because of economic injustice, just because that you have been ignored by the elites, just because that your world is changing beyond your recognition, or just because you are mad, you must ask if these are good enough reasons to support a selfish salesman who will surely undermine the foundational principles of America for his personal glory. You must ask if you can live with your conscience. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467435692", "commentID": 19021406, "userID": 50973161, "recommendations": 119, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19021406}, {"approveDate": "1467462904", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467459304", "permID": "19022406", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "hamilton, ontario, canada", "parentID": null, "userDisplayName": "bob ranalli", "commentTitle": "<br/>", "commentBody": "We don't know who we are voting for; the candidates read words prepared by others and offer positions crafted by their team.  With the outspoken Donald, you have the belief you are seeing the real thing, whether you agree or not. And it's proving to resonate louder than 8 figure advertising campaigns.  Good sense big organization and well financed campaigns don't always win the day - look at Britain.  He could win.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467457962", "commentID": 19022406, "userID": 66159887, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022406}, {"approveDate": "1467464491", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467460891", "permID": "19022076", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "KENT, UK", "parentID": null, "userDisplayName": "Dr Paul Camic", "commentTitle": "<br/>", "commentBody": "With shock and horror we looked upon the votes coming in as the Leavers won and are now taking the UK out of the EU. Many of those voters were white working class English women and men angry about government, feeling left behind and also feeling threatened by foreigners and modern life. They needed to pin a lot of their problems on someone and the EU was the perfect target. Forget that much of the inequality in this country is related to policies coming from London and not Brussels. Forget rationality, facts, well thought out arguments. They did not work well enough. They worked in Scotland, London, Northern Ireland and a few other areas in the UK but not in the heartlands of England or Wales. They worked among those with university educations but not at all with those with only secondary school qualifications. I don' have a suggestion for the Clinton campaign to follow except it needs to be less intellectual and more emotional, more passionate. The Leave campaign here was passionate in their lies and a few key political headline adverts became impossible to circumvent: Make Britain Great Again, Take Back Our County, £350 million More for the NHS, Don't let Brussels Make Our Laws. Our version of Trump, Boris Johnson, won the day. His personality and larger than life persona won the argument and yet today he is disgraced so quickly after the referendum. If Trump wins, and I feel it very possible given the dynamics of the US at the moment, it will be more dangerous for us all", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467453713", "commentID": 19022076, "userID": 73457217, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19022076}, {"approveDate": "1467464693", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467461093", "permID": "19023294", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlotte, NC", "parentID": null, "userDisplayName": "Ronald J Kantor", "commentTitle": "<br/>", "commentBody": "She has to be very specific about how  she would help dispossessed, out of work or in low paid job people who live all across the rural areas of NC.  They are desperate and need to see some way out.  Bernie Sanders connected with those people.  Hillary does not unless she does something.  Funny, having spent time in Arkansas, you'd think she'd be willing to gut a fish or milk a cow to show she's not just some hoity toity.<br/>No mush talk.  Specifics for the white dispossessed.  Now!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5916/3992/cropped-59163992.jpg?17449530732071961375", "createDate": "1467464101", "commentID": 19023294, "userID": 59163992, "recommendations": 34, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19023294}, {"approveDate": "1467465182", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467461582", "permID": "19021930", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "the new world", "parentID": null, "userDisplayName": "fastfurious", "commentTitle": "<br/>", "commentBody": "I've been convinced since he announced this is Trump's election to lose.  Given his strong polls following unforced errors, naked racism, revelations about corruption &amp; generally offensive behavior, that remains true.<br/><br/>This contest echoes Isaiah Berlin's essay \"The Fox and the Hedgehog.\" \"A fox knows many things, a hedgehog knows one important thing.\" Hillary sees the world through many complicated ideas &amp; experiences. She seems unfocused &amp; frequently changes positions. Her pitch is carefully &amp; dispassionately about her intelligence, wide-ranging experience &amp; cautious temperament.  <br/><br/>These things would work for her in any year but this one. Trump, the hedgehog, knows one thing but it's one really big important thing: this is a change election. Trump's determined to be authentic &amp; stand for change. His supporters believe a single powerful thing: the government is corrupt &amp; doesn't care about them. Their precarious economic problems are proof. Trump claims he alone hears their concerns &amp; will fix things. <br/><br/>Trump message is singular: I hear you, you're right this is awful &amp; I alone will fix it.  His supporters don't understand everything wrong in their lives - but they feel it.  This year, feeling it emotionally overrides all other concerns. On this, Trump is clear as a bell.<br/><br/>Calling Trump a fraud/racist/demagogue doesn't matters to folks who don't feel represented.<br/><br/>The current Hillary campaign is clueless about this &amp; can't compete with it. She must change or she'll lose.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467448901", "commentID": 19021930, "userID": 68481286, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19021930}, {"approveDate": "1467470505", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467466905", "permID": "19024494", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "philadelphia", "parentID": null, "userDisplayName": "farhorizons", "commentTitle": "<br/>", "commentBody": "You don't get Trump's appeal at all.  First of all, he is the un-Clinton.  To us who were Bernie supporters, that means a lot; we don't want another untrustworthy Clinton in the White House.  In fact, that may be Trump's only appeal.  He is not a puppet of the establishment, including the NY Times.  We need to get off the path of the elitist status quo, and electing Trump seems to be the only way to do this. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467469995", "commentID": 19024494, "userID": 53636845, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19024494}, {"approveDate": "1467470579", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467467593", "permID": "19024473", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "\"Can old style politics beat Donald Trump?\"  I'd like to rephrase that:  \"Can the electorate hang onto Sanity in the face of a Paranoid Pull?\"<br/><br/>Trump is selling Paranoia.  Whether he believes in it or not does not matter.  <br/><br/>If I were Hilary right now, I'd be looking to the Brexit vote.  Which to me was the triumph of a paranoid view of the EU.  A narrow conception of present reality, lacking in an end game (if one throws out the baby with the bath water). Versus a more nuanced view of the present, along with a clear-eyed conception of the Danger of following a Demagogue and an emphasis on courage and unity.<br/><br/>I realize the Editorial is looking at the nuts and bolts aspect of the two campaigns.  But I'm not sure it's nuts and bolts that will win this.  I think it's hearts and minds.  Particularly Sane Minds.  Versus hearts pulled astray by a paranoid philanderer..<br/><br/>As I see it, Trump supporters are potentially \"lost\" unless, sadly,  they are pried from one paranoid view to another.  While it's the folks in the middle, whose sanity, in terms of an ability to think based on reality, must be appealed to.  And mobilized.<br/><br/>Maybe I'm wrong.  But if so, that portends a time of paranoia in our land.<br/><br/>It's a question of risk.  How to deal with risk.  Do we want a risky vote like Britain woke up to?  A vote for \"break it\"?  Or do we need a vote for sanity. For clear-eyed reality?  For unity and \"we're all in this together\"?<br/><br/>Go with the courageous, inspiring pick for VP:  Warren!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1467469917", "commentID": 19024473, "userID": 32195826, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19024473}, {"approveDate": "1467473260", "commentType": "comment", "userTitle": "NULL", "updateDate": "1467469660", "permID": "19024923", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Savannah", "parentID": null, "userDisplayName": "SMB", "commentTitle": "<br/>", "commentBody": "Trump isn't just appealing to aggrieved working-class voters: he is appealing to all bigots, and some are responding with great enthusiasm.  But at the same time, he is repulsive to many other Americans such as women, educated people, and those who value traditional American principles such as equality, civility and common sense.  His rallies appeal to white supremacists, homophobic, misogynists, and others.   Trump more credible supporters know that he is crazy but he is giving voice to their own prejudices and fears.  Will Rogers said, \"We don't know what we want, but we are ready to bite somebody to get it.\"<br/><br/>Clinton may be muted in comparison to Trump's megaphone of hatred, but she is reliable, knowledgeable, experienced, and has a long record of supporting the rights of Americans including those of women and children, veterans, and others.  Also, she is sane, rational, and a grown up.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1467472529", "commentID": 19024923, "userID": 9271683, "recommendations": 41, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19024923}], "totalEditorsSelectionReturned": 22, "replyLimit": 3, "totalRecommendationsReturned": 22, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 820, "api_timestamp": "1488822349", "totalReplyCommentsFound": 352, "totalCommentsReturned": 22, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}