{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 7, "totalParentCommentsReturned": 18, "totalParentCommentsFound": 388, "totalEditorsSelectionFound": 29, "depthLimit": 0, "totalRecommendationsFound": 442, "comments": [{"approveDate": "1480326899", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480349575", "permID": "20624980", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SW Ohio", "parentID": null, "userDisplayName": "pedigrees", "commentTitle": "<br/>", "commentBody": "The \"replacement plan\" idea that enrages me the most is the one that relies on health savings accounts. Those who push this are the same people who believe that wages can never be low enough. They're the same politicians who fight every rise in the minimum wage. They're rabidly anti-worker. They're against any initiative that will raise the income of average working Americans. <br/><br/>So where are these hard-working Americans supposed to get the extra income to put into these health savings accounts? From what's left over after they self-fund their retirement because they no longer have a pension and the same politicians who are pushing health savings accounts also want to destroy Social Security? From that money tree in the back yard? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480326771", "commentID": 20624980, "userID": 65535536, "recommendations": 1129, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20624980}, {"approveDate": "1480329324", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480329324", "permID": "20624991", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Between Alpha &amp; Omega", "parentID": null, "userDisplayName": "Nemo Leiceps", "commentTitle": "<br/>", "commentBody": " The republicans have no ideas?  Not so fast.  Indiana asked for approval of an alternative program and got it.  It's now in it's third year.  Why else would anyone think mike pence would have any pull with trump?  Both will hold up the Indiana plan as a model for the rest of the country. Do not listen to them.<br/><br/>I've spent those three years in jobs as working for the state and insurers.  Cronyism, and no end to cooking the books abound even from what a low level customer service representative can tell is rampant and baked into the program through out.<br/><br/>High risk pools?  In Indiana the number of disabled are palpable and visible from the number of license plates with the wheelchair symbol to the number of handicapped parking spaces ringing every business and full with cars with those plates.  Funny thing though, I've spent months talking with truly disabled people who cannot get designation as disabled or handicapped while those who have the designation have a decidedly greater spring in their step and money to spend at the mall where those spaces are.<br/><br/>Yes, I understand that not all handicaps and disabilities are not visible or affect one's gait, but I have spoken to now hundreds of people with access to their medical records.  While a collusion between the state and private insurers exclude or kick really sick people off through red tape and back room rigging, others have no problem with considerably less impinging health.  <br/><br/>Indiana models it's who you know not what..", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5950/3817/cropped-59503817.jpg?5441659221458807950", "createDate": "1480327260", "commentID": 20624991, "userID": 59503817, "recommendations": 177, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20624991}, {"approveDate": "1480329349", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480329349", "permID": "20625008", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, TX", "parentID": null, "userDisplayName": "rf", "commentTitle": "<br/>", "commentBody": "Always keep in mind that Republicans, in general, are opposed to the federal government having any direct role in providing healthcare.  Their ideology of always looking for market-based solutions to every problem or program (except for building a strong military, of course) supersedes their interest in helping people. For quite sometime, we have been the only industrialized country without universal healthcare.  I wouldn't be surprised that soon we are the only country in the entire world without such a plan.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480327672", "commentID": 20625008, "userID": 32944981, "recommendations": 426, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625008}, {"approveDate": "1480329461", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480329461", "permID": "20625016", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Meredith", "commentTitle": "<br/>", "commentBody": "Obamacare should be replaced. Even Bill Clinton called it ‘crazy’ and over complicated. It’s a bad system that doesn’t reach 20th C standards of other nations, it costs a fortune just to preserve corporate profits as 1st priority, and burdens tax payers and premium payers. Congratulations, Democrats. <br/><br/>But the Dems didn’t exactly have any great plans for reform. And their media supporters were busy excusing ACA as a great improvement, downplaying its problems on the NYT op ed page.  Anything would be better than the past atrocious system of abuse resulting in early death, disability and bankruptcy.  We need more than the incremental improvements, whatever they were going to be if Clinton had won.  <br/><br/>Of course, it will be worse under Gop rule.  We have to disregard anything our new president says. <br/><br/>The real question is --who are the big insurance and drug companies planning to sponsor for the 2020 election? Can’t wait to find out. We’ll see what compromises unfold. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480327956", "commentID": 20625016, "userID": 28617892, "recommendations": 62, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625016}, {"approveDate": "1480329470", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480329470", "permID": "20625017", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Houston", "parentID": null, "userDisplayName": "Diana Stubbe", "commentTitle": "<br/>", "commentBody": "My hope is that this doesn't turn into pay to live. Sure, you can have insurance if you can afford it. Sure, you can have healthcare if you can afford it. Sure, you can retire if you can afford it. <br/><br/>Can't afford it? Can't help you.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480327968", "commentID": 20625017, "userID": 65398807, "recommendations": 719, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625017}, {"approveDate": "1480329688", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480329688", "permID": "20625033", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Englewood, FL", "parentID": null, "userDisplayName": "Nancy Parker", "commentTitle": "<br/>", "commentBody": "Republicans - even the great white hope - Trump - just don't get it.<br/><br/>Health Savings Accounts are a joke to people, who work hard to pay the bills and have nothing \"left over\" to stash away in a \"savings\" account.  If we could scrape something together, it sure wouldn't be enough to cover the cost of the ambulance, emergency room, ER doctors and tests from one fall, let alone to cover the costs of a major medical event.<br/><br/>Living on two minimum wage jobs, two people work 80 hours a week but don't make enough to pay Federal income taxes - so the tax free part of the savings accounts doesn't really matter.<br/><br/>High risk pools?  Those who don't know history....<br/><br/>The only permanent solution is to get profit out of health care.  Insurance companies provide no health care, they treat no wounds, they save no lives - but they have the lives of many in their hands when they decide to grant or deny treatments - based on the bottom line, not on the good of the person - their individual policy holder. Who knows how they set rates?<br/><br/>The obscene profits of the pharmaceutical companies needs to be reigned in.  Profit for R&amp;D and for safety testing is fair but prices far exceed that.<br/><br/>Lab tests and MRI's and Cat scans and all the others, contain profit dollars.<br/><br/>Until we recognize that good health care is a right of our people, from crib to grave, as a governmental function, in the richest, greatest country there has ever been, can we solve this problem with our hearts connected to our wallets. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480328222", "commentID": 20625033, "userID": 39620600, "recommendations": 941, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625033}, {"approveDate": "1480333920", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480333920", "permID": "20625135", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WNY", "parentID": null, "userDisplayName": "D", "commentTitle": "<br/>", "commentBody": "For a preview of how this could play out, just look to Arkansas, where I lived for several years and where Medicaid was expanded. Every statewide office became Republican with the 2014 election and the legislature had their chance to throw expanded Medicaid right back out.  A task force concluded that rolling back the ACA's provisions would force hospitals to close and blow a $450 hole in the state budget over five years in addition to throwing off tens, if not hundreds, of thousands of people off the insurance rolls.  And yet even the cold hard math didn't stop a group of legislators from trying to hold up the state appropriations budget anyway because they were so adamantly opposed to the ACA.  Some legislators are just that crazy.<br/><br/>The ACA works, and any perceived failures - including the rising premiums in some states - are due to Republican party leaders undermining the law's provisions at every level.  I can't help but think the current situation in Washington is basically the dog who caught the car.  Ryan and McConnell would do well to keep all of the ACA's provisions going while they figure out whether they can make the math add up. I suspect they won't be able to. The question then becomes whether they stabilize the exchanges by increasing the subsidies and the risk corridor payments, or whether they're willing to throw the country under a bus.  Based on my experience in Arkansas, throwing us all under a bus is not out of the question.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480329974", "commentID": 20625135, "userID": 10135671, "recommendations": 594, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625135}, {"approveDate": "1480337230", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480337230", "permID": "20625384", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 19, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tokyo", "parentID": null, "userDisplayName": "Jonah", "commentTitle": "<br/>", "commentBody": "We already know how to run a good healthcare system -- because every other first-world country has been doing it for decades. Their healthcare systems cost half as much, yet cover everyone and give equivalent outcomes. <br/><br/>And, no, it's not because they're saving on defense (that whole \"costs half as much\" is the clue); nor because they're leeching on US research (two of the three biggest pharma companies are European); nor because they're smaller (by that argument the US is bad at everything; in any case, health -- like law enforcement, education, etc -- is run locally). <br/><br/>So is America corrupt or just stupid? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480333266", "commentID": 20625384, "userID": 62713120, "recommendations": 528, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625384}, {"approveDate": "1480337607", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480349616", "permID": "20624980:20625486", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "pedigrees", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "undefined", "parentID": 20624980, "userDisplayName": "Nancy", "commentTitle": "<br/>", "commentBody": "pedigrees: In defense of HSAs (I have one, and I not wealthy), let me explain that it is possible to set up a win-win situation with one's employer. Back in 2002, as the local union president, I negotiated a health insurance plan that involved a pre-taxable income payroll deduction and an employer contribution to the HSA, which is a tax-sheltered savings account. Thus, the tax savings were in three different places. Not only that, but the HSA earns interest (and is transferable if one changes employers). The employer was able to save money EVEN WITH the employer contribution because the higher deductible plan was so much cheaper. As a consumer, I also had a cheaper premium. The only real problem is that it takes a little bit of time to build the HSA up enough to cover the deductible - if you have a catastrophic event during that interim, it will be financially difficult, so that's a risk. I also support the idea that consumers should be aware of the actual market costs of their health care, something that paying a high deductible promotes. This helps drive overall costs down. Just my experience, of course, but the HSA has worked out very well for me.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1600/0300/cropped-16000300.jpg?1573149451811882298", "createDate": "1480334239", "commentID": 20625486, "userID": 16000300, "recommendations": 18, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625486}, {"approveDate": "1480338079", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480349631", "permID": "20624980:20625718", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "pedigrees", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta", "parentID": 20624980, "userDisplayName": "Jenny", "commentTitle": "<br/>", "commentBody": "I totally agree with Pedigrees.  Just read this Forbes article from back in January:  \"63% Of Americans Don't Have Enough Savings To Cover A $500 Emergency\"  -<br/><br/><a href=\"http://www.forbes.com/sites/maggiemcgrath/2016/01/06/63-of-americans-dont-have-enough-savings-to-cover-a-500-emergency/#37891a7f6dde\" title=\"http://www.forbes.com/sites/maggiemcgrath/2016/01/06/63-of-americans-dont-have-enough-savings-to-cover-a-500-emergency/#37891a7f6dde\" target=\"_blank\">http://www.forbes.com/sites/maggiemcgrath/2016/01/06/63-of-americans-don...</a><br/><br/>I find it ironic that many of Trump's core base - older white working class people hit by the loss of manufacturing and coal jobs, etc. - are surely also consumers of Obamacare, Medicaid, unemployment insurance, etc.  Sadly they will find out very soon they're not going to get the relief they were promised.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480336244", "commentID": 20625718, "userID": 62639659, "recommendations": 129, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625718}, {"approveDate": "1480348110", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480348110", "permID": "20626496", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Orem", "parentID": null, "userDisplayName": "Mark", "commentTitle": "<br/>", "commentBody": "The ACA is delusional.  $6000 deductible, $3800 out of pocket expenses, $600/month premium.  I essentially have no health insurance and I am forced to pay a $7200/year premium.  I need shoulder surgery and I can't afford it.  I would have to pay $17,000 this year for the surgery and my rates are going up at least 25% next year.   Give my my old plan back.  Under $250/month premium with $2000 deductible.  This is a pure scam.  But, hey, I should be so happy.  I just found out that because of my American Indian status, I don't have to pay any deductible or out of pocket expenses so I can get my surgery next year.  But I will still do everything to get this law removed and hope Trump does it.  My brother-in-law, who is not American Indian, has to pay $3200/month premium for a family of 4.   $5,000 deductible for each family member plus outrageous out of pocket expenses ( I forgot the exact amount.)  Why should he have to pay to subsidize me because I am American Indian.  Pure Theft.  So happy that Trump won and that this law will be dismantled.  All you supporters are willfully ignorant of how this law effectively removes the insurance of millions of working class families (I am a self employed general contractor) by forcing us to pay thousands in premiums with deductibles and out of pocket expenses so high that we can't afford to use the insurance we are forced to pay for just to give it to somebody else for free.  Trump won, the law can't be gone soon enough.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480340194", "commentID": 20626496, "userID": 64515027, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626496}, {"approveDate": "1480348234", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480348234", "permID": "20625978", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Corinth, Kentucky", "parentID": null, "userDisplayName": "Nancy", "commentTitle": "<br/>", "commentBody": "I am trying to make a doctor's appointment for a simple skin procedure and checkover. The office can't tell me what it will cost me after insurance. \"There's just no way to know.\" Not an estimate, not a guess, not a ballpark figure. Clearly they are instructed to deflect all such questions. Free market, hooey.<br/>The alleged flaws in the ACA, without exception, arise from those inherent in a for-profit setup. Fairness, transparency, affordability, prevention and universal access are all alien concepts to a model based on volume, secrecy, adhesion (look it up) and charging the most for treating the sickest.<br/>\"Health\" \"Care\" \"System\" - it is none of the three. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480338000", "commentID": 20625978, "userID": 69581427, "recommendations": 108, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625978}, {"approveDate": "1480349354", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480349354", "permID": "20626800", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco, CA", "parentID": null, "userDisplayName": "Heather", "commentTitle": "<br/>", "commentBody": "If liberals and the media continue to cast Obamacare as a welfare program for the poor, they will hasten its demise. <br/><br/>Many middle-class people mistakenly believe that their family's health insurance premiums went up because Obamacare took money away from them to help the \"other.\" In fact, Obamacare guarantees EVERYONE access to private insurance policies, has reduced the cost of caring for the poor and uninsured in emergency rooms, and has stabilized Medicare. <br/><br/>We should talk about the most cost efficient way to make sure everyone has insurance, which is the only way to reduce the burden on the taxpayer and which would give Americans the same health security that every other citizen of an advanced country enjoys. If the Republicans don't like Obamacare (which was based on a proposal by a right wing think tank), their only other option is Medicare for All, i.e. Single Payer, and I would fully support that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480341512", "commentID": 20626800, "userID": 73490791, "recommendations": 123, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626800}, {"approveDate": "1480350279", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480350279", "permID": "20624980:20627956", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "pedigrees", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "heartsny", "parentID": 20624980, "userDisplayName": "MIMA", "commentTitle": "<br/>", "commentBody": "pedigrees<br/>Yes, just where are Americans supposed to get that money?<br/><br/>I personally asked Paul Ryan that in April, 2011, in a townhall meeting in Wisconsin when he showed all kinds of numerical data on charts in his push for healthcare vouchers.  (Those Republicans love vouchers...healthcare, educational.  They act like the vouchers are Macy coupons).<br/><br/>He had no answer.  As an RN whose career was based on getting insurance approvals for healthcare benefits, for real people, not not just made up statistics, I felt like I was begging for people I have advocated for.<br/> \"Where are they supposed to come up with this money?\" I begged.<br/><br/>Ryan doesn't know what it is to \"come up with money\" and neither does Trump.<br/><br/>They also don't have a clue what it is to come up with healthcare benefits.<br/>And they don't really care.  I don't give a rip about their numerical data.<br/>I care about the person who is at odds with disease - the one who is, on their own, \"supposed to come up with something\" ....  like money.<br/>MIMA", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480346115", "commentID": 20627956, "userID": 51905269, "recommendations": 163, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20627956}, {"approveDate": "1480351364", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480351364", "permID": "20625945", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new haven, ct", "parentID": null, "userDisplayName": "mikemcc", "commentTitle": "<br/>", "commentBody": "It's worth remembering that it was GOP that made the single-payer model impossible to realize. From that point on, the ACA was headed for trouble.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480337852", "commentID": 20625945, "userID": 62853897, "recommendations": 100, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20625945}, {"approveDate": "1480351805", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480351806", "permID": "20626000", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Gene", "commentTitle": "<br/>", "commentBody": "Forcing healthy young people to buy health insurance and rising costs with less competition make a mockery of \"Affordable Health Care.\" President Obama lied.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480338065", "commentID": 20626000, "userID": 52968281, "recommendations": 6, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626000}, {"approveDate": "1480351883", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480351883", "permID": "20625403:20626053", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Bart Goddard", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "North Carolina", "parentID": 20625403, "userDisplayName": "Sammi", "commentTitle": "<br/>", "commentBody": "This post is a lie.  Obamacare is the only thing that has made health insurance affordable for my family the past 2 years.  We are all set for next year, too, but I am terrified that insurance for low income (not poor) people will disappear come 2018.  How is it possible that Republicans have any credibility with any voters when they've promised \"replace\" again and again but have never actually designed a feasible alternative?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480338289", "commentID": 20626053, "userID": 17816509, "recommendations": 111, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626053}, {"approveDate": "1480351925", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480351925", "permID": "20626005", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arcata, CA", "parentID": null, "userDisplayName": "Humboldt County", "commentTitle": "<br/>", "commentBody": "According to the Economist, Commonwealth Fund, Kaiser and others, we spend $9,086 per person annually on health care while Switzerland, the second-highest-spending country, spent $6,325, and the rest go down from there. ACA is a start, but only socializing our insurance such as Medicare (which earns an 80% approval rating) will bring down our insanely high costs. Even job-covered benefits are crazy expensive. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480338106", "commentID": 20626005, "userID": 68187230, "recommendations": 103, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626005}, {"approveDate": "1480355181", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480355181", "permID": "20629314", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Baltimore", "parentID": null, "userDisplayName": "Mark", "commentTitle": "<br/>", "commentBody": "I'm am economist and I voted for Trump for reasons having nothing to do with tax cuts, business friendly policies, \"Making America Great\", standing up to the world's evil, white identity politics or many of the so called dog whistles issues that are commonly cited as reasons for his popularity. <br/><br/>So what motivated me? Simple I'm a life long proponent of prolife policies as they relate to abortion, euthanasia, consumer protection, work place rules, environmental protection, social security and public health. I suppose if you were to identify me I would be a \"new deal\" prolife Democrat with a populist agenda almost uniformly ignored by everyone other than Trump. <br/><br/>Will Trump make good on his promise to repeal and replace Obama care? Probably not, but not for reasons having to do with his preferences or his intentions. The typical American voter is about \"ME\", and once all the dust is settled, people will invariably engage in a self serving somewhat misinformed benefit-cost analysis to ascertain what is and is not to their advantage. Once again, public policy will be sifted on the basis of self interest salted with a good measure of demagoguery. <br/><br/>Both parties are aware of this and will seek to exploit the current and erstwhile emerging political divide to assure reelection. At least Trump raised the specter of something different and whether it carries day or not it should be thought as a move in the right direction. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480351992", "commentID": 20629314, "userID": 69410455, "recommendations": 7, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20629314}, {"approveDate": "1480355265", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480355265", "permID": "20628886", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "lytle texas", "parentID": null, "userDisplayName": "james lowe", "commentTitle": "<br/>", "commentBody": "Start with helping the people who are suffering most from the ACA:  buyers in the individual marketplace whose income is too high for the subsidies.  Their premiums and deductibles have gone up by 100% plus due to requirement that all individual buyers are in a common risk pool, exchange and non-exchange alike.  The entire amount usually has to be paid out of after-tax dollars.<br/><br/>Contrast the individual marketplace buyers with the majority of Americans, who get their insurance via group plans with the government or employers.  Their premiums are much lower, and  are paid out of pre-tax dollars.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480350127", "commentID": 20628886, "userID": 53809261, "recommendations": 27, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20628886}, {"approveDate": "1480355636", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480355636", "permID": "20626496:20628915", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Mark", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Burley, Idaho", "parentID": 20626496, "userDisplayName": "Kjensen", "commentTitle": "n/a", "commentBody": "Gosh I would like to know where you got that $200 a month plan with a $2,000 deductible that was so wonderful. I've been self-employed for 20 some odd years, and never had a premium less than $500 that didn't carry with it a $10,000 deductible. Add to that the fact that I couldn't keep my kids on it past their 18th birthday, and that it had caps with regard to the amount of services it would pay, which meant that I was headed for bankruptcy at anytime anyone in my family contracted a serious illness. The ACA is not perfect, but it was a vast improvement over anything I ever purchased in the private market prior to its passage.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480350223", "commentID": 20628915, "userID": 64885538, "recommendations": 89, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20628915}, {"approveDate": "1480356070", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480356070", "permID": "20626496:20629036", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Mark", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Pembroke Massachusetts USA", "parentID": 20626496, "userDisplayName": "Cheryl Withers", "commentTitle": "<br/>", "commentBody": "You are quoting six year old prices when you say I want my old plan back. Prior to the ACA prices increased 20 - 25 % per year Deductibles started under Bush so that people had skin in the game. A lot of people like you are going to be disappointed when the ACA is eliminated and prices rise even faster (the ACA caps overhead and profits now the insurers can charge whatever) We pay almost three times as much for healthcare as other nations and rank 37th Without price caps on for profit health care, greedy insurers and big pharm the prices will continue to rise. You have been sold a bill of goods blaming the ACA for costs but it isn't true.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480350852", "commentID": 20629036, "userID": 74986600, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20629036}, {"approveDate": "1480356187", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480356187", "permID": "20626496:20629936", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Mark", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": 20626496, "userDisplayName": "PRant", "commentTitle": "<br/>", "commentBody": "Reply to Mark: I'm a self employed contractor myself and the fees for people like us are ridiculous, or for that matter, anyone who is self employed. The insurance companies are insuring human beings, we are essentially all the same, why can someone working for a huge corporation pay so much less then someone who is self employed? The reality is that the self employed do not have the leverage to get the lower premiums, it's just that simple.<br/><br/>There is a strong argument that the self employed actually subsidize the big corporations by paying so much more. It's criminal, and no one cares. All our \"Representatives\" get big payoffs from healthcare insurers. <br/><br/>When the ACA was a first initiated my premiums went way down. Now, with the writing on the wall for absolutely NO representation for the working man, the insurance companies have all the leverage for going right back to the 20% increases ever year. Happy days are here again for those guys.<br/><br/>They would charge any amount, they don't care if they bankrupt every person in America just to pay their worthless premiums. (Deductibles at almost 10K) You voted for Trump thinking he's going to fix this? Trump is a Republican, Republicans run the healthcare industry and the AMA. The only check on premiums in the last eight years has been Obama. You drank the cool aid. You don't like it now? Wait a few years brother. Now, no one cares.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480354645", "commentID": 20629936, "userID": 59032267, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20629936}, {"approveDate": "1480356354", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480356354", "permID": "20626065", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tennessee", "parentID": null, "userDisplayName": "KJ", "commentTitle": "<br/>", "commentBody": "I'm from Canada, have worked in healthcare on both sides of the border, and wish we could adopt a similar system.  It's not perfect.  You hear griping about people having to wait substantial periods of time for elective treatments, but you don't get escorted to the front of the treatment line because they are wealthy.  <br/><br/>Healthcare should be based on human decency and need, not the desire of a few well-placed individuals and shareholders to become fabulously wealthy.  Donald Trump and people who think and act like him are a bane on the industry.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480338342", "commentID": 20626065, "userID": 63446969, "recommendations": 85, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20626065}, {"approveDate": "1480356480", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480356480", "permID": "20628576", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cary, NC", "parentID": null, "userDisplayName": "Kathy", "commentTitle": "<br/>", "commentBody": "Until Americans agree with the rest of the industrialized world that healthcare is a right, not a privilege, the situation will not improve. For-profit healthcare is an obscenity.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480348828", "commentID": 20628576, "userID": 46581136, "recommendations": 117, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20628576}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 683, "api_timestamp": "1488822378", "totalReplyCommentsFound": 295, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}