{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 729, "totalEditorsSelectionFound": 40, "depthLimit": 0, "totalRecommendationsFound": 707, "comments": [{"approveDate": "1465286012", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465282412", "permID": "18758174", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "baseball", "parentID": null, "userDisplayName": "lbentch", "commentTitle": "<br/>", "commentBody": "Trumps position is antithetical to our Constitution's separation of powers. The judge's ethnicity or Trump's claim thereof is of only minimal moment. This judge was confirmed by the Senate and serves in accordance with Article III.  While a political leader may be critical of a sitting judge's previous decisions, such a person may not criticize a judge because of and during a current case before the court and certainly not concerning a case before the court in which he or she is a party.  The ludicrous opinions proffered by some that this is the same as a President's potential nominations of a federal judge are outrageously and offensively off the mark:  this is not about a nomination, rather, this issue is about respecting the authority of the judiciary as an independent body.  Trump has gained the vote of the many who are outraged by their treatment by a non-caring and self-dealing body of elected officials from the local to the federal level.  So be it; but to ridicule and parade effrontery in this matter are the stuff of those confusing the rule of law with the rule of the mob.  There is a social contract in our country:  the majority wins, the majority agrees to consider the legitimate issues of the minority, and there is an expectation that differences over time will be balanced.   That many of Trump's supporters who fail to understand this basic issue also claim to be \"Constitutionalists\" is hypocrisy of the highest level.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465266301", "commentID": 18758174, "userID": 36783287, "recommendations": 601, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18758174}, {"approveDate": "1465286123", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465282523", "permID": "18758198", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Phoenix", "parentID": null, "userDisplayName": "David Warren", "commentTitle": "<br/>", "commentBody": "Mr. Trump apparently views the motivations of others through the same blurry goggles of racial prejudice that he wears.  Perhaps as a result he cannot even perceive it is possible for someone such as Judge Curiel to carry out his duties professionally, rather than protect his \"heritage\" (cue dogwhistle please) by handing down \"unfair\" rulings.  Of course, this may be a kinder take on this issue than deserved by Mr. Trump.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465266384", "commentID": 18758198, "userID": 64327658, "recommendations": 324, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18758198}, {"approveDate": "1465286203", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465282603", "permID": "18758262", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Greenwich", "parentID": null, "userDisplayName": "MJMA", "commentTitle": "<br/>", "commentBody": "As a longtime and very active Republican, I can't help but find this incredibly depressing.  Many in my party have clearly been doing mental gymnastics over the past month, trying to convince ourselves that perhaps Mr. Trump, \"isn't that bad,\" or that, \"we can live with him.\"  Speaker Ryan's deliberation in this regard is only the most public of many similar thought exercises among Republicans against much of what Mr. Trump stands for but even more against a third Clinton administration.<br/><br/>Instead of being grateful for this increased support and acknowledging the concerns of many in the party, Mr. Trump has instead decided to double-down on racist crazy talk.  These most recent antics -- compounded Sunday with the addition of religious prejudice -- make clear that Mr. Trump has no interest in yielding to prudence, even temperament, and other \"presidential\" qualities needed in a chief executive.  Instead, he continues to appeal to the base elements in our nature.  In this matter he in unworthy of Republican support at the ballot box.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465266610", "commentID": 18758262, "userID": 65018497, "recommendations": 1004, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18758262}, {"approveDate": "1465286472", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465282872", "permID": "18758397", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kaneohe, Hawaii", "parentID": null, "userDisplayName": "Dorothy", "commentTitle": "<br/>", "commentBody": "It is one thing for a president to nominate persons for the US Supreme Court based in part on whether they happen to hold particular political points of view or even taking into account ethnicity. That has been going on for many, many years.  Even so, there are, for better or worse, checks and balances on such appointments.  Right now, for example, the Republican party refuses to consider any nominees by President Obama.<br/><br/>It is quite another thing for a person to maintain that a judge should not hear a case involving that person on the basis of the judge's ethnicity.  Trump is making such an assertion in the case of Judge Gonzalo Curiel and the Trump \"University\" case.<br/><br/>If Trump had evidence of bias by Judge Curiel, Trump's lawyers could file a motion seeking recusal.  <br/><br/>Trump's ill-considered diatribes against Judge Curiel in such a relatively small matter evidence Trump's poor judgment and thin skin.  Surely there were weighty matters concerning policy choices he would make if he is president that Trump could have spent time discussing.  But the narcissistic Trump couldn't resist the temptation to strike back at anyone whom he perceives. rightly or wrongly, to pose a challenge to him.<br/><br/>Personally, I am delighted. Trump as president would be a disaster for this country and his foolish attacks on Judge Curie are only further decreasing his  chance of attaining the presidency.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465267103", "commentID": 18758397, "userID": 25809082, "recommendations": 478, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18758397}, {"approveDate": "1465295053", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465295498", "permID": "18759024", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Murphysboro, Illinois", "parentID": null, "userDisplayName": "Dochoch", "commentTitle": "<br/>", "commentBody": "Hey, maybe Mr. Trump is on to something. <br/><br/>Since I am descended from German Jews, perhaps I could use the same logic that Trump (nee Drumpf) is descended from German Christians and, therefore, is inherently biased against me. Irish descendants could claim historical bias by people whose ancestors came from England. President Obama could claim that, since his father was from Kenya, he too could clam bias by British-descended judges. And then, of course, we could have Muslims and Hindus excluded from judging each other. <br/><br/>I guess Trump and his supporters never learned the meaning of \"E Pluribus Unum.\" ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465269660", "commentID": 18759024, "userID": 63499211, "recommendations": 263, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18759024}, {"approveDate": "1465297809", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465295474", "permID": "18761778", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Anne-Marie Hislop", "commentTitle": "<br/>", "commentBody": "In this presidential campaign Trump has supporters who are suspicious of all institutions and systems. They are in general a crowd who is resentful of the highly educated and successful; they see themselves as victimized by everyone from the wealthy to \"illegal\" immigrants.  With his loyal base, his behavior is bound to be a win (as evidenced by calls they now make to the judge's office making threats). What Trump may not get because he cannot hear it over the cheering of his fans is that the world beyond his resentful, xenophobic base is becoming more and more uncomfortable with his candidacy. <br/><br/>It is almost comical that many of the GOP establishment are still clinging to the notion that he is about to change; they keep hoping that \"the real\" Trump will burst forth any second now; that he will calm down &amp; become \"presidential\" and reasonable. What they don't get is that adoration from his fans and shocked attention from those who do not appreciate his greatness are his drug. He is on a high and not coming down before November. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5990/0427/cropped-59900427.jpg", "createDate": "1465297799", "commentID": 18761778, "userID": 59900427, "recommendations": 419, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761778}, {"approveDate": "1465301180", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465297580", "permID": "18760092", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "Much of the analysis in the editorial and in the reader responses appears to take seriously Trump's claim that the judge's ethnicity troubled him.  This assumption would be the equivalent of believing that Trump demanded to see President Obama's birth certificate because he genuinely doubted the Hawaiian origins of our chief executive.<br/><br/>In both cases Trump merely sought to gain an advantage by knocking his opponents off balance.  The man's narrow focus on his own interests precludes any real loyalty to the nation's institutions or to his own political allies.  His consistent behavior throughout this campaign strongly indicates that, in his mind, people play one of two roles, sycophant or deadly enemy.  In like manner, if laws and institutions do not advance his agenda, he dismisses them with the same contempt he has displayed toward Judge Curiel.<br/><br/>It would save time and effort if pundits would cease to treat Trump's statements and proposals as intellectually serious.  His distorted worldview begins and ends with his own egocentric value system, and serious efforts at logical analysis must fail in the presence of a mentality straight out of Alice in Wonderland.  Like the Chesire cat's disappearing smile, Trump lacks substance.  His appetites and his interests define him; in every other respect, there is no there there.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465276345", "commentID": 18760092, "userID": 63418614, "recommendations": 523, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760092}, {"approveDate": "1465301224", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465297624", "permID": "18760104", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland", "parentID": null, "userDisplayName": "SIG", "commentTitle": "<br/>", "commentBody": "Donald Trump has provided us with another window into his jaded and petty soul. He has been granted the enormous privilege of being one of two candidates to be considered for election to our highest office. Does he use this valuable opportunity to advance his vision and policy ideas to make his best arguments for our serious consideration of him for the presidency? No - instead he uses this moment to rail against his perceived injustice concerning a private lawsuit where he is the named defendant. With all things Trump, it's never country first, because it's 'all about me' first. On this score alone he has demonstrated how unfit he is for our highest office. The larger concern is why the Republican leadership is so willing to sacrifice their honor for winning. This is the much greater threat to our American democracy and the rule of law.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465276413", "commentID": 18760104, "userID": 37306593, "recommendations": 332, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760104}, {"approveDate": "1465301263", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465405894", "permID": "18760122", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 14, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London, UK", "parentID": null, "userDisplayName": "Roger Hicks", "commentTitle": "<br/>", "commentBody": "No one would deny that white judges have tended to be unfavourably biased against ethnic minorities, especially Native Americans, whom they helped rob of their lands, and blacks, who, when they came before them, they often treated more harshly than fellow whites, so why is it unreasonable to assume that non-white judges will be similarly biased in favour of their own and against the perceived other?<br/><br/>In this regard, at least, if not in many others, Donald Trump is being realistic: human beings - including judges - are naturally prejudiced.<br/><br/>It is a political tactic to deny one's own prejudices, while demonising those of others, who can then be dismissed as bigots or racists.<br/><br/>It is a tactic that those of good will - which I assume members of the Editorial Board are - need to recognise and stop employing. We need to understand human prejudices and learn how to live with them in as civilised a fashion as possible, rather than demonising and suppressing them.<br/><br/>Identifying with and favouring members of one's own ethnic group is rooted in human nature. Everyone does did, except when it is demonised and suppress by an ideology, such the one the West's academic and political elites embrace towards their own, white, race in overreaction to the evil of Nazism and the Holocaust (also to European imperialism, Jim Crow and Apartheid, which I elaborate on here: <a href=\"http://unapprovedcomments.blogspot.co.uk/2015/11/the-wests-overreaction-to-nazism.html\" title=\"http://unapprovedcomments.blogspot.co.uk/2015/11/the-wests-overreaction-to-nazism.html\" target=\"_blank\">http://unapprovedcomments.blogspot.co.uk/2015/11/the-wests-overreaction-...</a> ).", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4983/8162/cropped-49838162.jpg?0.1535466976929456", "createDate": "1465276611", "commentID": 18760122, "userID": 49838162, "recommendations": 15, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760122}, {"approveDate": "1465301329", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465297729", "permID": "18760129", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "bkw", "commentTitle": "<br/>", "commentBody": "My view of Donald Trump's reaction to the judicial system will be hard for most to swallow.  But being in the mental health field, I've learned to never take any behavior at face value; that most of the time things are not what they seem; and people carry intense psychological baggage they are consciously unaware of yet they react to and create defenses against as if they were.<br/><br/>Observing Donald Trump there's a major issue that blinds him to everything else.  And that's perceiving that he's being treated unfairly or unjustly.  And going a step deeper, if he's treated unfairly or unjustly that could mean personal defeat.  Not winning. And to Donald Trump winning is everything, it's his life line. He even wrote books about it. <br/><br/>And the way he deals with his apparent fairness/winning obsession is to lash out at anyone he perceives is treating him unjustly.  He assassinates that person's character using something he knows will hurt and bit and take them down a notch or two.  And he's an equal opportunity hammer ignoring the status of whomever he's hammering be it judge, the media, probably even God.<br/><br/>His lashing out is all consuming providing no space for a reflective thought that what he's saying and doing reflects bias and bigotry.  He believes what he's doing is completely rational. After all he's only protecting himself.  <br/><br/>Overall, Donald Trump is burdened by a truckload of psychological baggage that's of a sort that would make a Trump presidency devastating.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6674/6113/cropped-66746113.jpg", "createDate": "1465276657", "commentID": 18760129, "userID": 66746113, "recommendations": 375, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760129}, {"approveDate": "1465301365", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465297783", "permID": "18760241", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Northwest", "parentID": null, "userDisplayName": "Iconoclast", "commentTitle": "<br/>", "commentBody": "Trump has often expressed his admiration for the late justice, Anthony Scalia, an Italian-American Catholic.  But according to Trump's thinking, Scalia should have recused himself on abortion cases because he was Catholic and prejudiced by church dogma.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465277780", "commentID": 18760241, "userID": 23485937, "recommendations": 242, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760241}, {"approveDate": "1465301473", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465297873", "permID": "18760397", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CA", "parentID": null, "userDisplayName": "Kate", "commentTitle": "<br/>", "commentBody": "Its bad enough to claim a judge is biased because of his heritage but what Trump is doing with his bully pulpit is trying to discredit a Judge presiding over a case against him - This is key . By discrediting the judge- by any means- he is trying to discredit the case against him. That he chose to point to the judges hispanic name was Trump's go-to branding that unintentionally backfired for Trump into outrage over racially profiling the judge and the judicial system.<br/>In reaction to the public firestorm he instructed all his spokespeople to continue to attack the Judge. He now has an army of spokespeople who's original intention is to speak about his policies going out and doing his dirty work against a suit brought against Trump before he ever declared his run for the presidency and pertains to his private business adventures.<br/>It leaves one to wonder, as President , what lengths he will take to discredit anyone and anything who he deems is \"bias\" and not \"kind to him\". He will have large staffs, institutions, press conferences and the military at his disposal.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465279658", "commentID": 18760397, "userID": 65142750, "recommendations": 178, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760397}, {"approveDate": "1465301705", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465298105", "permID": "18760569", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Michael", "commentTitle": "<br/>", "commentBody": "Despite his latest ridiculous tirade Donald Trump is not a racist, any more than he was a Democrat and abortion opponent a decade ago, anymore then he is a non-interventionist who wants to blow Islamic State off the face of the earth or a conservative or a social progressive or anything at all other than a mouth that duly speaks every thought that passes in and out of his head without any attempt to reconcile it with the preceding or the succeeding one.  Donald Trump is simply a comedian and the joke is on us to take anything he says seriously. He Fully deserves to be elected President of the Daily Show. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465281840", "commentID": 18760569, "userID": 9649397, "recommendations": 51, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760569}, {"approveDate": "1465301774", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465298174", "permID": "18760659", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington", "parentID": null, "userDisplayName": "willis", "commentTitle": "<br/>", "commentBody": "Yes, Mr. Trump's comments are racist and clearly far out of bounds from any comment any candidate should say much less think. This may be the best indication yet that Mr. Trump truly believes he is above the law and all things held dear by Americans. A horrid petty tyrant who would carry such to the highest office in the land.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465283255", "commentID": 18760659, "userID": 49164991, "recommendations": 144, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760659}, {"approveDate": "1465302004", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465298404", "permID": "18760774", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Suzanne", "commentTitle": "<br/>", "commentBody": "Is it possible that Trump is blowing smoke our way, bullying and bluffing, using inflammatory race-based charges as a tactic to divert our attention away from even more illuminating details about the fraud behind his failed university? Because the discussion around judges and race, as important as it is, has sidelined tragic stories of Trump U students taken for money they really didn't have. Might there be even more damaging info to come out about this case, now held back because of accusations of bias. And therein lies the deepest pathology - exactly how are we all being played by a not-entirely sane but extremely shrewd bully negotiator?<br/><br/>On one level, he's clearly a racist (yet his staff vehemently swears on national tv that he is not...) On another level how much is he baiting us, knowing we all must rally to protest his racism at the expense of understanding other equally repugnant, possibly illegal, behavior?<br/><br/>Never was the need for freedom of the press more apparent or more urgent.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465286173", "commentID": 18760774, "userID": 21044881, "recommendations": 160, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760774}, {"approveDate": "1465303486", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465299886", "permID": "18760946", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Manhattan", "parentID": null, "userDisplayName": "Billy Maass", "commentTitle": "<br/>", "commentBody": "The Times Editorial says \"At the rate he is going, there would soon be no person in the land left to judge him.\"  And that's exactly how Trump wants it.  In Trump's ego-driven, maniacal world he is a law unto himself.  Anyone questioning that law faces a barrage of snarky tweets, bullying, or accusations a loved one was in on the Kennedy assassination.  If Mr. Donald J. Trump is behaving this way now, can anyone imagine how this eight-million pound gorilla will behave if sworn in as our next president?  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465289290", "commentID": 18760946, "userID": 63415653, "recommendations": 135, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760946}, {"approveDate": "1465303556", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465299956", "permID": "18760980", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Australia / Boston", "parentID": null, "userDisplayName": "peterheron", "commentTitle": "<br/>", "commentBody": "It is becoming increasingly clear that Donald Trump has profound and dysfunctional psychological problems, which I suspect will play out increasingly over the next four months.  Imagine what happens on a debate stage when Hilary Clinton confronts him relentlessly, after months of preliminary advertising etc, and a moderator or two forces him to follow up on basic questions.  Thump will be under enormous pressure, and there is nothing in his past or his personality to suggest he would handle such a debate well.  In front of a live audience of 40+ million, pushed by a strong (!) woman using facts and his own quotes, Trump will implode, live, right before our eyes.  And that will be the end of Trump, and he will take will him Paul Ryan and Chris Christie and the rest of the miserable Republicans who supported him.  And the GOP will be gone in the blind of an American eye.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465289755", "commentID": 18760980, "userID": 42317076, "recommendations": 155, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18760980}, {"approveDate": "1465303738", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465300138", "permID": "18761182", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Dadof2", "commentTitle": "<br/>", "commentBody": "\"These pronouncements illustrate that Mr. Trump holds the rule of law in contempt.\"<br/>\"At the rate he’s going, there would soon be no person in the land left to judge him.\" <br/><br/>But that's exactly Donald Trump's point: There is NOBODY fit to judge Donald Trump about ANYTHING but Donald Trump himself.  He is never wrong. He is above the Law, unlike the rest of us, and ANY judgement against him, no matter how obvious is \"UNFAIR!\".<br/><br/>What Trump fails to realize that everyone but his most ardent supporters know, is that what he did with Trump U was fraudulent, both civilly and criminally.  He and his team planned for, conspired, and deliberately swindled hundreds, even thousands of people who couldn't afford or barely afford to pay the tuition and gave them NOTHING in return!<br/><br/>Only such cowards as Paul Ryan and Mitch McConnell have refused to castigate Trump for his unsupportable attacks on Judge Curiel's probity based on the Judge's background shared by over 15% of Americans.  Even such arch-Conservatives as Newt Gingrich and Lindsey Graham have strongly condemned Trump, as well as many others, as well they should. <br/><br/>I hope this is the crack in the armor that finally shows  America just how dangerous this man is, and ends the magic he has had with voters and the press since last fall.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465292676", "commentID": 18761182, "userID": 21069407, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761182}, {"approveDate": "1465303766", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465300166", "permID": "18761201", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Aude, France", "parentID": null, "userDisplayName": "rufty", "commentTitle": "<br/>", "commentBody": "If you can have a judge refused because of his ethnicity why not have have him removed if he's bald and the defendent is hairy, if he's short and the defendent is tall, if the judge is a woman and the defendent a man.  Of course that is ridiculous because you would have to prove that baldness, height and gender had  biased his judgement just as you should have to show that ethnicity had previously biased the judgement of Judge Curiel.  Trump has not done that nor has he attempted to do so.  His narcissism is fed by contempt and contempt feeds his narcissism.  The man is a walking, talking personality disorder.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6532/4021/cropped-65324021.jpg?0.9240602263359967", "createDate": "1465292866", "commentID": 18761201, "userID": 65324021, "recommendations": 111, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761201}, {"approveDate": "1465303926", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465300326", "permID": "18761299", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maine", "parentID": null, "userDisplayName": "Mcacho38", "commentTitle": "<br/>", "commentBody": "Has it occurred to members of the GOP elite that perhaps Mr. Trump doesn't really want the job thus he is getting more outrageous.  I believe that he started this whole thing to sell his products then the media made him a serious candidate.  I think he knows he is in deep trouble and that if he can get the GOP \"elders\" to back away from him and he loses he will have accomplished his goal.  Hillary Clinton is so much closer to conservative and what the party is actually looking for.  As a Dem who loves Bernie I will vote for her and for the Supreme Court we need.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465293815", "commentID": 18761299, "userID": 52030884, "recommendations": 113, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761299}, {"approveDate": "1465304311", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465300711", "permID": "18761422", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Puerto Rico", "parentID": null, "userDisplayName": "JRGuzman", "commentTitle": "<br/>", "commentBody": "Those who embrace Mr. Trump now will pay a heavy price later. The GOP is quickly becoming a ship of fools, with Trump at the helm, oblivious to the Constitution and oblivious to the damage his mendacious and bigoted rhetoric inflicts on our body politic. Every passing day it is becoming crystal clear Mr. Trump is unfit for higher office. The question is...what will Republicans do about their unwise choice?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3088/4992/cropped-30884992.jpg?0.10686815646915815", "createDate": "1465295212", "commentID": 18761422, "userID": 30884992, "recommendations": 171, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761422}, {"approveDate": "1465304329", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465300729", "permID": "18761423", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "michigan", "parentID": null, "userDisplayName": "mjweir", "commentTitle": "<br/>", "commentBody": "Why do those in the GOP keep saying Trump doesn't mean what he says? Do they have any idea how absurd that is? First off why would we want a Chief Executive who \"doesn't mean what he says\"? What sort of message does that send to the world? To the country?<br/><br/>And secondly, huh? Why say it if he doesn't mean it? That's the age old apologist coming out to defend a bigot and racist in the family. <br/><br/>This election cycle gets more bizarre by the minute. <br/><br/>The sooner we can dump Trump the better for all of us. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465295235", "commentID": 18761423, "userID": 29419789, "recommendations": 204, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761423}, {"approveDate": "1465305183", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465301583", "permID": "18761429", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Blue Hill, Maine", "parentID": null, "userDisplayName": "fjbaggins", "commentTitle": "<br/>", "commentBody": "Trump’s attacks on Judge Curiel’s ethnicity, within the context of his run for the presidency, are noteworthy for more than one reason: First, they are a reprehensible insinuation by a white man that one’s national origin is somehow an indicator of his or her level of ethics and objectivity. Yet perhaps more chillingly, his comments on a case that has no larger political ramifications for the nation and where only his personal interests are at stake demonstrate his willingness to use the levers of politics and power as a cudgel to beat his personal opponents and advance his own interests. Is there any doubt that, if elected, Trump would misuse the power of the presidency to advance personal aims and enrich himself at the expense of the nation? A Trump Administration would blend the personal with the political in a way we have not seen since Richard Nixon’s.   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6103/9365/cropped-61039365.jpg", "createDate": "1465295326", "commentID": 18761429, "userID": 61039365, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761429}, {"approveDate": "1465305609", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1465302009", "permID": "18758557:18761614", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Bruce Rozenblit", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnati", "parentID": 18758557, "userDisplayName": "CPW1", "commentTitle": "<br/>", "commentBody": "I agree.  You can't fix personality disorders and or stupidity.  And stupid and arrogant are a dangerous combination.  Too arrogant to know your stupid and to stupid to know your arrogant.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465296763", "commentID": 18761614, "userID": 30664211, "recommendations": 99, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761614}, {"approveDate": "1465306642", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1465405951", "permID": "18759288:18761742", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "A. Stanton", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": 18759288, "userDisplayName": "CC", "commentTitle": "<br/>", "commentBody": "Being asked to be polite toward others and not ridicule them on the basis of race, religion, sex, sexual orientation, gender identity or disability is crippling America and forcing masses of people not to participate in politics? <br/><br/>Seriously?<br/><br/>We've got a lot of problems in this country, but people NOT behaving like boorish, crude, cruel Donald Trump sure isn't one of them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465297590", "commentID": 18761742, "userID": 40657165, "recommendations": 81, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18761742}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1062, "api_timestamp": "1488822348", "totalReplyCommentsFound": 333, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}