{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 25, "totalParentCommentsFound": 805, "totalEditorsSelectionFound": 26, "depthLimit": 0, "totalRecommendationsFound": 847, "comments": [{"approveDate": "1481415967", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481444338", "permID": "20765915", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Anne-Marie Hislop", "commentTitle": "<br/>", "commentBody": "\"they could treat the news media not as some sort of arbiter of the facts but simply one side of a he-said-she-said debate.\"<br/><br/>The media itself bears some of the blame for ending up in this place. In a misguided effort to be fair and balanced, every story about a politician had to have \"the other side\" represented.  In the most recent election, every time there was a negative story about Trump, some media types felt they had to at least explain to us again that Hillary was far from flawless or (often) bring up her email server. Negative had to be matched with negative; negative Trump Foundation story needed corresponding Clinton Foundation story (never mind that the former was a veritable slush fund and the latter a highly rated charity)... In that model, false equivalents are readily made - Trump is heard talking about freely availing himself of women's crotches, so we must mention that when Hillary was a cheated-on wife publically humiliated on the world stage she stood by her husband (the hussy)... <br/><br/>It is clear that I am a fan of this paper and other media sources that are, IMHO, good sources - still, y'all can and should do much better. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5990/0427/cropped-59900427.jpg", "createDate": "1481415940", "commentID": 20765915, "userID": 59900427, "recommendations": 1902, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20765915}, {"approveDate": "1481419208", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481444790", "permID": "20766267", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Rita", "commentTitle": "<br/>", "commentBody": "The news media, including The NY Times, needs to do much more to combat the decline from truth to truthiness to falsity. <br/><br/>Trump is a salesman.  Naive marks may trust salesmen to tell the truth.  News media shouldn't. <br/><br/>Trump communicates catchy false narratives by twitter.  Rather than merely reporting the Twitter, The NY Times needs to point out the contradictory facts, the historical precedent, context, and implications of what Trump is saying and avoid false equivalences in the search for balance.<br/><br/>Example:  Trump's twitter about not believing the Intelligence agencies  on Russian hacking because the CIA was wrong on Iraq.  This is so factually incorrect that it suggests that Trump is catastrophically ignorant or just lying.  If he is lying, why is he lying?  <br/><br/>Perhaps Trump is justified in disrespecting the analysis and conclusions of the intelligence agencies.  But citing WMD in Iraq as justification for this disrespect is just plain historically wrong.  And The NY Times needs to make this clear.<br/><br/>While Trump supporters understandably want to trust Trump and are willing to suspend their critical facilities in order to do so,  the rest of the world requires rational, fact-based actions from this country.<br/><br/>The news media needs to stop trying to find rationales for Trump's twitters and actions and start pressing Trump to explain and justify his actions.  This is a democracy not a monarchy.  We can and should point out when the king is wearing no clothes.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4734/9721/cropped-47349721.jpg?0.17552296142093837", "createDate": "1481419152", "commentID": 20766267, "userID": 47349721, "recommendations": 1399, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766267}, {"approveDate": "1481427127", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481445016", "permID": "20767024", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Christine MCM", "commentTitle": "<br/>", "commentBody": "Because I'm used to consulting a wide variety of sources to get my information, I have had a hard time wrapping my arms around people taking any crazy story line and believing it based on who is saying it.<br/><br/>I mean, when you hear about a Clinton-Podesta sex ring involving kids in the back rooms of a pizza parlor--a pizza parlor!!!--shouldn't some alarm bell go off?  Surely people have some sort of internal radar to separate whacko from possible.<br/><br/>Or maybe not.  Clearly not, as the son of the soon-to-be NSA General Flynn.  Just writing that line makes my flesh crawl--that somebody as \"demented\" (no better word, thank you General Macaffrey) as Flynn could be a security advisor to the President of the United States shows how far this country has sunk.<br/><br/>And no, I'm not just a liberal elitist saying this.  Researching the origins of claims--strange or otherwise--is not rocket science.  A few hits on google will generally determine it's real.<br/><br/>That's assuming you care.  For the life of me, I  don't understand how many people don't care, aren't concerned enough to check out a source of something that sounds weird.  Sure, we have information silos, bubbles, whatever.  But just because some oddball story appears on Facebook or Twitter doesn't mean you have to run with it.<br/><br/>Extrapolate to one's personal life.  If a guy offers to sell you a new Lexus for $100, do you get out your checkbook?<br/><br/>Maybe, just maybe, if more folks treated truth like their wallets, we'd all be better off.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2073/520/cropped-2073520.jpg?0.18587254704312467", "createDate": "1481427093", "commentID": 20767024, "userID": 2073520, "recommendations": 946, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767024}, {"approveDate": "1481437109", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481445373", "permID": "20765573", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Deus02", "commentTitle": "<br/>", "commentBody": "Ultimately, all of this information debacle traces its roots back to the elimination of the \"fairness doctrine\", especially in news followed up with the ability for the ufettered consolidation of the media(thanks to Bill Clinton)whereby now 90% of what every Amercan reads, sees or hears is controlled by essentialy SIX giant corporations.  Also, back in Walter Cronkite's day,  the news departments were not particularly big money makers in which, eventually the \"bean counters\" insisted and upper management of the major networks agreed to move the news department under the control of the entertainment division so now news is categorized as essentially \"infotainment\" and is viewed as such by the viewer, nothing more.<br/><br/>Truths and lies? The attitude in media nowadays seems to have reverted to the  concept of \"who cares anymore, as long as people are watching\".", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481410607", "commentID": 20765573, "userID": 62856899, "recommendations": 253, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20765573}, {"approveDate": "1481437109", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481445582", "permID": "20765713", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Caucasus Mountains", "parentID": null, "userDisplayName": "Prometheus", "commentTitle": "<br/>", "commentBody": "&gt;&gt;&gt;<br/><br/>All is lost.  This is not a reversible phenomenon.  Some people are not going to start learning or believing facts.  These white working class voters are not coming back.  They'll never be able to admit that they were duped by Trump, more so since the liberals repeatedly warned them.  The Dems will have to find new voters and a lot of these Trump voters will have to pass away. <br/><br/>Look Trump-nonsense is just getting itself warmed up.  He is not even POTUS yet, just wait until that happens.    This is madness.     <br/><br/>Nobody living today should ever have to ask themselves how the German people followed their maniac into hell. Note: the Germans were a far more cultivated and educated society than we'll ever hope to be.<br/><br/>\"According to the theory of cognitive dissonance, “human beings do not deal with conflicting beliefs and perceptions by testing them against facts. They reduce the conflict by reinterpreting facts that challenge the beliefs to which they are most attached. As T. S. Eliot wrote in Burnt Norton, humankind cannot bear very much reality.\".....   <br/><br/>\"To think of humans as freedom-loving, you must be ready to view nearly all of history as a mistake.\" <br/><br/>John N. Gray", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2358/0303/cropped-23580303.jpg?0.8547461810521781", "createDate": "1481412886", "commentID": 20765713, "userID": 23580303, "recommendations": 613, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20765713}, {"approveDate": "1481437746", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481445703", "permID": "20767735", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new york", "parentID": null, "userDisplayName": "paula", "commentTitle": "<br/>", "commentBody": "The Times could provide a public service by running a regular column -- something like the weekly gun casualty list -- of lies spoken by Trump or members of his administration. Every week there should be a list with brief statements and links. Isolated stories begin to blur into one another and are too many to read and share. James Fallow's Time Capsule was helpful; we need some other way of numbering the assaults on the truth. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481437700", "commentID": 20767735, "userID": 22739177, "recommendations": 860, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767735}, {"approveDate": "1481451549", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481451549", "permID": "20766210", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "bedford, ny", "parentID": null, "userDisplayName": "jg", "commentTitle": "<br/>", "commentBody": "You write:<br/><br/>\"He has exploited, perhaps better than any presidential candidate before him, the human impulse to be swayed more by story than by fact.\"<br/><br/>I think this gives him too much credit for somehow creating and executing a shrewd campaign strategy and understanding the mood of the electorate, which deprived him not only of a majority but even of more votes than his opponent. The more plausible description of this man is that he is one of those people who is swayed by impulse, has no particular knowledge of a world beyond his own reality, no intellectual curiosity that might seek such knowledge and facts, and, most problematically, no self-awareness of these failings. He isn't a shrewd strategist. He is famous, but mostly only for having no shame. A minority of Americans took the bait, and a broken (if not hacked) election system handed him a victory.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481418759", "commentID": 20766210, "userID": 5064753, "recommendations": 352, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766210}, {"approveDate": "1481454774", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481454774", "permID": "20766400", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Old Borough Park, NY", "parentID": null, "userDisplayName": "Counter Measures", "commentTitle": "<br/>", "commentBody": "While this editorial is spot on in many ways, it fails to face our real dilemma going forward! Over sixty million Americans voted for Donald Trump to be President of the United States! That sure is a reality, and not fake news! The larger question is why?! And some of them were supposedly well educated! How does the truth reach them, or even more importantly do they care?! Have we become a nation, where dummies rule?! And finally, as that quote I once saw in a Hall at Brooklyn College named for William James! \"What should an education give us?\" The ability to know a good man (or woman) when we see them!\" And on January 2017, Donald Trump will be sworn in, as the next President of The United States! And that is not fake news.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481420305", "commentID": 20766400, "userID": 42572458, "recommendations": 184, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766400}, {"approveDate": "1481455013", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481455013", "permID": "20766422", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "There was a time when propaganda - the dissemination of misinformation - was directed at the enemies.  Now, or as this editorial has pointed out starting with the G.W. Bush administration, propaganda is directed at ordinary Americans. Ordinary Americans are now the enemies of the state or of the administration in power.  They are to be manipulated, influenced, shaped, misinformed and used by demagogues seeking political power and to stay in power.  The US has become like China and Russia except that China and Russia never pretend that they are democracies. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481420492", "commentID": 20766422, "userID": 69841700, "recommendations": 379, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766422}, {"approveDate": "1481455145", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481455145", "permID": "20766428", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "I think it's more than a denial of facts that has occurred.  It relates to a breakdown of logic, of language itself as no longer a means of communication but instead a bludgeon or a means of confusion.  <br/><br/>Trump accuses others of what he himself does.  This results in a dinishment of his owning his own actions.  Instead he disowns them, placing them outside himself.  Yes, this is a psychological defense mechanism, but used as part of his inveterate lying, it becomes a kind of erasure of public truth and a false equivalence results.<br/><br/>I used to think of it as the war on logic, then as the war on language.  Now I think we're arriving at a point of such breakdown of civic trust as to place our Republic in grave danger.  <br/><br/>I am a retired therapist.  I think of how sometimes people are driven insane when they grow up in families where reality is distorted, denied, replaced with fabrications, which the child knows to be false, but doesn't dare to confront, or where doing so is fraught with punishment or ridicule.<br/><br/>We must dare and dare and dare:  To speak the truth.  No matter the consequences.  Or lose our social fabric.  Or our sanity.  It's that stark!<br/><br/>I commend the Times:   For this Editorial.  For your clear-eyed focus on facts.  <br/><br/>Our Constitution enshrines Freedom of the Press.  But the Founders never thought to enshrine a fact-free Press!  <br/><br/>Keep up your sterling work, Times!  You are needed as never before!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1481420531", "commentID": 20766428, "userID": 32195826, "recommendations": 528, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766428}, {"approveDate": "1481456937", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481456937", "permID": "20766459", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "East Setauket, NY", "parentID": null, "userDisplayName": "Paul Wortman", "commentTitle": "<br/>", "commentBody": "The very notion of balance and equal time has contributed to the \"fake news\" and blatant lying that debased the recent presidential election. Fact-checking had to be instantaneous rather than a separate mostly unread article after-the'fact. One lesson that should have been learned from the rise of tyranny in the 1930's is that the Big Lie becomes an accepted truth if it's repeated over and over again and goes unchallenged. Donald Trump used this to great effect with his \"crooked Hillary\" label. The media never bleeped it out and fell into the trap with the endless articles about Sec. Clinton's emails. And then when FBI Director, James Comey, improperly intruded in the campaign with another false email alarm it was the perfect storm to sink the Clinton campaign given Trump's claims and the media's false fixation on this rather than the important issues exacerbated by Trump's continual outrageous claims and misdirection from matters of substance.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481420811", "commentID": 20766459, "userID": 57715665, "recommendations": 272, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766459}, {"approveDate": "1481457250", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481457250", "permID": "20766495", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Napa, CA", "parentID": null, "userDisplayName": "Brian DeWitt", "commentTitle": "<br/>", "commentBody": "It is good to see the Times addressing this serious problem that threatens all journalism.  The danger of fake news is not just people believing ridiculous stories and be misinformed, a bad thing in itself, of course.  It is more the loss of confidence that knowable truth exists, the \"breakdown of a shared public reality\" leading to cynicism and nihilism about our institutions- something familiar to people who lived under authoritarian regimes.  Journalism is integral to democracy in that it holds power accountable and informs us about matters of public interest.  But can journalism function when a large part of the public has given up on truth because they're conditioned to distrust all information or distrust knowledge itself?  Without the belief that there are facts, there cannot be debate, discussion.  It's been said that facts are stubborn things, but in the election fact checking Trump was completely ineffective because his lies were so brazen and there were so many that the press could not keep up.  Journalists will need to think hard about this in the years to come and adapt.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6495/5651/cropped-64955651.jpg?0.01729994616471231", "createDate": "1481421127", "commentID": 20766495, "userID": 64955651, "recommendations": 172, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766495}, {"approveDate": "1481457463", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481457463", "permID": "20766498", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Joe", "commentTitle": "<br/>", "commentBody": "Bush used a coordinated pack of lies to start a war and the news media swallowed those lies hook, line and sinker and enthusiastically regurgitated them, cheerleading the endless war on terror. Fear sold a lot of newspapers and generated a lot of ad revenue. No one has ever been held accountable for those lies because they were profitable for everyone willing to sell.<br/>When the people who crashed the economy had their bad debts paid off by Joe Six-pack and were given even more power and endless free Central Bank money, the media sang in unison the big, fat lie that saving Wall Street was really saving Main Street. Talk about fake news. Then, you mercilessly ignored or dumped on Sanders and his anti-Iraq war and genuine populist message, allowing a billionaire to fraudulently tap into the anger of voters sick of all the lies.<br/>Now, we have a President-elect who is actually hostile to the truth. The infuriating fact is that he has always been that way, but, instead of being ignored as an unfit, lying buffoon, the MSM served up his relentless lies as entertainment because it was good for business. We were fed a year and a half of The Trump Show, and the country and the earth and millions of people across the globe are going to suffer as a result.<br/>We don't just need media organizations that report fact without regard for partisanship, we need all of the major news media organizations to learn from this disaster and to act responsibly, not greedily, during the race for President.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481421180", "commentID": 20766498, "userID": 46532546, "recommendations": 382, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766498}, {"approveDate": "1481459265", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481459265", "permID": "20766551", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Colorado", "parentID": null, "userDisplayName": "Laird Middleton", "commentTitle": "<br/>", "commentBody": "It's a bad situation. I would love to see the NYT and other major news outlets get together for an ongoing discussion about how to set standards to report on fake news, how to get away from all the false equivalence that goes on and how to somehow educate people that, yes, the truth really does matter.<br/><br/>Maybe a good starting place would be to start  by looking at the amount of reporting on the Hillary Clinton email non-scandal. Interesting that the day after the election, no one cares any more. Haven't seen a written word about it. If it was such a hugely important story for 18 months, why is it a total non-story now?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481421828", "commentID": 20766551, "userID": 30861295, "recommendations": 407, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766551}, {"approveDate": "1481459600", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481486276", "permID": "20766559", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 12, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Houston", "parentID": null, "userDisplayName": "Robert", "commentTitle": "<br/>", "commentBody": "The pivot of the media to focus on the 'epidemic' of fake news as an explanation to Trump's success is laughable. Clinton lost because she's one of the worst possible candidates to be presented for this election cycle. <br/><br/>The reputable media sources are just as much to blame for driving people towards questionable news sources as is social media. Let us not forget the NYT's prediction of an 84% chance to win for Clinton. The endorsement of Clinton at the start of the primaries. The snotty approach to Sanders supporters and degrading them as naive Berniebros. The regular labeling of Trump supporters as any of the great societal taboos - sexist, racist, etc. The focus on Trump's character and blowing up of nonissues throughout the campaign.<br/><br/>I have yet to meet  Trump supporter who doesn't acknowledge the fact that Trump is very flawed. The one shared thought between them is that this election cycle brought forth a media that focused almost entirely upon Trump's character and actions as a non-political individual.<br/><br/>This election was all about the economy, jobs, wages, and a growing feeling that we are headed towards stagnation that can only be broken with change. The media had an obligation to talk about that but instead focused on Trump's \"racism\" and his \"sexist\" views. <br/><br/>If you want to bring people back to reputable news sources, start running stories based on what matters to the everyman and independents instead of appealing to liberal partisans and identity politics.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481421919", "commentID": 20766559, "userID": 73002827, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766559}, {"approveDate": "1481462746", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481462746", "permID": "20766825", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco, CA", "parentID": null, "userDisplayName": "David Parsons", "commentTitle": "<br/>", "commentBody": "One notion the media should well understand is the proliferation of disinformation is a global phenomenon which is likely state-sponsored. Guess who?<br/><br/>It has been used to misinform UK citizens about Brexit, with the help of some useful idiot politicians who generally resigned when it was clear their claims about staying in the EU Single Market as a non-EU member solved none of the issues advertised.<br/><br/>Russia's economy has suffered from sanctions for invading Crimea, so their response was a cheap but effective one: hire and otherwise incentivize people to spread fake news that magically achieved hundreds of thousands of hits and liar revenue.  <br/><br/>The more ludicrous the story the better, and Hillary stories earned instant click-bait out of nowhere to popularize them to the masses - strategically. <br/><br/>Trump was Russia's candidate for President, but he didn't have a chance to win the popular vote. He lost by nearly 3 million votes. <br/><br/>But he scrapped by with about 100,000 votes in the Electoral College without ads vetted on media, but through outlandish vitriol and invectives served up through social media.   <br/><br/>This is a tactic that will not end with Trump's election, but accelerate. <br/><br/>This is a nation of 320 million people and a planet of some 7 billion. We must each decide what kind of world we want this to be. <br/><br/>Social media may have created a set back in this election cycle, but it is also the answer and the way back to truth if people take individual responsibility.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5798/7015/cropped-57987015.jpg?0.2362159366072062", "createDate": "1481424893", "commentID": 20766825, "userID": 57987015, "recommendations": 123, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766825}, {"approveDate": "1481462879", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481462879", "permID": "20766833", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Roslyn, New York", "parentID": null, "userDisplayName": "Elizabeth", "commentTitle": "<br/>", "commentBody": "Used to be you went to school to learn. Learn the correct answer. Learn critical thinking. There used to be a correct answer and a wrong answer. And you learned to understand the difference between the two and how to arrive at the correct answer.<br/>What happened? Are they not teaching this in schools anymore? Is 1+1=3? 1+1=2. This is one kind of truth. The other kind of truth has to do the golden rule of Do Not Lie.<br/>I was taught at home, in school and in church that you should not lie. Always tell the truth. I know this seems too simplistic but maybe not. Why is the truth no longer valued in our own conduct, in the conduct of others and therefore our society? I know new social media makes it easier to lie but why are so many doing it and accepting lying? I do not tolerate lies from my family. We lead 'normal' lives, are not exceptional in any way and really have no reason to lie.<br/>I assume there are many families like mine. And we can usually figure out when someone is not telling the truth.<br/>Trump has brazenly taken the politician's lie to a whole new level and should not be allowed to do so without being called out. I am so tired of the MSM using the<br/>phrase \"unprecedented\" with regard to Trump. It is either at the truth or a lie.<br/>Stop fudging the issue. I have never seen so many people and institutions rush to kiss such dirty feet. Is the anticipated gain of money or power so alluring?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481425012", "commentID": 20766833, "userID": 75756905, "recommendations": 214, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20766833}, {"approveDate": "1481465539", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481465905", "permID": "20767031", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ramat-Gan", "parentID": null, "userDisplayName": "Joshua Schwartz", "commentTitle": "<br/>", "commentBody": "Politicians of all ilks and all persuasions have always lied and always tried to justify it if caught: \"it depends on what the meaning of the word 'is' is\" says Mr. Clinton in an acrobatic contortion of truth.<br/>Mr. Trump has just taken it a step further: reality TV facts and reality TV lying. When you elect a reality TV star you get reality TV reality.<br/>In politics facts are relative as is truth.<br/>Mr. Trump has just stretched the distortion beyond what was the common \"gentleman's agreement\".<br/>It may bother the NYT, but apparently many people already live in reality TV land, the fact-truth wave of the present and future. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481427170", "commentID": 20767031, "userID": 53713809, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767031}, {"approveDate": "1481465782", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481468226", "permID": "20767087", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jupiter Island, FL", "parentID": null, "userDisplayName": "Lars", "commentTitle": "<br/>", "commentBody": "Our nation is in deep trouble.<br/><br/>The media, and particularly TV failed in their duty to not only deliver the truth, but they have also failed to focus our attention on the issues of real importance to good governance, health, the environment and society at large.  <br/><br/>Rather, the media have chased tittilating stories, ratings and celebrity access.  They have failed for decades to challenge bold faced lies, outright obfuscation and falsehoods spread in the pursuit of political power and wealth by a never ending cesspool of DC based strivers and finance industry miscreants.  The media pander to demonstrable liars in furtherance of their ongoing access to the stars of the show.  Disgusting media laziness.  Well, folks, you've toasted the nation now, and maybe the world itself.<br/><br/>And all this before we even consider the power exercised by Fox News and Hate Radio in shaping the minds of their listeners.  Years, no decades of distortion and half truths, even outright falsehoods have literally destroyed trust and civility in Amurca, right before our eyes.<br/><br/>The Republicans have excelled in consistent messaging.  If it was against their goals, or benefitted them, it became a never ending story.   Benghazi, school choice, death panels, tax cuts, emails, evils of unionization, race baiting, guns<br/><br/>You can put all the fancy words on it you want.  <br/><br/>If this nation is ever to rise again, it will only be after truth is valued again, and lying has palpable negative consequences.  Guaranteed.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481427724", "commentID": 20767087, "userID": 70294669, "recommendations": 262, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767087}, {"approveDate": "1481468759", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481468797", "permID": "20767370", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Shrewsbury, MA", "parentID": null, "userDisplayName": "Daniel Rose", "commentTitle": "<br/>", "commentBody": "\"Without a Walter Cronkite to guide them, how can Americans find the path back to a culture of commonly accepted facts, the building blocks of democracy?\"<br/><br/>Given that we have a president and supporting stable of politicians who not only care little, or nothing for the truth, but actively militate against it, I'm afraid we have no path forward \"to a culture of commonly accepted facts\" that will not subject most of us, but especially the middle and lower classes, to enormous pain and suffering before enough of us wake up to reality sufficiently to vote both our own and our common best interest.<br/><br/>And none of that is guaranteed for sure. We may not even survive the next few years given the GOP-abetted larceny that Trump is about to launch against both our nation and the world. Even some Democrats may well contribute to this catastrophe given the raging hurricane of political hot air that is about to descend on us all.<br/><br/>Just for an example, what if government blow back against Trump reaches the point of an attempted military coup? What then? You think it could not happen to this great nation? Could we even be faced even with another Civil War?<br/><br/>Sorry but historians have already hinted about the last time such populist activism reached the presidential level in this country, and it was followed by a Civil War. Could it happen again? What of \"a culture of commonly accepted facts\" then?<br/><br/>We all will have to suffer unavoidable necessity to avoid these unthinkable outcomes.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481431810", "commentID": 20767370, "userID": 15918791, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767370}, {"approveDate": "1481468760", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481468833", "permID": "20767379", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "British Columbia", "parentID": null, "userDisplayName": "Rob Page", "commentTitle": "<br/>", "commentBody": "I think you give Trump too much credit by saying he understood the electorate better than most. He simply did what he does and poorly educated white voters happened to respond to it. He stood up in front of crowds and was responsive to them. He said the things that made them cheer, without the slightest thought about the veracity of his words. His narcissism happened to coincide with the rise of social media fake news and sites catering to long-held biases. His persona and message, laughably inept any other time, caught the wave of the post-truth paradigm and rode it to an election win. Trump is a transparent, lying fool, but he lucked into an electorate who had lost the ability and desire to detect falsehood.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481431966", "commentID": 20767379, "userID": 72207977, "recommendations": 250, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767379}, {"approveDate": "1481470016", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481470531", "permID": "20767591", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "John K", "commentTitle": "<br/>", "commentBody": "The disintegration of the quality of public discourse is very disturbing to me.  It started a long time ago.  One of my proudest moments as a young reporter at The Wall Street Journal was when our managing editor, Fred Taylor, confronted Mike Wallace of CBS's 60 minutes on a televised panel about journalism.  Wallace started to opine about something and Taylor questioned his credentials.  \"You, sir, are not in the news business; you are in the entertainment business.\"  Taylor was not only right but depressingly prescient.  Things have basically gone downhill ever since.  I am not a newspaperman anymore, but I still take great pride that when I was I could be sure that most of my colleagues and I went to work everyday determined to seek out the truth no matter what that meant we ended up writing.  I know there are still many journalists who believe that is their job.  But their voices have been overwhelmed by those with different agendas.  This is a very greater threat to democracy than anything else we have ever confronted as a nation.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481435140", "commentID": 20767591, "userID": 59842706, "recommendations": 183, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767591}, {"approveDate": "1481470016", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481470503", "permID": "20767606", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles CA", "parentID": null, "userDisplayName": "Casual Observer", "commentTitle": "<br/>", "commentBody": "Trump's misrepresentations of fact are based upon a failure to respect democratic institutions. He acts and probably believes that he can motivate most people to do what he wants. Trump reflected the feelings of his supporters and those feelings were true for them regardless of the factual nature of what Trump stated. These are people who fail to grasp that just because someone seems to be strong and determined to have their way does not mean they are able to do anything any better than those who have already tried to resolve the problems, but they were raised to trust that such dominant personalities can do what they seem to promise. <br/><br/>It would be wise to look at his picks for top jobs in his administration. He is picking people who have spent their entire adult lives in high positions in authoritarian organizations. These are people who give orders or tell people what they want done. Sometimes they are involved in negotiations but the settings are well defined and the participants are committed to finding quick resolutions. That's not how democratic institutions operate. Trump is in for some big surprises as he tries to work with Congress and all the other stakeholders in our government's businesses, and so will a lot of his top people.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481435462", "commentID": 20767606, "userID": 21896305, "recommendations": 64, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767606}, {"approveDate": "1481470712", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481471148", "permID": "20767720", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palo Alto", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "Republican spin doctors can try to cook up their own realities all they like.  However, the key point, which is not emphasized sufficiently in this otherwise excellent editorial, is that reality is, in fact, unitary.  At least at the macroscopic scale.  Either we are warming the planet or we are not.  Spinning stories isn't going to lower the temperature or reduce the rate at which ice is melting.  Either the Russians acted to interfere in the recent national election, or they did not.  Either Carrier retained 1100 jobs or it retained 730.  Numbers are numbers, specific actions actually occur, measurements have specific values.  And here's the punch line:  you ignore reality at your extreme peril, because it is there, and it is totally indifferent to your 'spin'.   Ignore it, and it'll bite you on the backside every time.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481437427", "commentID": 20767720, "userID": 67153200, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767720}, {"approveDate": "1481471441", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481471976", "permID": "20767830", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Missouri", "parentID": null, "userDisplayName": "WatchingListening", "commentTitle": "<br/>", "commentBody": "This discussion of truth vs. lies seems to be based on the supposition that if people could separate truth from lies by knowing the facts, their thinking would be influenced and their judgments, rooted in reality, would be sounder and more trustworthy. From what I've observed, this isn't the case. We've entered an era, I believe, when truth no longer matters to a large segment of the population; many people simply believe what they want to believe because it reaffirms their prejudices and world view, and they refuse to consider any information to the contrary. Also, thinking in the pursuit of truth is hard work; it's so much easier simply to accept the story lines that validate the preconceived notions of one's tribe. Was Trump elected because millions of Americans didn't realize he tells outrageous lies--or because they just don't care?   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481439839", "commentID": 20767830, "userID": 66772341, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20767830}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1219, "api_timestamp": "1488822330", "totalReplyCommentsFound": 414, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}