{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 3, "totalParentCommentsReturned": 16, "totalParentCommentsFound": 696, "totalEditorsSelectionFound": 19, "depthLimit": 0, "totalRecommendationsFound": 693, "comments": [{"approveDate": "1474082250", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474104530", "permID": "19825226", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 20, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cambridge, MA", "parentID": null, "userDisplayName": "Peter", "commentTitle": "<br/>", "commentBody": "It is astounding and appalling that this man is edging towards winning the presidency of the United states. How can so may people still support someone who lies repeatedly, again and again? I despair for my country.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4736/1591/cropped-47361591.jpg?0.9130562037405954", "createDate": "1474081701", "commentID": 19825226, "userID": 47361591, "recommendations": 1521, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825226}, {"approveDate": "1474082450", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474104667", "permID": "19825295", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sydney, Australia", "parentID": null, "userDisplayName": "John Radovan", "commentTitle": "<br/>", "commentBody": "Birtherism was always just a symptom of the big issue in this election, that the system is broken, in large part because of Republican obstructionism In Congress and lack of respect for the democratic institutions. Remember Merrick Garland?<br/><br/>What is worrying is that the Democrats and the media are now so distracted by Trump's almost daily outrages and improvement in the polls that they are letting the Republicans off the hook for the damage they have done . ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474082208", "commentID": 19825295, "userID": 64654871, "recommendations": 1020, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825295}, {"approveDate": "1474108015", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474104415", "permID": "19825378", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn", "parentID": null, "userDisplayName": "Mark Greenfield", "commentTitle": "<br/>", "commentBody": "Trump's strategy here is repugnant. He has established his bona fides with the more racist elements of the Republican party so strongly, that he now feels safe in pivoting and blatantly lying to the more centrist members of the party so they can feel safe in voting for a redeemed racist. <br/><br/>The birther wing of the party knows this act of redemption is just an act, and that if elected Trump will be the nativist bigot they have brought so far. What remains to be seen is how many centrist Republicans and Independents will go along with the man when he holds up two fingers and tells us he's holding up three.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474082943", "commentID": 19825378, "userID": 65407630, "recommendations": 405, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825378}, {"approveDate": "1474109600", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474106000", "permID": "19825628", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "BchBum23", "commentTitle": "<br/>", "commentBody": "\"Mr. Trump delegitimized his own candidacy instead.\"<br/>Trump delegitimized himself the second he announced his candidacy but it is quite evident that it has not made a difference. There are a myriad of reasons why he made it this far but a prime reason, if not the prime reason, is that most of the press has seemed to have a real difficult time calling him liar. Using variations of \"falsehood\" or \"deceit\" may be a more genteel way of putting it, but calling a liar a liar is what is called for.<br/>If Trump opens his mouth, it doesn't make what comes out of it newsworthy unless there is something of substance to back it up. Trump saying that he heard something from a credible source or saying that a lot of people think such and such does not make his claims fact based. If he can't provide and the press can't verify credible sources for his statements, don’t make a front page story out of a mad man’s ramblings. Giving prominence to an absurd and unsourced Trump claim is no different than the National Enquirer writing about Elvis living on Mars eating Twinkies. Well, actually it is different. It is much worse.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474085040", "commentID": 19825628, "userID": 10388529, "recommendations": 542, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825628}, {"approveDate": "1474109830", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474106230", "permID": "19825449:19825672", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": "Nick Metrowsky", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ocean Beach", "parentID": 19825449, "userDisplayName": "RRI", "commentTitle": "<br/>", "commentBody": "\"How much did Ms. Clinton know back then, is still up for debate.\" <br/><br/>Just like the climate change debate, eh? Like cigarettes maybe not causing lung cancer? Sorry, there is no \"debate\" here. There is consensual, repeatedly confirmed reality; and then there are demagogues and the deplorable \"just asking questions\" to insinuate and propagate in public consciousness the lies they yet dare not say brazenly. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2151/9090/cropped-21519090.jpg", "createDate": "1474085525", "commentID": 19825672, "userID": 21519090, "recommendations": 306, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825672}, {"approveDate": "1474111495", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474107895", "permID": "19826718", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Belmont MA", "parentID": null, "userDisplayName": "Diogenes", "commentTitle": "<br/>", "commentBody": "Mr. Trump has delegitimized his own candidacy, and more ominously his own presidency if elected. Were he a normal politician, he would have trouble uniting the country and governing effectively. But he isn't normal. He has a severe personality disorder, and would lash out at any one who challenges him, including his own cabinet members, members of both parties, foreign leaders, the military. The result would be a continuing and exhausting series of crises: Cabinet officials fired and hired, increasing gridlock in Congress, poisonous relations with the press. Ruptured relations with friendly countries as well as adversaries. Over-reactions to slights and attacks.<br/><br/>We might even enter our most serious political crisis since the Civil War. That  was ignited in the 1850s by conflict over extending slavery to the then territories. Now it could be immigration and the growing conflict between white working men and the growing population of minorities. People are aware that whites will become a minority within the next ten years. The effort to deligitimize President Barack Obama as well as the break-up of the Republican Party are indicative of this impending crisis.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474104110", "commentID": 19826718, "userID": 38816970, "recommendations": 284, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19826718}, {"approveDate": "1474111503", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474107903", "permID": "19827059", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Upstate NY", "parentID": null, "userDisplayName": "Joseph Huben", "commentTitle": "<br/>", "commentBody": "Many Americans believe Hillary is guilty of lying, that all politicians are liars. Many Americans \"think fast\", that is, they draw conclusions based on their immediate impressions, on their biases. Once they have arrived at a conclusion many are unable to \"walk back\" their conclusion, even if the evidence demands that they do.<br/>\"Stretching the truth\" and Trump's lies about Obama are even more difficult to distinguish. When Trump says he will be the healthiest president he is \"stretching the truth\". When he says Obama is a Muslim, favors Muslims, he is lying. Many Americans react the same to both claims. We have little choice in responding to a serious threat and a minor threat. If we encounter a lion or are startled by a loud noise, our visceral response is automatic and similar. What distinguishes those who think Trump's lies are the same as Hillary's truth stretching is not available to many Americans. They cannot tell a real threat from a reflex.<br/>It is important for the media to look for and identify the false equivalences that have enabled Trump to become a genuine threat. This editorial is a start and it is late. Some people are so inured to Trump's outrageous statements and claims and proposals, that they think they are normal or reasonable because they succeeded in defeating all Republican rivals and because the media reports them as if they were equal to the truth.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474108940", "commentID": 19827059, "userID": 1132383, "recommendations": 340, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19827059}, {"approveDate": "1474113721", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474110121", "permID": "19825905", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "laura174", "commentTitle": "<br/>", "commentBody": "Where was all this media outrage 5 years ago?  Donald Trump was allowed to build a presidential campaign on a blatant racist lie with little to no media scrutiny.  No one asked him to show proof of the so-called investigation he was conducting.  He was never asked to present the investigators he had looking into  the President's birth.  He was allowed to insult the President of the United States with impunity.<br/><br/>Hilary Clinton was dragged through the mud for calling Trump's supporters 'deplorable'.  The truth is that 'deplorable' was a compliment.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474088419", "commentID": 19825905, "userID": 2734975, "recommendations": 666, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19825905}, {"approveDate": "1474113732", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474110132", "permID": "19826335", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ex-pat in Belgium", "parentID": null, "userDisplayName": "Ed Gracz", "commentTitle": "<br/>", "commentBody": "Donald Trump is loathsome, and I grow tired of telling my European (and African) colleagues that he and his ilk do *not* represent Americans as a whole.<br/><br/>But there are lessons from the rise of xenophobia and racism here in Europe for us back in America, lessons that the advocates for Brexit didn't learn.<br/><br/>If we spend our time calling Trump and his followers names, they will just shut down and stop listening. I believe Clinton was right about a proportion of Trump's followers being deplorable, but I also remember my beloved Nana's comment, decades ago, that you have to be smart about being right.<br/><br/>There are those who will never believe Obama was born in the US, just as they believe -- against all evidence -- that unemployment is up and the stock market has crashed over the past 8 years and so on. Let's spend the next 50+ days reaching out with visions of the future, not obvious frustrations with Trump's clinical  insanity.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474095446", "commentID": 19826335, "userID": 66325009, "recommendations": 213, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19826335}, {"approveDate": "1474113818", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474110218", "permID": "19827250", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Las Vegas", "parentID": null, "userDisplayName": "Phil", "commentTitle": "<br/>", "commentBody": "In celebrity culture, legitimacy flows from celebrity.  An extreme example: the guy who has led the Free World for eight years doesn't get to be a US citizen until the celebrity says so.  Sorry folks, but this is the way it has to be, or our World will turn upside down.  If Kanye West designed the most ethereal suit for Trump's coronation, the rest of the world may see 'the emperors new clothes', but here in celebrity-obsessed America its a suit of blinding light, curing the minions of boring mediocrity just by looking at it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474110869", "commentID": 19827250, "userID": 69843538, "recommendations": 95, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19827250}, {"approveDate": "1474113872", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474110272", "permID": "19826972", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Curt Dierdorff", "commentTitle": "<br/>", "commentBody": "Another day when the country's attention is focused away from substantive matters by the wizard of Trump.  He figures out ways to divert attention and the media is drawn to the diversion.  Like Voldemort, Trump gets stronger with each diversion. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474107920", "commentID": 19826972, "userID": 52952247, "recommendations": 187, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19826972}, {"approveDate": "1474115324", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474111724", "permID": "19827640", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Connecticut", "parentID": null, "userDisplayName": "Marc", "commentTitle": "<br/>", "commentBody": "Donald Trump's motto should be Make America Hate Again. He does not care who he bullies. The scary part of Mr. Trumps campaign is not Mr. Trump as he is one person; it is the million of supporters who will vote for a person with Mr. Trumps demeanor and racist overtures. His comments throughout his campaign are disgusting. He gets away with it because he lies and repeats his lies until the public takes them as fact. If Mr. Trump was to win it says more about who we are as a Country and why Congress has been so ineffective. I will never vote Republican again as too many people are picking Party over person and that is how demigods are elected. If we want to move forward as a nation vote for Hillary Clinton. If we want to risk our future to a bully, racist, deplorable human being vote for Mr. Donald Trump and Make America Hate Again will become more than just a motto.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474113804", "commentID": 19827640, "userID": 63530327, "recommendations": 207, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19827640}, {"approveDate": "1474116241", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474112641", "permID": "19828070", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "St. Louis, MO", "parentID": null, "userDisplayName": "pianopal", "commentTitle": "<br/>", "commentBody": "Lots of people, including those in the media, don't get it. Trump is a genius at playing us. Remember he is the Kardashian candidate, saying outrageous things that even he probably doesn't believe, that draw attention to him and make everybody forget the other candidate. If Hillary is making a wonky policy speech one day, laying out a sensible tax reform plan, Trump will announce that he is about to change his mind about the \"Birther\" issue. The media swarm like flies to flypaper, breathlessly awaiting both the announcement and the announcement of the announcement and then disseminating the \"Breaking News.\" Boring things like substance and the truth get lost in the scramble. \"The Show\" is so much more fun. Trump has been playing his enablers (a public with mass attention deficit disorder and a media frantic for ratings) like a virtuoso. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474116157", "commentID": 19828070, "userID": 13032058, "recommendations": 292, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19828070}, {"approveDate": "1474118967", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474119916", "permID": "19828121", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Wally Burger", "commentTitle": "<br/>", "commentBody": "For all of Trump's faults and weaknesses (and there are many), the fact remains that Hillary is a terrible campaigner.  She is highly qualified to be POTUS whereas Trump is highly unqualified but he may win because she is such a terrible campaigner.  She has lots of good company, unfortunately.  Messrs. Kerry, Gore, and Dukakis were all terrible campaigners.  What should be a no-brainer, a slam dunk, may turn out to be a (global) disaster.  She has no charisma and she hasn't yet hit him where it hurts (in order to throw him off point) so that he shoots himself in the foot (something he is very good at).  She needs to have vendors who were wronged by Trump and workers who weren't paid by Trump, bankers whose banks lost money while Trump made millions, and anyone else who was hurt by him.  There is still time, Hillary.  Get with the program.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474116415", "commentID": 19828121, "userID": 67024387, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19828121}, {"approveDate": "1474122603", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474119003", "permID": "19825087:19829384", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "John Brooks", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "North Port, FL", "parentID": 19825087, "userDisplayName": "Joyce Benkarski", "commentTitle": "<br/>", "commentBody": "I have friends and relatives that believe his big lies.  They think HRC is the biggest liar out there.  No proof can change their minds.  They want guns for every (good) guy out there, charter schools, and to break up unions.  Some have money, others are living off the system (Medicare, Social Security, and Military Pensions), but they believe others are the takers, as they deserve everything they get.  Cannot believe the buying of the outright lies they have been fed.  Most started with the Military Service, as they were told lies to make them fight, and continue with the lies when they come home.  Brainwashed.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474122074", "commentID": 19829384, "userID": 34536667, "recommendations": 122, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19829384}, {"approveDate": "1474123367", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1474119767", "permID": "19828121:19829043", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Wally Burger", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnait", "parentID": 19828121, "userDisplayName": "Ethel Guttenberg", "commentTitle": "<br/>", "commentBody": "Wally Burger   I don't think Kerry, Gore and Dukakis lost because they were terrible campaigners. ( Actually, Gore won the popular vote)  They lost because the voters voted on lies presented by the Republican party.   Most people are simple uninformed voters.  Few in our population read papers like the Times.  Most listen to FOX and have no reference to fairness.<br/>No, Hillary is not a bad campaigner.  Trump is a liar who has been allowed to get away with his lies.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474120371", "commentID": 19829043, "userID": 35092717, "recommendations": 141, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19829043}, {"approveDate": "1474124385", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474120785", "permID": "19829780", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Nevada", "parentID": null, "userDisplayName": "jacobi", "commentTitle": "<br/>", "commentBody": "For most Americans this will have no affect on their vote.  The thing is Americans expect \"progressive\" politicians to call the republican candidate a racist.   The race card has been used so often, and so dishonestly it has become meaningless.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474123899", "commentID": 19829780, "userID": 59656291, "recommendations": 12, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19829780}, {"approveDate": "1474124669", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474121069", "permID": "19826606", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "West Waren MA", "parentID": null, "userDisplayName": "Dana Charbonneau", "commentTitle": "<br/>", "commentBody": "It takes a lot of chutzpah to admit one truth while telling a new lie.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474101657", "commentID": 19826606, "userID": 71623225, "recommendations": 56, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19826606}, {"approveDate": "1474127972", "commentType": "comment", "userTitle": "NULL", "updateDate": "1474124372", "permID": "19830521", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Somewhere In The US", "parentID": null, "userDisplayName": "Hey Joe", "commentTitle": "<br/>", "commentBody": "I despair along with most Americans over this election.  The problem is that the option to Trump, HRC, is odious in her own right.<br/><br/>I won't vote for Trump, and I can't vote for HRC.  Her little pneumonia episode finally did it.  I simply can't vote for such a deceiving and blindly ambitious person.  Both candidates clearly care only for themselves and their reputations, and not for the citizens they aspire to govern.<br/><br/>I'll likely vote for Johnson.  I have the right to cast my vote for the person I believe is most fit to lead our country! from the choices I have.  It's easy to eliminate Trump and HRC, neither of which is deserving of my vote.<br/><br/>The last six weeks will be a battle for people who feel as I feel.  As it was with Nader and Perot, this race will be decided by who gets hurt the most from these party defections.<br/><br/>If this leads to a Trump victory, so be it.  I can't vote for Trump or HRC and have a clear conscience.  The voters didn't create this mess.  It is the cancer inside both major parties that have pushed us to this point.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1474127479", "commentID": 19830521, "userID": 66421514, "recommendations": 13, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19830521}], "totalEditorsSelectionReturned": 19, "replyLimit": 3, "totalRecommendationsReturned": 19, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1041, "api_timestamp": "1488822341", "totalReplyCommentsFound": 345, "totalCommentsReturned": 19, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}