{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 12, "totalParentCommentsFound": 146, "totalEditorsSelectionFound": 12, "depthLimit": 0, "totalRecommendationsFound": 191, "comments": [{"approveDate": "1475317586", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333557", "permID": "19979291", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Buffalo", "parentID": null, "userDisplayName": "Frank", "commentTitle": "<br/>", "commentBody": "I am a Clinton supporter but I think her plan on infrastructure is underwhelming.  We need much more investment there and we can borrow to do it.  This is something that Trump has right actually.  <br/><br/>This article is a little confusing.  It's not Trump's infrastructure plan that is the problem,  it is his tax plan.  I can't stand the guy but I think he's closer to what we need in infrastructure spending compared with Clinton.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475294860", "commentID": 19979291, "userID": 72322691, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19979291}, {"approveDate": "1475320748", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333518", "permID": "19980517", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "WA", "parentID": null, "userDisplayName": "Look Ahead", "commentTitle": "n/a", "commentBody": "Older readers might remember a time when infrastructure spending was not controversial and we had Federal and State taxes on gas and diesel dedicated to pay for it. Things have changed.<br/><br/>Federal gas tax at a fixed $0.18 per gallon hasn't changed since 1993, when gas cost $1.10, while inflation has increased construction costs. If it were inflation adjusted, it should be about $0.30. If a fixed % of gas price, it would be over $0.40.<br/><br/>To compound the problem, Federal and State highway trust funds were raided to balance budgets. Kansas and Texas diverted 25% or more to pay for education and health care as they cut other taxes. <br/><br/>Restoring and dedicating the gas tax at a time when gas prices are low would favor more fuel efficient cars and trucks, which would in turn keep pressure on global oil production that funds extremism funded by Saudi Arabia and others.<br/><br/>And then there is that climate change thing. So let's call it a carbon tax and dedicate some revenue to reducing congestion, bus rapid transit and other cost effective transportation measures. <br/><br/>This will happen at the state level in certain states, while others like Kansas will remain mired in tax slashing and budget maneuvering.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475320714", "commentID": 19980517, "userID": 18426496, "recommendations": 185, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19980517}, {"approveDate": "1475323559", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333628", "permID": "19980402", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "GA", "parentID": null, "userDisplayName": "Kathy White", "commentTitle": "<br/>", "commentBody": "Public services require investment at the local, state, and federal levels. This is how modern societies work - public benefits from tax dollars. Public schools, law enforcement and public safety, fire departments, infrastructure development and maintenance connecting rural communities to towns and to cities, sports and convention complexes, municipal development, parks and recreation - all impact out lives for the better and draw small and large businesses to grow local and state economies.<br/>Simple cause and effect suggests cutting taxes reduces sources of revenue for investment in public services. This action has caused neglect to atrophy public growth. Some state legislatures and Congress appear to think in the short-term, and planning for American society requires a consensus long-term approach.<br/>Today, we are experiencing the imbalance resulting from decades of short-term thinking and neglect. Consider the only possible alternative to public services we all enjoy, many at no additional cost, is private services, which will be provided to those who can afford them.<br/>The economic class distinction suggested is something Americans have traditionally rejected as unwanted and unfair. All people, rich and poor, should have the same access to vital public services we appear to have taken for granted.<br/>It is our responsiblity to elect leaders who think in terms of what has worked, not focused on economic theories that have been demonstrated failures.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475319497", "commentID": 19980402, "userID": 74003506, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19980402}, {"approveDate": "1475323559", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333625", "permID": "19980536", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cape Cod, MA", "parentID": null, "userDisplayName": "Mike B.", "commentTitle": "<br/>", "commentBody": "This is the Trump way. For a man who relies on the bankruptcy courts as a standard means of extricating himself from his own foibles, this should be no surprise. Another example of this man's shallowness is when he withdraws money from his own charitable Foundation to contribute to other charitable causes, giving the false impression that his personal generosity knows no limits when, in fact, he is using other people's money, never his own. The man is a fraud, pure and simple. How anyone can vote for this selfish cretin to be our next President is beyond understanding...They must have an irrational hatred for Hillary. I think this philosophical divide between the two political camps goes all the way back to our early colonial period where the Whigs (Democrats) and the Tories (Republicans) were the principal political parties. The Whigs favored a democracy where power was distributed and not centralized in a single authority; the Tories, on the other hand, favored a more authoritarian style and remained loyal to the King of England. The divide between our two parties today is very similar. We seem to be wired differently and it is frustrating to think that the divide so often seems impossible to bridge.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4882/0267/cropped-48820267.jpg?0.9182498189468751", "createDate": "1475320904", "commentID": 19980536, "userID": 48820267, "recommendations": 66, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19980536}, {"approveDate": "1475323641", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333686", "permID": "19979852", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "J.D.", "commentTitle": "<br/>", "commentBody": "I keep hearing him talk about lowering taxes, and while that might seem appealing on the surface, all the services that the government provides -- the military, roads and bridges, police, public schools, libraries, etc. -- all get funding from taxes. So, at its foundation, it just doesn't make sense. How can our country be \"great\" without a military, roads, bridges, police, schools, and libraries? Because, the vision of a country without any of those things seems pretty bleak to me.<br/><br/>But, then again, this is from the man who criticized Clinton for not spending the last 30 years helping to create jobs for people...but, that's not what senators and secretaries of state do, is it? Perhaps one of the criteria for being president should be actually understanding how the government works.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475304916", "commentID": 19979852, "userID": 75863961, "recommendations": 141, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19979852}, {"approveDate": "1475329938", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333748", "permID": "19981626", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massapequa Park, NY", "parentID": null, "userDisplayName": "Eugene Patrick Devany", "commentTitle": "<br/>", "commentBody": "Mrs. Clinton wants to continue the expansion of the size and power of the central federal government at the expense of state decision making. She is motivated by social engineering and not project efficiency.<br/><br/>In several editorials about infrastructure needs, there is a consistent NYT political preference for Washington to decide what projects are approved, what states get the money; and what union, pro-gay, wage and bathroom regulations must be met as a condition of federal funds. States and localities with more conservative social laws are superceded by Obama-type regulations that accompany any federal funding. This can be seen in the federal approach to education funding that has enabled Washington to dominate all aspects of primary, secondary and higher education at the expense of private institutions. <br/><br/>The key difference with Trump infrastructure programs is that the regulations and micro management of the projects would be eliminated. Repairs would more likely be made on time and below budget without all the unnecessary \"social\" engineering, union and EEOC red tape. No regulations are needed for our existing Civil Rights laws to be enforced by the plaintiff’s bar and the courts.<br/><br/>As for tax reform, we simply need to tax wealth and income inversely. Let high earners pay lower income taxes if they are willing to pay higher wealth taxes – and vice versa. <br/><br/>Trump and Bernie Sanders share the bond of being the only national candidates to support a wealth tax at one time.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475328210", "commentID": 19981626, "userID": 65021610, "recommendations": 4, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19981626}, {"approveDate": "1475330110", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475326510", "permID": "19981078", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NRW, Germany", "parentID": null, "userDisplayName": "Pierre Markuse", "commentTitle": "<br/>", "commentBody": "While of course perfectly true, it is getting tiresome to over and over read about Mr. Trump and how clueless he is, how his polices are just make-believe and will never work as intended if ever put into action. I do understand that many people, including the Times Editorial Board, are quite aware of the damages a Trump presidency would do to America and they are doing everything to steer people away from Trump, to open people's eyes and show them how Trump's policies will, in the end, work against America.<br/><br/>But right now all those good intentions are just \"preaching to the choir.\" Clinton supporters will, without doubt, agree with all that has been said and Trump supporters are too fact-resistant to be reached by an article like this one. And most undecided voters will be undecided about voting for Clinton or a third-party-candidate, I doubt there are many people undecided between Trump and somebody else.<br/><br/>It is a frustrating situation. Frustrating to see that a showman like Trump could amass that much support, and frustrating to see how many of his supporters are blinded by his promises, ignoring facts and reason. This election could change America for a long time to come, not only the four years of a possible Trump presidency. Go on, write about Trump, but to reach his supporters write about his hypocrisy, misogyny, and emotionally accessible wrongdoings, don't rely on policy facts. His supporters clearly don't. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7658/3578/cropped-76583578.jpg?0.029865682926012882", "createDate": "1475325174", "commentID": 19981078, "userID": 76583578, "recommendations": 65, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19981078}, {"approveDate": "1475330244", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333736", "permID": "19980883", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Orleans", "parentID": null, "userDisplayName": "Mike Marks", "commentTitle": "<br/>", "commentBody": "One of the cornerstones of citizenship is paying taxes to build and maintain infrastructure, provide for defense and help the less fortunate. I've always felt good about paying my fair share in the roughly 35% range. Now comes Donald, seeking the Presidency while boasting of paying zero taxes, saying that tax dollars are wasted anyway and implying that guys like me are chumps.<br/><br/>On taxes as in other things, a President sets an example for the nation. A President must encourage individuals and businesses to pay taxes so there is money to run the nation. <br/><br/>If Donald wants to be President he needs to pivot on his pride in tax avoidance and not only disclose his tax return but propose how he'd close the loopholes that enabled him to pay so little. One of the few truths he's spoken is that he knows how the corrupt system works because he's been one of its biggest corrupters. Now he must explicitly explain how he'll use his special knowledge to benefit us all.<br/><br/>Now is a perfect moment for Donald to put his money where his mouth is. He should disclose his tax avoidance schemes and then explain how won't be able to get away with them if he becomes President.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3081/7763/cropped-30817763.jpg", "createDate": "1475323943", "commentID": 19980883, "userID": 30817763, "recommendations": 48, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19980883}, {"approveDate": "1475330244", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333901", "permID": "19981318", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lancaster, MA", "parentID": null, "userDisplayName": "Adonato", "commentTitle": "<br/>", "commentBody": "What disappoints me in these infrastructure plans is that it simply maintains the status quo.  China is building high speed trains. We are dragging our feet on implementing controls to prevent accidents on our ancient system.  I was in Chicago this week and was amazed at the intensity of traffic.  Our current transportation strategy is unsustainable on many fronts. We need candidates who will move create opportunities and set the stage for innovators like Elon Musk to create the future. That is where the jobs will come from.  How about applying some of the resources from our military to domestic problems. It seems to me that a lot of the work being done there is transferable to transportation.  Why not swap the paradigm and fund that with the idea that the tech could be transfered for defense if needed.  Eisenhower understood that a good transportation system was part of a good defense strategy. It is time to look at things differently.  Neither candidate is doing that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475326677", "commentID": 19981318, "userID": 44003998, "recommendations": 33, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19981318}, {"approveDate": "1475330328", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333886", "permID": "19981991", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "IL", "parentID": null, "userDisplayName": "blackmamba", "commentTitle": "<br/>", "commentBody": "Neither Trump nor Clinton have any credible significant infrastructure improvement planned strategy.  <br/><br/>Donald Trump's income tax cut plan for corporate plutocrat oligarchs is the return of Reagan era trickle down economics. The elder Bush called it \"voodoo economics\" and Reagan economics adviser David Stockman labeled it a farce.<br/><br/>Hillary Clinton's tiny tepid $275 billion initial infrastructure reflects the Clinton era Republican light pedigree. By deregulating Wall Street banking allowing investment banks to own commercial and retail banks banking has become a reckless gambling industry. The Reagan era income tax scheme was maintained by the Clintons sending our jobs and their corporate plutocrat oligarch money overseas. The Clinton's were and are well to the socioeconomic political right of FDR and LBJ as expected but Ike and Nixon as well.<br/><br/>Neither Trump nor Clinton have a massive humane effective liberal progressive infrastructure improvement plan.  Comparing the Clinton plan as being marginally better than Trump's recalls the adage that\" in the land of the blind the one-eyed man is king\".  Hillary's one-eyed infrastructure plan is not worthy of being  taken seriously. Both of their plans are fatally flawed.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475330065", "commentID": 19981991, "userID": 17374907, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19981991}, {"approveDate": "1475337035", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475333435", "permID": "19982832", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "Dennis", "commentTitle": "<br/>", "commentBody": "It's hard to believe there could be any flaw in any plan conceived by The Donald. Are you sure you got the right Trump? The Right Wingnut job? The racist, chauvinist pig, odious uncouth blowhard billionaire who loves all things gold-plated with his name on it. That guy? You've got to be joking.<br/><br/>That's not the Trump I know. I'm a poorly educated white working class slob. I know the Trump running for president, the guy who \"tells it like it is\". I'll admit sometimes he's a bit impolite. That's because he's not Politically Correct, like all those other politicians, who lie and get nothing done. The Donald is going to fix all that. He promises to bring back coal mining, the steel industry, all the old manufacturing jobs that went to China, a country he says is the root of all our problems. <br/><br/>The Donald is going to read the riot act to China, and Russia, and North Korea, and Iran. He's on good terms with Putin and admires his \"strength\" and \"Stamina\". Putin's got \"Stamina\", unlike Crooked Hillary. Hillary has no \"Stamina\". Trump made that clear in his crushing Monday night debate with Hillary. He pulled in big numbers that night. He killed, and destroyed Hillary. <br/><br/>As for Hillary sneaking in that thing about the huge beauty queen at the end, trying to zing The Donald, well, as you saw this past week, Trump wasn't fooled or flummoxed for a minute. He's stayed up all week, day and night, tweeting his tremendous replies. He's winning again. That's The Donald I know.<br/><br/>DD<br/>Manhattan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475334888", "commentID": 19982832, "userID": 22528152, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19982832}, {"approveDate": "1475340260", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475336660", "permID": "19982698", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Manhattan,  NYC", "parentID": null, "userDisplayName": "@PISonny", "commentTitle": "<br/>", "commentBody": "Trump said during the debate that Obama doubled, if not tripled, the national debt and our infrastructure still rivals that in third world countries. In fact, some of the 'third world' countries like India have improved their infrastructure so much so that they some of the most spanking airports and highways. India actually has a NATIONAL HIGHWAY BOND that its citizens can buy and get tax free income over 10 or 20 years, and is backed by the faith and credit of the country. There is no reason why we cannot do the same here and let our own citizens and residents invest in our infrastructure. There is no need to go to foreign governments to do so.<br/><br/>Hillary's ideas are no different from Obama's, and after 8 years of Obama regime, we are no better off infrastructure-wise or race-relations-wise, and it is time to try a new approach, even if the preacher of that approach sounds like an unhinged maniac.<br/><br/>We cannot get different results by doing the same old same old. SOSO does not do it any longer. Time to move on to new thinking.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6181/1374/cropped-61811374.jpg?0.12154481428840624", "createDate": "1475334040", "commentID": 19982698, "userID": 61811374, "recommendations": 3, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19982698}], "totalEditorsSelectionReturned": 12, "replyLimit": 3, "totalRecommendationsReturned": 12, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 228, "api_timestamp": "1488822377", "totalReplyCommentsFound": 82, "totalCommentsReturned": 12, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}