{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 13, "totalParentCommentsFound": 220, "totalEditorsSelectionFound": 13, "depthLimit": 0, "totalRecommendationsFound": 204, "comments": [{"approveDate": "1441799287", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809313", "permID": "16033710", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, IL", "parentID": null, "userDisplayName": "Emma Shawver", "commentTitle": "<br/>", "commentBody": "I think that Donald Trump's candidacy serves to galvanize the base and make the points his running mates are making seem far less extreme. This can be a boon and a hindrance. On one hand, he may act like Ralph Nader if he runs as an independant and push the two parties further towards the right or the left, respectively. It is risky, though, because if he does get enough support (as the article points out, no one thought he'd make it this far, who's to say what could come next) he could end up losing votes for either party. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441799274", "commentID": 16033710, "userID": 72881241, "recommendations": 4, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16033710}, {"approveDate": "1441803668", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809309", "permID": "16034416", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hartford", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "There is absolutely no doubt that Cohn's basic thesis is correct. We have an elite democracy where the political class decides amongst itself who gets on ballots. However, there is something odd going on in the Republican party at present. A Republican operative said the other day the party has become disconnected from issues and substituted anger and contempt. Clearly Trump and the various other loony tunes candidates (Carson, Cruz, etc.) have the support of about two thirds of Republican voters. Whether this is determinative depends on what happens in the first couple of primaries. Until then it's all noise. If Trump wins a couple it's going to create momentum and momentum has a life of its own. All hell is going to break loose in the GOP. As for the notion of an anti Trump official campaign there are two big downsides to this. Firstly, it might simply backfire within the GOP itself and increase his support and secondly Trump could use it as an excuse to renege on his commitment to not run a third party candidacy because \"The party\" has double crossed him.     ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4800/0580/cropped-48000580.jpg?0.8383151208239556", "createDate": "1441803657", "commentID": 16034416, "userID": 48000580, "recommendations": 114, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16034416}, {"approveDate": "1441807688", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809350", "permID": "16035125", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Joe From Boston", "commentTitle": "<br/>", "commentBody": "There is the possibility that Trump, with his name recognition and free media coverage, has attracted all of the people who would vote for him.  If that leaves 75% of Republican primary voters to decide among the remaining 16 candidates, that works out to an average of about 5% each.<br/><br/>However, when the Republican field thins out, the remaining candidates will garner larger percentages of the primary vote.  The question is whether the field thins quickly enough to have multiple candidates with sizable delegate support by the time the convention rolls around.  If that is the case, the Republicans end up with an open convention, and that is where the elites get to apply their influence.  If Trump wins enough primaries with a 25 to 30% share of the Republican primary vote to win the nomination, the Republicans will be in very hot water.<br/><br/>Which, if any, Republican states award delegates proportionally to the vote, and which award delegates as a block to the winner?<br/><br/>How many states have runoffs on the Republican side if no one gets a clear majority? I believe that Mississippi does. Which others do?  In how many states would it end up as Trump vs. Somebody in a two person runoff?  That would be intersting to see.<br/><br/>How many states have open primaries, where Democrats and Independents can vote for a Republican candidate?<br/><br/>Pass the popcorn.  I can't wait to watch how this comedy turns out.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4952/842/cropped-4952842.jpg?0.7945210032630712", "createDate": "1441807624", "commentID": 16035125, "userID": 4952842, "recommendations": 42, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035125}, {"approveDate": "1441807808", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809342", "permID": "16035159", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle", "parentID": null, "userDisplayName": "Steve Hunter", "commentTitle": "<br/>", "commentBody": "Mr. Trump has entered the perfect storm and is quite adept at stirring the proverbial pot. This is not like 2012 and Mitt Romney where the Republican field contained weak candidates including Romney himself and the party elites held their collective noses and backed Mitt. There was not the level of unrest at endless wars, income inequality. immigration problems and so forth that we have reached today. In large part the Republican elites can blame themselves for embracing the tea party and Mitt's 47% remark.<br/><br/>Th electorate red or blue is fed up with the elites (moneyed people in power) and put off by the media and the pundits who write commentary such as this one by Cohn focusing on personality and not substance. Trump is no more inflammatory than the rest of the \"severely conservative\" GOP candidates, just more theatrical and blunt about it. The Republican party has been taken over by do nothing, obstructionist ideologies and Trump is not afraid to confront and call them out. If the elites are going to buy the election for that wimp, Jeb? then they had better start spending those millions in PAC funds and be prepared to spend a lot more.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441807791", "commentID": 16035159, "userID": 44499492, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035159}, {"approveDate": "1441808049", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809337", "permID": "16035197", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "ALALEXANDER HARRISON", "commentTitle": "<br/>", "commentBody": "Mr. Cohen makes a strong argument for the ultimate defeat of DT's candidacy by the GOP establishment, and I must say that I agree with him. But if they do succeed in frustrating's DT's candidacy, it  will be a Pyhirric victory, because if anyone else is chosen, his supporters will stay away from the polls in droves. There is so little difference between the 2 parties anyway, so why bother to show up to cast one's  vote? As I have written in previous published comments, DT is the hope and the vox populi of millions of little whites who have been cowed into submission by the p.c. crowd, and stand by in anger as they see their America vanishing.before their eyes. It is the most maligned, ignored constituency in the country. Does any clear thinking person want to see the party remain in the hands of people like Rove, Priebus, Erickson, Bush among other \"faux jetons.\" Better to express one's contempt for the process by staying home: Such is the thinking of the vast majority of DT's supporters. So,the party's establishment may win in the end, but it's victory will  be a costly one, ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441808000", "commentID": 16035197, "userID": 67182855, "recommendations": 34, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035197}, {"approveDate": "1441808649", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809377", "permID": "16035310", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "CA", "parentID": null, "userDisplayName": "calbengoshi", "commentTitle": "<br/>", "commentBody": "After acknowledging that he already has been wrong about Trump's candidacy before (\"Mr. Trump has not gone bust, as I thought he would\"), Cohn then goes on to repeat essentially the same analysis that led him to conclude incorrectly that Trump would not last this long.  <br/><br/>Like many of his fellow \"analysts\" and so-called \"pundits,\" Cohn suffers from a lack of understanding about what is driving the candidacies of political outsiders such as Trump and Carson in the GOP and Bernie Sanders in the Dem party.  <br/><br/>For years, a large number of GOP voters have been lulled into voting against their economic self-interest by (1) false claims that tax breaks for the rich would \"trickle down\" so that they benefited not just the rich but also the average wage earner, and (2) politicians' use of hot-button social issues to channel the voters' attention away from the fact that GOP elected officials have been helping the rich at the expense of everyone else.  Now, many of those GOP voters are starting to realize that the people they elected have not been working to advance their interests, and they are angry.  Trump is using that anger to fuel his campaign, and until \"analysts\" such as Cohn start to understand what underlies Trump's appeal, they will continue to get it wrong.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441808618", "commentID": 16035310, "userID": 60095946, "recommendations": 96, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035310}, {"approveDate": "1441809089", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809365", "permID": "16035367", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sarasota", "parentID": null, "userDisplayName": "Jack McDonald", "commentTitle": "<br/>", "commentBody": "For me, this always and still boils down to whether or not I can imagine this candidate (or any other) with their finger on the \"button.\" For the life of me I cannot see Trump with all his bluster in this role. He is his own worst enemy. This country and the world need proper TONE and CONTENT in domestic and foreign discourse. Trump lacks both in spades.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441808923", "commentID": 16035367, "userID": 44641837, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035367}, {"approveDate": "1441810008", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809399", "permID": "16035469", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "UptownDowntown", "parentID": null, "userDisplayName": "hillbillynharlem", "commentTitle": "<br/>", "commentBody": "The most appealing feature of Mr. Trump's candidacy is poking his finger in the eye of the elites.  As a bona fide 'elite' he has the credibility to poke.  He may not get the nomination but he has been  dynamic' force majeur' in the formative year before the election.  Keep turning the screws on the phonies Mr. Trump!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6589/8372/cropped-65898372.jpg?0.07614473556168377", "createDate": "1441809512", "commentID": 16035469, "userID": 65898372, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035469}, {"approveDate": "1441810069", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809390", "permID": "16035587", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fauquier County, VA", "parentID": null, "userDisplayName": "Thin Edge Of The Wedge", "commentTitle": "<br/>", "commentBody": "I'd be interested in an analysis of Trump's supporters. How many are registered Republicans, Democrats or Independents. How many have a record of voting in primaries and the November elections as opposed to those who rarely or never vote? How many are solely interested in Trump and will drop out and not vote if he doesn't get the nomination, as opposed who will vote for another nominee in lieu of Trump? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441810054", "commentID": 16035587, "userID": 68057259, "recommendations": 23, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16035587}, {"approveDate": "1441812548", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809415", "permID": "16036125", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Asheville, N.C.", "parentID": null, "userDisplayName": "DOUG TERRY", "commentTitle": "<br/>", "commentBody": "<br/>The ruling elites in the Republican party have been in steady decline for about two generations, at least. If the old line, New England WASPs were in charge, Jeb Bush would have a cake walk to the nomination.<br/><br/>To understand the potentials for 2016, we have to ask ourselves: what's different this time? Political pundits and roving journalists are always great at predicting...the past. Most such commentaries should start with this: \"If the pattern holds...\"<br/><br/>In their agitation for political purity, in their energetic creation of propaganda outlets on radio, television and the Internet, in their unending denouncing of everything government, the Republicans have created a deep dilemma for themselves. The rabble in the countryside are tired of establishment candidates, tired of the sons of old wealth getting the nomination and bone tired of what they see as the continuing betrayal of \"conservative principles\", such as when G.W. Bush and the Republicans in Congress spent tax money like drunken Democrats to try to hold on to power. Those Republicans will support the new Bush marginally, holding their noses, but they want someone else. This is a big reason that an insurgent, non-establishment candidate has a huge chance next year.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6545/5323/cropped-65455323.jpg", "createDate": "1441812525", "commentID": 16036125, "userID": 65455323, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16036125}, {"approveDate": "1441812707", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809107", "permID": "16036007", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Smithtown, NY", "parentID": null, "userDisplayName": "David H. Eisenberg", "commentTitle": "<br/>", "commentBody": "Donald Trump is fun and often refreshing, and he does sometimes tell the truth about things that most politicians will not. But, do you really think the Bible is his favorite book? Or that he had investigators in Hawaii proving the birth certificate is a forgery? Or were those lies. He seems so insecure he can't bear the thought that anyone might not think him nice or smart or wrong about anything. Do we need someone who will try to spin the worst mistakes of his administration as victories? He even spins four bankruptcies as victories, demonizes those who invested in his companies and writes off their loss as his victory. How is anyone who thinks bankruptcy is something to crow about someone we should do business with or elect to office? Remember his crack about McCain - he (Trump) likes the people who weren't captured? Well, shouldn't he apply that to his bankruptcies too?<br/><br/>But I wouldn't likely vote for him (although there are few candidates I would likely vote for right now and the opponent does matter). And, though most every prediction about him has fallen short, I still think there will come a time when Republicans will ask if he can win a general election. And at some point, people will start to cringe when asked about anything, he will say how smart or nice or competent he is - or that he will be best. It will be - is old. <br/><br/>We haven't elected a president based on experience, character and competence since the 1990s and we shouldn't make the same mistake again.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5118/5127/cropped-51185127.jpg?0.06334015138636656", "createDate": "1441811955", "commentID": 16036007, "userID": 51185127, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16036007}, {"approveDate": "1441812715", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441809115", "permID": "16036042", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westchester", "parentID": null, "userDisplayName": "Westchester Mom", "commentTitle": "<br/>", "commentBody": "As a die hard life long democrat who will probably vote the democrat ticket right across the board - Donald Trump has captured my attention.  Taxing all income as ordinary income and universal healthcare are huge issues for me.  I want them and if Donald can deliver I may consider<br/><br/>but here's the deal....I think Donald has a deal with Ted Cruz and if Cruz is his choice for VP then it is same old, same old and nothing will get done.  he can't choose Fiorina....because she is a failure.  The good doctor Carson is a loon on politics and Rubio is almost as bad as Cruz....  so unless Donald chooses Lizzie Warren I don't see someone like me supporting his candidacy<br/><br/>Trump did what we needed him to do which is shake it up and let the moneyed class know the party is over and they have to pay their fair share<br/>for that I am thankful.  <br/><br/>Be careful of the of immigrant thing....Donald will toss the poor ones but may allow thousands more H1B's in the door which will compete with the rest of us....the rhetoric on immigration sounds like he will clean it up but mark my words....it will be much harder for your kid to get into college and get a job after he floods us with foreign legal workers", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441812080", "commentID": 16036042, "userID": 64397379, "recommendations": 26, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16036042}, {"approveDate": "1441817437", "commentType": "comment", "userTitle": "NULL", "updateDate": "1441813837", "permID": "16036933", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "christv1", "commentTitle": "<br/>", "commentBody": "Using Mr. Cohn's analysis we are going to have a Clinton/ Bush campaign, but who knows, Clinton's having problems and all the establishment candidates in the Republican party are in single digits. It's going to be interesting.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1441816689", "commentID": 16036933, "userID": 59659944, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16036933}], "totalEditorsSelectionReturned": 13, "replyLimit": 3, "totalRecommendationsReturned": 13, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 336, "api_timestamp": "1488822420", "totalReplyCommentsFound": 116, "totalCommentsReturned": 13, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}