{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 12, "totalParentCommentsFound": 183, "totalEditorsSelectionFound": 12, "depthLimit": 0, "totalRecommendationsFound": 235, "comments": [{"approveDate": "1445076561", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445096071", "permID": "16393471", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "The editors’ argument is excessive, and based on inaccurate premises.<br/><br/>What attracts Republicans (and some Democrats) to the notion that sanctuary cities are bad isn’t that we believe that “all unauthorized immigrants are dangerous criminals who must be subdued by extraordinary means”. It’s that we believe that the illegal aliens protected in these sanctuaries don’t belong here because they broke our laws to enter and remain. We reject this curious notion on the left of the propriety of osmotic movements of people across frontiers to seek some kind of economic balance across continents. We attach value to our culture, and see a threat to allowing in unmanageable numbers from other cultures and eventually allowing them to vote based on values that haven’t yet been assimilated.<br/><br/>The sanctuary city movement clearly is maintained by people who wish to open our borders to all comers, in any numbers. We simply disagree. If progressives want to change the practical effect of that disagreement in legislatures, then the solution is simple: grow more progressives. But you’re having a serious problem doing that, aren’t you?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1445051047", "commentID": 16393471, "userID": 47123844, "recommendations": 216, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16393471}, {"approveDate": "1445076604", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445108954", "permID": "16393510", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles", "parentID": null, "userDisplayName": "vardogrr", "commentTitle": "<br/>", "commentBody": "Very quietly, I've always been just a little proud of the fact that when good things happen in peoples lives, it is often right here in California that it happens first.<br/><br/>Banks began opening accounts for anyone who wanted one several years ago. Almost anything could be used for ID so people could start cashing their paychecks and saving. Then they allowed people to buy houses and cars without proving they were citizens. Thankfully our state government stepped in and gave everyone photo ID's and drivers licenses.<br/>Seems we're ahead of the curve here on immigration and polar opposite of of some states. <br/><br/>Someone might even say California is a sanctuary state. I believe we are all much better for it.    ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6810/7407/cropped-68107407.jpg", "createDate": "1445051690", "commentID": 16393510, "userID": 68107407, "recommendations": 106, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16393510}, {"approveDate": "1445081083", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445096204", "permID": "16393757", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "I share the goals of the sanctuary movement, but the  methods are deeply troubling.  There is no question that immigration policy falls within federal jurisdiction.  If this defiance of federal authority gains acceptance, on what grounds would anyone be able to challenge states that  decided to ignore the SC ruling on same sex marriage or imitated Arizona and enacted a state immigration law harsher than the policy of the federal government?<br/><br/>At its heart, this defiance of federal jurisdiction with respect to immigration resembles the nullification movement of the early 19th century.  John C. Calhoun and the state government of South Carolina, anxious preserve slavery against any federal interference, developed the theory that states had the authority to reject enforcement of federal laws they considered in violation of the Constitution.  San Francisco and other cities are not claiming the legal right to defy federal authority, but in practice that is what they are doing. <br/><br/>The impasse over immigration reform has created a tragic dilemma for illegal immigrants and their supporters.  But that dilemma cannot be resolved through actions that threaten the legitimate authority of the federal government and potentially create precedents that groups with very different agendas might use.  Tea partiers already seek to weaken federal power; they should not receive any aid and comfort from liberals.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445055694", "commentID": 16393757, "userID": 63418614, "recommendations": 55, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16393757}, {"approveDate": "1445085189", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445081589", "permID": "16394959", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mount Laurel, New Jersey", "parentID": null, "userDisplayName": "Mark Jeffery Koch", "commentTitle": "<br/>", "commentBody": "No other country in the world has allowed millions of illegal immigrants to come to their shores, get free medical care and obtain a License to drive a car except America.  No other superpower has a problem managing its borders.<br/><br/>While it is true that the overwhelming majority of illegal immigrants come to America and do not violate our laws, and that they are hard working and willing to do the work most American do not want to do, by doing nothing about the problem more millions are streaming in.  <br/><br/>The construction industry has been harmed severely because immigrants from Mexico who crossed the border illegally are being paid much less than what American construction workers are being paid and costing them their jobs.  <br/><br/>I have friends that cannot afford their health care premiums but yet someone from Mexico can come here illegally and not have to worry about obtaining free medical care.  I have friends in the construction industry who were making $35 an hour who lost their jobs to illegal immigrants that companies were paying $10 or less an hour to.<br/><br/>Not every person who expresses concerns about millions of people being in our country illegally is a racist.  It is a valid concern all Americans should share.  My grandparents came here in the 1900's fleeing persecution and anti semitism. All they had when they arrived was the clothes on their back. They came legally, thru Ellis Island.  We must protect our borders.  That's not racist.  It's what every other nation does.   ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4570/4949/cropped-45704949.jpg?10938143571000008760", "createDate": "1445083814", "commentID": 16394959, "userID": 45704949, "recommendations": 240, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16394959}, {"approveDate": "1445085843", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445082243", "permID": "16395095", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Thompson", "parentID": null, "userDisplayName": "Karl", "commentTitle": "<br/>", "commentBody": "\"These laws are a false fix for a concocted problem.\"<br/><br/>I agree, these proposed laws are probably a false fix, but illegal immigration is hardly a \"concocted\" problem.<br/><br/>We will never send all the immigrants that are in the US illegal back to their home countries (nor should we or could we [too costly and resource draining]). But we should fine them, make sure their taxes are paid and put them on a path to some sort of legal status as perhaps guest workers.<br/><br/>That is not amnesty. That is a punishment. The degree of punishment (size of fine, waiting period) is up for discussion.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445084899", "commentID": 16395095, "userID": 54535333, "recommendations": 67, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395095}, {"approveDate": "1445093574", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445089974", "permID": "16395460", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "phoenix", "parentID": null, "userDisplayName": "steve", "commentTitle": "n/a", "commentBody": "This editorial is virtually filled with inaccuracies. The first of which is to say that sanctuary cities have policies to prevent \"unjust deportation\". It is against the law to enter this country illegally and therefore proper that illegal immigrants are deported.<br/><br/>And then without any proof it is stated that sanctuary cities do not encourage illegal aliens to seek those cities out. The true slender here is to say that the illegal immigrant community along with its supporters don't understand that in fact sanctuary cities are a first choice among illegal aliens.<br/><br/>Let the editorial board state clearly what they mean here which is they approve of open borders without restrictions because that is the result of the policies they support. <br/><br/>To say that we in fact need more sanctuary cities makes clear that the editorial board in fact approves of what is now correctly called illegal immigration. Increasing the number of sanctuary cities will increase illegal immigration which should be obvious to everyone except those who are little affected by the consequences", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445088339", "commentID": 16395460, "userID": 58998585, "recommendations": 100, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395460}, {"approveDate": "1445093927", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445090327", "permID": "16395386", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Albany", "parentID": null, "userDisplayName": "lgalb", "commentTitle": "<br/>", "commentBody": "The notion of proportionality is missing from the whole illegal immigration and sanctuary city debates.<br/><br/>If a person is charged with a minor offense (e.g. speeding, J-walking, ...) it's a silly waste of time to investigate whether the person is a legal immigrant.  On the other hand, someone charged with assault or other major crimes definitely should have his/her legal immigrant status checked.  <br/><br/>All too often, partisans prefer to reduce things to polar opposites -- investigate/deport everyone vs. investigate/deport no one -- when common sense lies in the middle.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445087654", "commentID": 16395386, "userID": 20823, "recommendations": 43, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395386}, {"approveDate": "1445093957", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445108937", "permID": "16395784", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Massachusetts", "parentID": null, "userDisplayName": "Iris", "commentTitle": "<br/>", "commentBody": "Thank you. Federal immigration law unjustly and absurdly calls people criminals simply for moving across a border. Such a law is unworthy of obedience or respect and should be repealed, but with Congress too dysfunctional to do the right thing and legions of bigots seeking to harm immigrants for no good reason, it falls to sensible people in state and local government to mitigate the harm of this horrifying policy. I firmly believe that our current immigration policy will be remembered as one of the great moral travesties committed by this nation, and those who resisted this injustice will be remembered as heroes.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445091235", "commentID": 16395784, "userID": 63522413, "recommendations": 22, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395784}, {"approveDate": "1445101999", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445098399", "permID": "16394095", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Adele", "commentTitle": "<br/>", "commentBody": "\"...protect unauthorized immigrants from unjust deportation.\"  This sentence doesn't even make sense.  If they are unauthorized immigrants, then deportation can't be unjust.<br/><br/>I don't blame immigrants for trying to get to a first world country any way they can.  I would do it too.  However, if you are running a first world country, you need laws, quotas and mechanisms to decide which immigrants come in when so that you can be sure your country can support them.  This is not rocket science and it's not a personal attack on illegal immigrants.<br/><br/>When you let a bunch of illegal immigrants stay, keep in mind they are taking the place of legal immigrants who have been playing by the rules in trying to get in.  Although at this point it's probably more feasible to keep the estimated 10 million immigrants in the US to deport them all, that doesn't mean that it should be policy going forward that immigration laws should be ignored.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445064159", "commentID": 16394095, "userID": 17018839, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16394095}, {"approveDate": "1445102061", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445098461", "permID": "16394164", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "D K", "commentTitle": "n/a", "commentBody": "Whether it's Mayor Ed Lee of San Francisco or County Clerk Kim Davis of Kentucky, government officials must obey the prevailing laws of the broader nation. Without that, we are not a nation of laws but merely a nation of opinions.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445066377", "commentID": 16394164, "userID": 27138140, "recommendations": 71, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16394164}, {"approveDate": "1445108443", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445266330", "permID": "16395055", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Sequel", "commentTitle": "<br/>", "commentBody": "The Republicans win whether they succeed or fail in passing this bill.  The conspiracy myth of sanctuary cities, like that of birtherism and trutherism, keeps their base alive and well,  alternating between fear and anger.  <br/><br/>The base already knows that foreigners are bad, and that undocumented aliens are evil  -- not to mention that the President is one of them -- so their leadership needs a steady flow of new strategies to keep the fear alive.  <br/><br/>Everyone else thinks they are nuts.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445084572", "commentID": 16395055, "userID": 46938652, "recommendations": 12, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395055}, {"approveDate": "1445110066", "commentType": "comment", "userTitle": "NULL", "updateDate": "1445106466", "permID": "16395196", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Rohit", "commentTitle": "<br/>", "commentBody": "Sanctuary cities are breaking the law.  So was Kim Davis.  Why was she persecuted verbally by you and the sanctuary cities are getting a pass? Then it becomes clear that it is not about the law, it is about your priorities.  When the law supports your priorities, you support the law.  When the law does not support your priorities then you celebrate disobedience.<br/><br/>This is all human nature. But the law is a compromise between different priorities and we have to obey those laws we don't like so that we can ask the others to obey the laws that they don't like.<br/><br/>If we don't then the law as codifying compromise will break down.<br/><br/>And no, I am neither a Christian nor a Republican.  But I do believe in fair play and also believe that even conservatives are entitled to fair play.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1445085764", "commentID": 16395196, "userID": 69181997, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16395196}], "totalEditorsSelectionReturned": 12, "replyLimit": 3, "totalRecommendationsReturned": 12, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 289, "api_timestamp": "1488822324", "totalReplyCommentsFound": 106, "totalCommentsReturned": 12, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}