{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 982, "totalEditorsSelectionFound": 40, "depthLimit": 0, "totalRecommendationsFound": 957, "comments": [{"approveDate": "1456886287", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456944752", "permID": "17753379", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 64, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Downtown Verona, NJ", "parentID": null, "userDisplayName": "Socrates", "commentTitle": "<br/>", "commentBody": "The Party of Jefferson Davis has spoken.<br/><br/>It wants to Make America Racist Again.<br/><br/>The Democratic nominee will have little trouble defeating Donald Trump and his John Birch Society voter base in November 2016.<br/><br/>Americans are crazy, but they are not crazy enough to elect Il Trumpolini as President of the United States of America....they are just not that crazy.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5187/8992/cropped-51878992.jpg?0.3028964879922569", "createDate": "1456886240", "commentID": 17753379, "userID": 51878992, "recommendations": 845, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753379}, {"approveDate": "1456892628", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456944632", "permID": "17753882", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 46, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "JoJo", "commentTitle": "<br/>", "commentBody": "This may offend some NY Times readers, but I find a certain like-ability in Trump.   Yes, he's extreme, and no, I wouldn't vote for him.  I think that would be irresponsible, but frankly, he's one of the few Republican candidates for President that don't fill me with revulsion.  At least he's not a picked/paid-off puppet of militaristic plutocrats.  He's speaks for himself (though that's because he has his own money).  He doesn't pander to hypocritical religion as much as the others do.  He's the rare Republican who's called GW Bush for the catastrophe that he was, and he was against the War in Iraq even before a lot of the liberals came around.  <br/><br/>But I think he's dangerous.  I see resemblances between him and the fascist populist dictator who becomes president in Sinclair Lewis's 1930s novel \"It Can't Happen Here\".  That should be compulsory reading for all American voters.  It CAN happen here, and maybe it is.    ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456890793", "commentID": 17753882, "userID": 62271411, "recommendations": 1258, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753882}, {"approveDate": "1456892760", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456944901", "permID": "17753925", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 29, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington DC", "parentID": null, "userDisplayName": "raven55", "commentTitle": "<br/>", "commentBody": "Lost in the shuffle of tonight's elections is the fact that in almost every single state, Republican voters outnumbered Democratic ones - sometimes by 30%. This might be passed off in the deep South as expected - but in Virginia, which went for Obama two times, GOP votes outnumbered Democratic ones by nearly 100,000.<br/><br/>The enthusiasm gap is real and it doesn't benefit Hillary. Democrats better figure out what makes disenfranchised, marginal voters think a bloviating billionaire actually has their interests at heart and counter that message with everything they have. You can pray Trump will finally get caught in his increasingly pathological lies, or you can take a long, hard look in the graveyard, roll up your sleeves and work like the dickens to elect Democrats at all levels.<br/><br/>Fasten your seats, ladies and gentlemen. It's going to be a very bumpy election.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1652/0164/cropped-16520164.jpg?0.11047445051372051", "createDate": "1456891102", "commentID": 17753925, "userID": 16520164, "recommendations": 1585, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753925}, {"approveDate": "1456892951", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456892951", "permID": "17753194", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hawaii", "parentID": null, "userDisplayName": "Donnel Nunes", "commentTitle": "<br/>", "commentBody": "Between Trump's chameleon like nature and the willingness of some to turn a blind eye for sake of party loyalty, I hope that Hilary and Bernie take this very seriously in the general election and don't come into the race acting like its already won.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456884739", "commentID": 17753194, "userID": 65293645, "recommendations": 501, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753194}, {"approveDate": "1456893127", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456893127", "permID": "17753199", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Julie W.", "commentTitle": "<br/>", "commentBody": "Republican leaders are reaping what they've sown.  For decades now they've catered to the worst impulses in their party.  They have successfully convinced their supporters that government is the root of all their problems.  They shouldn't be surprised now that these same people have turned to someone that they view as being outside the establishment.  The fact that this someone, Donald Trump, is a repugnant character that GOP leadership cannot control could be considered poetic justice if the consequences weren't so serious.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456884771", "commentID": 17753199, "userID": 46954653, "recommendations": 1021, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753199}, {"approveDate": "1456893330", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456893330", "permID": "17753217", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 24, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Belleville", "parentID": null, "userDisplayName": "Benjamin Greco", "commentTitle": "<br/>", "commentBody": "Often we misread the moment we are in, when we are in it, and I think we may be doing that now. Everyone is calling this a populist moment but it isn’t. I think we are, and have been for the last eight years, in the beginning of an era of reform. This is a Progressive moment. <br/><br/>Think about it Obama has pushed through reform in healthcare and banking, and although the left has complained that they don’t go far enough, they said the same thing about Social Security; they thought the Social Security Tax was too regressive. Additionally, what we have thought was successful obstruction by Republicans, may come to be seen as a harbinger of the fracturing of the party of Reagan and Goldwater. The Republicans are coming apart because although they have been able to block the President, they have not been able to come up with an alternative to his policies.<br/><br/>If the party nominates Trump and implodes in the fall, one of two things happens, either, Democrats will be in the ascendency again and for a long time while the Right remains split between moderates and radicals, or the Republicans will reconstitute themselves as a reform minded party willing to work with Hillary Clinton and Democrats. <br/><br/>Great Presidents get credit for things they didn’t necessarily intend, Lincoln and the end of Slavery and FDR and WWII. Likewise, President Obama, the bane of the Right, will go down in history as the President who crippled the Republican Party and ushered in a new age of reform.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456884891", "commentID": 17753217, "userID": 1099465, "recommendations": 870, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753217}, {"approveDate": "1456893569", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456893569", "permID": "17753295", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "paul", "commentTitle": "<br/>", "commentBody": "Trump's ascension is the fruit of seven years of hate filled demagogy by a GOP driven, yes, insane, by the ascension of an african american POTUS - the realization that the white electorate was effectively neutralized pushed hard line conservatives over the edge in their demonization and attempt to marginalize Obama even before his term began.  In the same way that Joe Mccarthy arose out of the GOP's desperation to halt the legacy of FDR and the New Deal, so too Trump is, the afterbirth of a political party which has thrown the US economy under the bus for the sake of regaining the executive branch, of hamstringing Obama every chance it could, to make him 'fail,' and failing to do so, their followers have turned to a braying malcontent who fans the flames of outright intolerance and hate and has now taken over their party.  So they reap what they have sown...", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456885426", "commentID": 17753295, "userID": 67028298, "recommendations": 1403, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753295}, {"approveDate": "1456893849", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456893849", "permID": "17753547", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new Jersey", "parentID": null, "userDisplayName": "Babel", "commentTitle": "<br/>", "commentBody": "The source of Donald Trump's strength is clear; rural areas with people who have less of an education and who are overwhelmingly white.  His recent reluctance to come out with a clear condemnation of Duke and the Klan plays well to exactly that group of voters.   From being the original birther, to categorizing Mexicans as rapists, to banning all Muslims from the U.S. his devious game of racial politics is clear to all that have eyes.  He is the candidate of the white bigot first and foremost.  And one wonders how any Party could be proud to have such a man be their Standard Bearer.  Beginning with Nixon Southern Strategy the Republican Party has been flirting with the dark arts now for decades and finally their Frankenstein creation has broken free and is out roaming the countryside.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456887607", "commentID": 17753547, "userID": 48307985, "recommendations": 994, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753547}, {"approveDate": "1456894007", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456894007", "permID": "17753575", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland OR", "parentID": null, "userDisplayName": "VicG", "commentTitle": "<br/>", "commentBody": "I would think the Democrats are being handed a gift in the name of Donald Trump. How anyone can take this man seriously is beyond my understanding, yet Americans in increasing numbers are supporting his candidacy. <br/><br/>What does this say about the state of politics in America that people are either 1. willing to overlook his nonsensical and often irrational positions or 2. actually support his dangerous ideas? Either proposition is too frightening to contemplate.<br/><br/>I appreciate the Times calling this fool out. I appreciate the Times calling the Republican party out. The Democrats should be dancing in the streets, but history has shown this party to be feckless and out maneuvered at every turn. I doubt another Clinton is the answer to America's political woes, but at least she's not Donald Trump and that may have to be enough.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456887895", "commentID": 17753575, "userID": 68549637, "recommendations": 467, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17753575}, {"approveDate": "1456895028", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456895028", "permID": "17754287", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 26, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "midwest", "parentID": null, "userDisplayName": "br", "commentTitle": "<br/>", "commentBody": "“This party does not prey on people’s prejudices. We appeal to their highest ideals. This is the party of Lincoln.”<br/><br/>How dare you, Mr. Ryan.<br/><br/>This is the party that preyed on fear of gay people to get out the evangelical vote by putting gay marriage measures on state ballots in the 1990s. This is the party that embraced Rush Limbaugh and all his demagoguery and hatred and divisiveness. This is the party that spat out the word \"liberal\" as if it was spelled with four letters. This is the party that gave us a president who preyed on fear of people in far-off lands, who took advantage of a national tragedy that should have led to our greatest hour, and sent us to war without end that has made this world a more dangerous place. This is the party that has presided while wealth in this nation has concentrated at the very top to a degree unprecedented in U.S. history--the Democrats certainly helped, sure, but the Republicans did nary a thing to stop it and, in fact, did everything possible to ensure it.<br/><br/>This is not the party of Lincoln, Mr. Ryan. Abraham Lincoln would be throwing fits and helping form a new party, just as the Whigs were replaced by Republicans so long ago, if he could see what the GOP has become. This is a party that has richly earned what is coming to it now.<br/><br/>Do not disgrace the name of Abraham Lincoln by claiming that the Republican Party of the 21st century is the party of the greatest president in U.S. history. We've had enough lies from the GOP. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456893752", "commentID": 17754287, "userID": 47650336, "recommendations": 2409, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754287}, {"approveDate": "1456895203", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456895203", "permID": "17754306", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, DC", "parentID": null, "userDisplayName": "Brooklyn", "commentTitle": "<br/>", "commentBody": "For the last 7 years, Donald Trump has been the loudest, most consistent voice in the room in the Birther Movement. GOP Leaders, with the sole exception of the now-marginalized John McCain, refused to publicly refute Trump's claims that President Obama was a Kenyan-born Muslim. It was oh-so-cute to stand back mutely and let Trump spew those hateful, racist lies. Trump could say what he wanted, no matter how dishonest, and the Republican leadership would wink and pretend that truth doesn't matter. After thus conditioning the GOP voters to sign on for hate, to believe Trump's lies, now they see a downside. <br/><br/>As I told my 12 year-old today when discussing the election: The truth matters, and you must always stand up for the truth, even when it works to your disadvantage. Too bad the GOP Establishment never had the character to say that to their members and their voters. What a pathetic example of \"leadership.\" Their duplicity has brought us Frontrunner Donald Trump.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456893880", "commentID": 17754306, "userID": 46055664, "recommendations": 1157, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754306}, {"approveDate": "1456898286", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456941369", "permID": "17754303", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "RD", "commentTitle": "<br/>", "commentBody": "I'm a moderate democrat and I like Trump. I've heard much petty vacuous arguments against the man in the media, but none that ring true. Fear mongering without substance. And the voters see it as well. Its just another reason how the media makes itself irrelevant by trying to influence people with posturing fantasies. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456893858", "commentID": 17754303, "userID": 65777021, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754303}, {"approveDate": "1456928525", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456928525", "permID": "17754419", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Minnesota", "parentID": null, "userDisplayName": "Ellen", "commentTitle": "<br/>", "commentBody": "Paul Ryan said, “This party does not prey on people’s prejudices. We appeal to their highest ideals.”  This is the lie he and other Republicans have been telling themselves.  But the more lies you’re willing to tell, and the more distant those lies are from reality and facts, the more difficult it is to distinguish between the outlandish fantasy world you’ve created in your own head and the reality that other people live in.  So much so that when someone like Trump comes along, it’s easy ignore and dismiss the threat because you’ve been creating your own version of reality for so long, you can no longer distinguish between the threats you've created out of whole cloth and the real ones.  <br/><br/>Ryan also said in a Sunday interview: “We need to take our principles, apply them to the problems of the day and show the American people that we have real solutions to their problems and that we are offering the country a very clear and compelling choice.” <br/><br/>Republicans have been defining the ‘problems of the day’ on their own terms--through fear-mongering, plain and simple.  Trump has hijacked their party and done so using tactics they first introduced to the political discourse—vitriol, lies, intolerance, intransigence, myopia, denial.  It couldn't have happened to a nicer party. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456894769", "commentID": 17754419, "userID": 26798888, "recommendations": 328, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754419}, {"approveDate": "1456928555", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456928555", "permID": "17754426", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle", "parentID": null, "userDisplayName": "Cynthia", "commentTitle": "<br/>", "commentBody": "The real question is, if elected, who will Trump be when he gets into office? The pro-choice, pro-universal healthcare pol who opposed the Iraq invasion, or the newly-minted ultraconservative who quotes the Bible and would scrap Obamacare? The fact is no one really knows who The Donald is. I guess that's the liar part. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456894817", "commentID": 17754426, "userID": 31406194, "recommendations": 137, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754426}, {"approveDate": "1456928692", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1456928692", "permID": "17753078:17754435", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "joc", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": 17753078, "userDisplayName": "Citixen", "commentTitle": "<br/>", "commentBody": "Its not THAT surprising.  When was the last time you ever heard a Republican admit their policies were wrong, or even just voice chagrin at the unintended (but patently predictable) consequences of some short-sighted policy?  That's what Trump represents to the GOP.  Back in the early naughts, Karl Rove devised a plan to commit essentially a silent coup of American government, by creating a national strategy to 'lock in' Republican control of local government, which got them control of many state governments, which got them the representatives to send to Congress, by gerrymandering districts into \"can't lose' elections.  Pack Democrats into a few big districts wherever possible, and spread Republicans into bunches of smaller safe-seat ones and...viola!  A minority party (check the numbers of total votes nationally in 2012 and 2014) gets to install itself as the majority party of Congress.  All legal, if unethical.  Because he could. Thanks to computers and the modern era of push-button redistricting, that can draw new maps in weeks instead of years when done by hand, like in the old days. Like Donald says, who likes a loser?  (Even if you're cheating the American public to win)  Certainly not the GOP.  Now their \"can't lose\" districts want the GOP to take a hike because they like Trump, not the standard GOP cutout. Once again: short-sighted policy (uncompetitive district elections) backfires in an entirely predictable manner.  The GOP deserves Trump.  He is the GOP incarnate.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456894868", "commentID": 17754435, "userID": 41105837, "recommendations": 230, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754435}, {"approveDate": "1456928773", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456928773", "permID": "17754482", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle", "parentID": null, "userDisplayName": "Osan", "commentTitle": "<br/>", "commentBody": "\"The Republicans seem to be reeling, unable or unwilling to comprehend that a shady, bombastic liar is hardening the image of their party as a symbol of intolerance and division.\"<br/><br/>The Republican party has been the party of shady bombastic liars for a good 30 years now.<br/>Anyone remember the shady bombastic liars by the name of George W. Bush and Dick Cheney who lied America into a war? How about that shady bombastic liar Newt Gingrich who pilloried Bill Clinton for indiscretions Newt was committing himself? The list of shady bombastic liars in the GOP is a long one.<br/><br/>No list of bombastic lying Republicans would be complete without mention of Ronald Wilson Reagan who proudly claimed we \"would not negotiate with terrorists\" while negotiating with Iran to arrange funding for right-wing terrorists in El Salvador.<br/><br/>The Republican party has been the party of lies, bigotry, hatred, braggadocio and arrogance for at least 30 years. Trump is all those things, while being honest. Trump is no liar, he really is an arrogant, bigoted, blowhard. It's about time they nominated a candidate who was honest about it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456895201", "commentID": 17754482, "userID": 71108717, "recommendations": 296, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754482}, {"approveDate": "1456928932", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456928932", "permID": "17754511", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Colorado", "parentID": null, "userDisplayName": "Kay Johnson", "commentTitle": "<br/>", "commentBody": "Trump's message : \"Make America Hate Again\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456895391", "commentID": 17754511, "userID": 40249616, "recommendations": 163, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754511}, {"approveDate": "1456929207", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456929207", "permID": "17754652", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charlotte, NC", "parentID": null, "userDisplayName": "slim1921", "commentTitle": "<br/>", "commentBody": "I was, unfortunately, listening to NPR broadcast the victory speech of Ted Cruz. What a bombastic piece of drivel.<br/><br/>But he started out quoting two former Presidents who inspired Americans to be their best and to be brave against adversity. Guess who they were:<br/><br/>Reagan and Hoover?  Nope<br/>GHW Bush and Eisenhower? Nope<br/><br/>They were two of the Democrats most liberal leaders:<br/><br/>FDR (\"We have nothing to fear but fear itself\") and John Kennedy (\"Ask not what your country can do for you...\")<br/><br/>I was flabbergasted.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6684/0187/cropped-66840187.jpg?19351244681642355663", "createDate": "1456896297", "commentID": 17754652, "userID": 66840187, "recommendations": 244, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17754652}, {"approveDate": "1456930399", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456930399", "permID": "17755269", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cleveland", "parentID": null, "userDisplayName": "sdw", "commentTitle": "<br/>", "commentBody": "Republicans have tried to stop Donald Trump by playing his game of lies and insults and appeals to bigotry and fear. The results of Super Tuesday make it clear that if Republicans play Trump’s game by his rules, the Republicans will lose. It will not even be close.<br/><br/>The Republican Party cannot survive Donald Trump unless they either surrender to him and let the G.O.P. become the P.O.T. (Party of Trump) or they beat him by rising above Trump’s gutter.<br/><br/>Republicans must either recruit a new candidate from a limited number of nationally known Republicans or the G.O.P. must create a star-studded, but trusted, Truth Squad to fill the airways with infomercials and live television events. They will also need to dog Trump’s campaign trail.<br/><br/>It may be too late, but serious Republicans ought to try. Meanwhile, Democrats should resist the impulse of celebrating Trump’s rise.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456900579", "commentID": 17755269, "userID": 56679104, "recommendations": 45, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17755269}, {"approveDate": "1456931247", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456931247", "permID": "17755719", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta, GA", "parentID": null, "userDisplayName": "politicsandamericanpie", "commentTitle": "<br/>", "commentBody": "While I don't necessarily believe in all the issues Evangelicals believe, I support their rights to believe as they do. What I don't understand is how Evangelical Christians can vote for a thrice married adulterer, with one child born out of wedlock, a racist, misogynist reality tv star who owns/owned strip clubs and casinos and building that hired illegal workers. Someone who lies, demeans, insults and panders to our lowest common demoninator? Do we put all this aside because someone says he'll close the border to \"make America great again\"?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4788/8919/cropped-47888919.jpg?0.42089872371618103", "createDate": "1456905276", "commentID": 17755719, "userID": 47888919, "recommendations": 194, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17755719}, {"approveDate": "1456931943", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456931943", "permID": "17755909", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NorCal", "parentID": null, "userDisplayName": "Snarkk", "commentTitle": "<br/>", "commentBody": "Paul Ryan's comments about the GOP still being \"the party of Lincoln\" were ludicrously vacant of truth in the face of Trump's wins.  The GOP must decide if it wants to be now known as the party of hate...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456908663", "commentID": 17755909, "userID": 65314499, "recommendations": 98, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17755909}, {"approveDate": "1456932052", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456932052", "permID": "17755965", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Honolulu", "parentID": null, "userDisplayName": "CMK", "commentTitle": "<br/>", "commentBody": "“This party does not prey on people’s prejudices. We appeal to their highest ideals. This is the party of Lincoln.” Really, Mr. Ryan. How do you explain trying to make Mr. Obama a one term president? Shutting down the Federal Government? Voting to repeal ACA, what, 60 times? Holding up the Supreme Court nomination? Mexicans with calves the size of cantaloupes? Welfare queens? De-funding Planned Parenthood? Vaginal probes? Fox network? Bill O'Reilly? Sean Hannity? Karl Rove? Calling the president a liar? <br/><br/>I think a little introspection, a little self-analysis, a little critical review is in order Mr. Ryan.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456909507", "commentID": 17755965, "userID": 20117241, "recommendations": 294, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17755965}, {"approveDate": "1456933081", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456933081", "permID": "17756466", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tampa", "parentID": null, "userDisplayName": "Kent", "commentTitle": "<br/>", "commentBody": "'Detailed, dispassionate and smart debate', really??  People are not dispassionate, we are not rational beings we are emotional.  Trump is winning the Republican primary and has a real chance at the presidency because people feel he is authentic.  Whether he is or not does not matter, his supporters feel he is.  Look back at our last three presidents, they each won their first terms because they connected emotionally with people; Clinton made people feel as he was talking directly to the, made them feel special; Bush was the guy you wanted to have a beer with, he was friendly and inviting; Obama filled us with hope.  Now Trump connects with the disillusionment  people have in their government.  Republicans have been sold a bill of goods for three decades by the elite that could care less about them and only want to line their pockets.  The Democrats are going down this same path and the Clintons epitomizes the greed in politics and business.  Trump and Bernie feel real; Hillary, Rubio and Cruz feel fake.  it does not matter what the pundits and elites think the reality should be; the reality is people are craving someone or something that feels real and not another packaged, made-up, hyped, over marketed facade of a candidate who only cares about maintaining the status quo because that is what they are bought and paid for to do.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456916939", "commentID": 17756466, "userID": 64937020, "recommendations": 62, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17756466}, {"approveDate": "1456934045", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456934045", "permID": "17756773", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Rae", "commentTitle": "n/a", "commentBody": "Shady, bombastic liar?  Surely you're aware that this is what Hillary's detractors say about HER?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456919238", "commentID": 17756773, "userID": 46936593, "recommendations": 42, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17756773}, {"approveDate": "1456938860", "commentType": "comment", "userTitle": "NULL", "updateDate": "1456938860", "permID": "17758381", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Austin, TX", "parentID": null, "userDisplayName": "Robert", "commentTitle": "<br/>", "commentBody": "What Republicans fail to see is that Donald Trump is just the logical extension of the direction they have been going in since Ronald Reagan's presidency, the result of a philosophy lacking compassion and untied to factual information that attracted the large number of voters who feel disenfranchised and angry.  It is a dangerous recipe because the victims are blamed rather than the perpetrators.  If these voters had a better grasp what was happening to them, they would be following Bernie Sanders.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1456926692", "commentID": 17758381, "userID": 28013163, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17758381}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1565, "api_timestamp": "1488822367", "totalReplyCommentsFound": 583, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}