{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 23, "totalParentCommentsFound": 373, "totalEditorsSelectionFound": 27, "depthLimit": 0, "totalRecommendationsFound": 380, "comments": [{"approveDate": "1476880270", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476889111", "permID": "20183694", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 51, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "The left’s solution to every problem is higher taxes – and regardless of the fiction that SS is a self-funding retirement program, it never was that: it was always a poverty relief program intended for those not impoverished to be a minimal addition to private savings. The left sees it as a means to lift the elderly population into middle class sufficiency regardless of the cost and regardless of contributions to it by beneficiaries over a lifetime – SS “contributions” are really a tax, but one of the very few left that is not steeply progressive, because the only reason it passed originally was that it wasn’t SUPPOSED to be a tax.<br/><br/>Should Sec. Clinton win, don’t expect Republicans to support her policies for SS, because we don’t support the socialist objective. However, as we approach 2034 and insolvency, the dependency created is such that we’ll need to do something, and when that happens lifting the cap probably will happen. However, I’d hope that we’d be sensible enough then to fix the problem by requiring that people set up REAL retirement accounts that are invested in REAL income-producing instruments instead of T-bills that merely require higher taxes on generations unborn to redeem.<br/><br/>The TOTALITY of what we take from our people to sustain much of our population on some form of dole already is enough to destroy our infrastructure, our education and our ability to invest in basic research. And here we have the editors of the NY Times flogging the taking of MORE.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1476880224", "commentID": 20183694, "userID": 47123844, "recommendations": 47, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183694}, {"approveDate": "1476880893", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476877293", "permID": "20182371", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Michael", "commentTitle": "<br/>", "commentBody": "My parents retired from blue-collar careers in 1980. My father never made more than $25,000 per year as a truck driver. My mother made much less than that as a stenographer. They moved from Queens to South Florida and bought a no frills co-op with their modest life savings. The sole source of funding for the remainder of their lives was Social Security and they lived a decent existence. <br/><br/>I now qualify for Social Security and the SSA is telling me the amount I would receive that is numbing.  If I chose to file for Social Security and not rely on other sources, I would not have enough to live in a shanty on the side of I-95. When the Federal Reserve aims for an annual 2% inflation rate and Social Security barely receives Congressional increases, then the largest portion of our population entering senior citizen status, the Baby Boomers, will live a lower quality of life than preceding generations. Yesterday, the Federal government announced that next year Social Security will receive a cost of living increase of .03% or $4 more per month for the average recipient. $4? Thanks Congress, I will spend it all in one place! Since your retirement program is not part of Social Security, you feel no need to work for the average American because you have retirement benefits that most Americans would salivate for. Congress calls Social Security an entitlement program. If that is the case, give me back what I paid in over the past 36 years because I an ENTITLED to my money.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476874059", "commentID": 20182371, "userID": 72673510, "recommendations": 339, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182371}, {"approveDate": "1476880980", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476877380", "permID": "20183486", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Albuquerque, NM", "parentID": null, "userDisplayName": "Toby Finnegan", "commentTitle": "<br/>", "commentBody": "After Election Day in 2004, a triumphant George W. Bush declared that he had won \"political capital\" by his victory and that he \"intended to spend it.\"  After his inauguration in January 2005, he proceeded to campaign to create \"private accounts\" for Social Security.  His efforts had the support of leading media enterprises, including the Washington Post.  Fortunately, most Americans, including Republicans, the more they heard about Bush's campaign, the less they liked it; some GOP members of Congress even avoided Bush when he came to their districts to campaign for his program.  Essentially, its aim was to privatize Social Security.  Wall Street, meanwhile, was licking its chops expecting Bush's campaign to succeed; can you imagine if Bush had succeeded, what would have happened to all those \"private accounts\" in the crash of 2008?  <br/><br/>To this day, it remains a goal of the high command of the GOP to privatize Social Security, the most successful and secure of the Federal Government programs.  They never reveal this, lest they alienate even their base, but that is their intention.  The GOP is run by ideologues, including Paul Ryan, for whom anything that is government run is essentially evil.  So they will continue to pick away at Social Security, alarming us with its impending demise, when in fact it is doing quite well and only small adjustments are necessary to keep it running forever.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476879415", "commentID": 20183486, "userID": 17099383, "recommendations": 384, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183486}, {"approveDate": "1476885334", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476881734", "permID": "20183898", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": ".", "parentID": null, "userDisplayName": "Rebecca Rabinowitz", "commentTitle": "<br/>", "commentBody": "I see no reason why there should be any ceiling on Social Security earnings - why should someone with a multi-million dollar annual salary be permitted to skate by having paid taxes only on $250K, as per HRC's proposal?  What is not mentioned in this analysis, additionally, is that women are disproportionately reliant upon Social Security in their senior years, because of lower wages for their work, the disappearance of Defined Benefit pension plans in favor of Defined Contribution plans instead (which rely primarily upon workers being able to set aside retirement funds, though some companies provide a match), women who take time off to raise children or later in life, to serve as caregivers for aging parents, etc.  Sadly, many major issues have been left off the debate stage, including global climate change, our failing infrastructure, public education, the Voting Rights Act, etc., and once again, the 4th Estate has failed the nation.  I have little faith in Chris Wallace, who has already said, shockingly, that it is \"not his job\" to \"fact check\" the candidates, and given his right wing leanings, he is unlikely to address any of the other major issues we confront as a nation, either. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476880909", "commentID": 20183898, "userID": 17050169, "recommendations": 177, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183898}, {"approveDate": "1476885474", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476881874", "permID": "20184157", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NH", "parentID": null, "userDisplayName": "Mary Feral", "commentTitle": "<br/>", "commentBody": "No doubt about it--I'm in trouble.  Here's why.  I started working at age 16, part time, of course.  I graduated from college, one of the ivy's, with good reports.  Then I decided to be a teacher because I knew that good education for others has a profound effect on the lives of those others, their whole lives, I mean.<br/>Thus, I graduated from an education program at UCAL Berkeley and paid my way.<br/><br/>But my first salary teaching  was automatically 20% lower than a male's.  That, of course was a blow to my soc. sec. future.  By the '70's, that prob. was solved but that's when I quit teaching to bear chlldren and not work again until they entered first grade.  Blow #2 to my soc. sec future.  Why didn't I invest surplus $ personally?  There wasn't any because my husband \"dropped out\" of the family and no alimony was available.  Blow #3 to my financial future. <br/><br/> I realized the danger and did not retire until age 80 (this year.)  But the cupboard is nearly bare.<br/><br/>I'm not whining.  I'm better off than many, many women but times are tough for<br/>us. We, especially women, will be grievously hurt if soc. sec., instead of becoming more robust, fails.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476881675", "commentID": 20184157, "userID": 22628351, "recommendations": 263, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20184157}, {"approveDate": "1476885669", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476882069", "permID": "20185333", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 12, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MD", "parentID": null, "userDisplayName": "Taxpayer10203", "commentTitle": "n/a", "commentBody": "I disagree with most comments here. Social Security is not a retirement program but a poverty reduction program based on an individual 's contribution during work years.What he/she saves and  invests during work years &amp; private pension is the retirement to live on &amp; SS is a Subsidy for those who failed to  plan ahead successfully.<br/>The average retiree gets an annual subsidy of $5,000 towards his/her Medicare expenses. The retiree part of our society are the most affluent  age group due to government largess.  I think we should limit this unfair inter generation transfer of wealth at its present level otherwise younger people will become effectively serfs for the comfort of the elderly. Not to mention that government starves  the parts of expenditure that indirectly affect the economic &amp; social welfare of younger population ( infrastructure, education, research etc). Food for thought.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476885511", "commentID": 20185333, "userID": 62499968, "recommendations": 15, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20185333}, {"approveDate": "1476885720", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476882120", "permID": "20184193", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": 18977, "parentID": null, "userDisplayName": "Frank Walker", "commentTitle": "<br/>", "commentBody": "Social Security is relatively easy to fix. If we don't decrease healthcare costs, it will bankrupt us. We can not go on spending twice as much as other western countries on healthcare. We're ranked somewhere around 37th in the world for healthcare results. We seldom learn from other countries but occasionally we compare ourselves to Canada, ranked around 33rd. If we don't fix both social security and healthcare, we will destroy the middle class and then how will the top 0.1% survive and prosper?<br/>Many other countries addressed the challenges of demographics, automation, etc. years ago and have made great progress, while we go on obstructing progress and seem incapable of change. We helped invent the modern middle class but it is looking increasing fragile in our Lobbyocracy. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476881772", "commentID": 20184193, "userID": 70481854, "recommendations": 88, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20184193}, {"approveDate": "1476885951", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476882351", "permID": "20183365", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MA", "parentID": null, "userDisplayName": "LSR", "commentTitle": "<br/>", "commentBody": "Another reason for not increasing the retirement age is that it's very hard to find a job after age 60 despite anti-discrimination laws. I would like to see the age rolled back to 65. <br/><br/>I would also eliminate the requirement that contractors pay  into social security twice the amount that employed people pay. And I would eliminate social security payments entirely for people who's incomes are so low they would otherwise pay no taxes.<br/><br/>I would pay for the above by eliminating the cap entirely. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476878954", "commentID": 20183365, "userID": 26421706, "recommendations": 57, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183365}, {"approveDate": "1476886085", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476882485", "permID": "20182480", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Minneapolis", "parentID": null, "userDisplayName": "Ben", "commentTitle": "<br/>", "commentBody": "I would prefer a donut policy for premiums. The salary limit should continue to stand at $115k. Incomes over $500K should be taxed at the same rate as incomes under $115K are taxed for SS tax. There should be no limit at the top at which tax should stop. The new benefit formula should ensure those above 55 are not affected. But we must do something to shore up Social security. Hopefully the election will result in electing those candidates who want to do something other than just obstruct.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476874722", "commentID": 20182480, "userID": 23845658, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182480}, {"approveDate": "1476886318", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476882718", "permID": "20182381", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Greer, South Carolina", "parentID": null, "userDisplayName": "PJR", "commentTitle": "n/a", "commentBody": "I have been paying into social security for over 40 years and as i near retirement expect the promised benefit to be there.  I do not expect a reduction in benefit nor do I expect an increase in age to be eligible. The wage ceiling must be raised.  It should have been indexed to begin with.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476874091", "commentID": 20182381, "userID": 57899401, "recommendations": 167, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182381}, {"approveDate": "1476889383", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476885783", "permID": "20182199", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rye, NY", "parentID": null, "userDisplayName": "Meighan Corbett", "commentTitle": "<br/>", "commentBody": "Raising the ceiling on the wages taxed, currently $118,500 is the only sensible way to shore up the system. Most people make less than that anyway so the \"tax\" is regressive. Of course, they are the ones who most rely on SS in retirement so it's a forced form of saving. Raising the retirement age to 67 is cruel unless you lower the age at which people can get medicare. Say that was 64, more people would retire, and that would probably get more younger folk moving up the ladder. Please we need a bigger safety net. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476872973", "commentID": 20182199, "userID": 61025795, "recommendations": 60, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182199}, {"approveDate": "1476889571", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476885971", "permID": "20182202", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "boston, MA", "parentID": null, "userDisplayName": "Maureen", "commentTitle": "<br/>", "commentBody": "We are the same nation that largely eliminated private sector pensions.  Privatizing social security is anathema to the concept of \"some measure of protection to the average citizen and his family against loss of a job and poverty ridden old age.\"  FDR meant all should contribute. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476873000", "commentID": 20182202, "userID": 58708487, "recommendations": 96, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182202}, {"approveDate": "1476889894", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476886294", "permID": "20182454", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Deirdre Diamint", "commentTitle": "<br/>", "commentBody": "Social Security is the main source of income for a majority of Americans.  <br/><br/>Please raise the cap and tax all income as ordinary income for Medicare too<br/><br/>Go a bit farther and tax income above the cap at 2% and you will have a solid system<br/><br/>Done", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476874563", "commentID": 20182454, "userID": 64397379, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20182454}, {"approveDate": "1476891223", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476887623", "permID": "20183118", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Honolulu, HI", "parentID": null, "userDisplayName": "Swannie", "commentTitle": "<br/>", "commentBody": "I have not forgotten that it was just before the financial wizards drove the US economy into the ditch in 2008 that the politicians were trying so very hard to \"privatize\" the Social Security system. Lots of glowing promises until the stock market went into the tank along with the housing bubble. Now the snake oil salesmen are back sniffing around that huge pile of money, scheming to at last  get their grubby paws on it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476877934", "commentID": 20183118, "userID": 48798745, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183118}, {"approveDate": "1476891301", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476887701", "permID": "20183177", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midlothian, VA", "parentID": null, "userDisplayName": "David Ciliberto", "commentTitle": "<br/>", "commentBody": "So your saying Hillary is open to raising the ceiling that higher income earners contribute while also open to reducing the amount those same people receive when they retire. Now that really sounds fair. And you wonder why people would prefer a private investment account, it's so our own money isn't being controlled by the whims of politicians. That is the same as telling people who contribut to pensions or 401k's that your employer will decide if they are going to give you your money back when you retire. Social Security is not a voluntary program, it is a contract with the American people that we will receive what we contributed plus interest when we get to a certain age. And you won", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476878217", "commentID": 20183177, "userID": 50796105, "recommendations": 20, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183177}, {"approveDate": "1476891351", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476887751", "permID": "20183241", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Corinth, Kentucky", "parentID": null, "userDisplayName": "Nancy", "commentTitle": "<br/>", "commentBody": "These people who calculate and report inflation surely do not grocery-shop. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476878485", "commentID": 20183241, "userID": 69581427, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183241}, {"approveDate": "1476892196", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476888596", "permID": "20183418", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Sanjay", "commentTitle": "<br/>", "commentBody": "How about levying the SS and MC taxes on all income, not just earned income?  I want the fat cat billionaires and centimillionaires to be paying the same rates that I do.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476879156", "commentID": 20183418, "userID": 63190245, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183418}, {"approveDate": "1476892337", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476888737", "permID": "20183647", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn, NY", "parentID": null, "userDisplayName": "Agent Provocateur", "commentTitle": "<br/>", "commentBody": "It is enraging that the NY Times, a newspaper that has a predominantly middle class to very wealthy readership base, would continue the canard that private accounts or diversifying the SS trust fund is some how dangerous. This cavalier dismissal of the power of compounding from a proper mix of stocks, bonds and cash treats all Americans as if they are inept fools. <br/><br/>I make nearly $200K per year and would strongly endorse raising the SS income limitation BUT only if I was able to self direct and have some ownership stake in my account. Raising the limit to $200K would mean between my employer and me nearly $25K/year would be going in to my account. Such an investment over the course of a number of years in even a basic annuity with a COLA would provide me a monthly payment much, MUCH higher than SS. <br/><br/>This would go just the same for most contributors even down to low income earners. Further, low income people are those more like to die before fully benefiting, if at all, from SS. An investment account would give their beneficiaries some inheritance should a low income earner die before they collect or only do so for a few years. <br/><br/>Keep in mind that SS is a muddle since it is not just a pension system, but a disability system. This is one of the greatest drains on the program as the lazy and get overs out there game the system by taking advantage of the disability component. Separating these two program would expose the scammers taking advantage of SS.<br/><br/>Horrible editorial!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476880016", "commentID": 20183647, "userID": 61852274, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183647}, {"approveDate": "1476892688", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1476889088", "permID": "20183694:20183938", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": 20183694, "userDisplayName": "Sage", "commentTitle": "<br/>", "commentBody": "I would never expect the TP/GOP support any legislation that enhances the benefits...and life for ordinary Americans.  They only support tax breaks for the wealthy, protections for corporations, etc. By the way, in case you didn't know it, we have the largest wealth disparity than we've ever had in this country.  Fair taxation create a civil society, and we don't have that.  Case in point, Donald Trump's federal taxes~his depreciation tax may be legal, but it is deeply unfair.  You want a civil society, where the majority of Americans can live with dignity (not in poverty), then reforming the tax system is very necessary.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476881024", "commentID": 20183938, "userID": 71801375, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183938}, {"approveDate": "1476892702", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1476889102", "permID": "20183694:20183951", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Michigan", "parentID": 20183694, "userDisplayName": "Jeffrey", "commentTitle": "<br/>", "commentBody": "Such resentment of people on \"the dole\"...but zero resentment of the corporations and sleazeballs like Trump who pay no taxes.  Aren't they on \"the dole\" too?  Where's the Republican outrage?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476881059", "commentID": 20183951, "userID": 73404386, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183951}, {"approveDate": "1476892809", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476889209", "permID": "20183770", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "TX", "parentID": null, "userDisplayName": "Sid", "commentTitle": "<br/>", "commentBody": "Where is the political courage to tax passive earnings at the wage earners tax rate?  Do it and the argument of \"SS's going broke\" disappears; along with the deficit.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476880436", "commentID": 20183770, "userID": 70706081, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183770}, {"approveDate": "1476892849", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476889249", "permID": "20183890", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Malone, NY", "parentID": null, "userDisplayName": "Rea Tarr", "commentTitle": "<br/>", "commentBody": "I cannot live on my social security income.  Luckily, at 79, after a long search,  I found a job -- part-time, naturally, so there are no benefits -- that allows me to squeak by (as long as I keep the thermostat at no higher than 59 degrees.)<br/><br/>Yet 6.2% of my gross is deducted for FICA.  Seems a mite unfair that I'm paying a chunk of my earned income to support social security and Medicare -- while I have $122 per month deducted from my smallish S/S check for my Medicare coverage.<br/><br/>I've never understood economics -- I'm into languages -- but there must be a way that old folks who cannot afford to retire might be allowed to earn enough to scrape by without having to put part of what they get back into the very pot whence come their pittances.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476880885", "commentID": 20183890, "userID": 42543762, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20183890}, {"approveDate": "1476893771", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476890171", "permID": "20184230", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "ACJ", "commentTitle": "<br/>", "commentBody": "I know the NYT has to fill space in their Opinion Pages, and, certainly, social security is worthy of analysis. But analyzing any Trump policy is futile---his bits and pieces of stream of consciousness policies are just that, bits and pieces of nonsense that don't fit together, fails to understand the problem, and would never be implemented--even in a Republican controlled Congress. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3324/1678/cropped-33241678.jpg?0.32306929980404675", "createDate": "1476881893", "commentID": 20184230, "userID": 33241678, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20184230}, {"approveDate": "1476895160", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476891560", "permID": "20186795", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "White Plains", "parentID": null, "userDisplayName": "Paul", "commentTitle": "<br/>", "commentBody": "I just received my first Social Security check. What was a nice gross amount of $2500 a month suddenly became a lot less nice after income taxes and Medicare surcharges were deducted. The gross amount was reduced by $800. $500 for income taxes on money that was already taxed by the federal government when I earned it, and another $300 in Medicare surcharges because I was diligent enough to work for a good company that provides a pension and to save my money so that I earn income on the savings. Now The Times editorial board wants more blood from the stone that is the American taxpayer. Enough is never enough when it comes to taxes and Democrats. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476890159", "commentID": 20186795, "userID": 51180606, "recommendations": 15, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20186795}, {"approveDate": "1476895550", "commentType": "comment", "userTitle": "NULL", "updateDate": "1476891950", "permID": "20185857", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "penn", "parentID": null, "userDisplayName": "anthro", "commentTitle": "<br/>", "commentBody": "You forgot to mention the elephant in the room...Paul Ryan. In 2004, Ryan pushed a plan to privatize Social Security so extreme that even George W. Bush called it “irresponsible.” In 2007, Ryan became the ranking member of the House Budget Committee, and used that perch, as well as his subsequent position as Chairman, to draft yearly budgets that included massive cuts to Social Security, Medicare, and Medicaid.<a href=\"http://www.huffingtonpost.com/nancy-altman/trump-and-ryan-agree-lets_b_9992656.html\" title=\"http://www.huffingtonpost.com/nancy-altman/trump-and-ryan-agree-lets_b_9992656.html\" target=\"_blank\">http://www.huffingtonpost.com/nancy-altman/trump-and-ryan-agree-lets_b_9...</a>? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1476887211", "commentID": 20185857, "userID": 25851748, "recommendations": 45, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20185857}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 663, "api_timestamp": "1488822355", "totalReplyCommentsFound": 290, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}