{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 772, "totalEditorsSelectionFound": 26, "depthLimit": 0, "totalRecommendationsFound": 739, "comments": [{"approveDate": "1478833580", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478885250", "permID": "20441598", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 15, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Honest hard working", "commentTitle": "<br/>", "commentBody": "All the hate I see is from the radical liberals!<br/><br/>The guys in Chicago beating a guy who voted for trump.<br/><br/>The violent protest that led to arrests in NYC.<br/><br/>The protest in Oakland that included looting &amp; arson !<br/><br/>The whole election was about the truth.<br/><br/>Be honest with yourself.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478832961", "commentID": 20441598, "userID": 56475358, "recommendations": 271, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441598}, {"approveDate": "1478836029", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883341", "permID": "20441936", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Amherst, MA", "parentID": null, "userDisplayName": "RDeanB", "commentTitle": "<br/>", "commentBody": "I hope that the Times will follow through and do substantive reporting on Trump's actions, and the events that follow from his election.<br/><br/>If the Times does not -- and -- as it has been too often doing -- creating content about rhetoric and solicited commentary -- then it, too, will be part of the problem.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478836013", "commentID": 20441936, "userID": 64371585, "recommendations": 477, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441936}, {"approveDate": "1478837767", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883361", "permID": "20442105", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "sfdphd", "commentTitle": "<br/>", "commentBody": "This editorial is absurd. Trump is the Hater in Chief, he campaigned on that, and won by stoking that hate. <br/><br/>He will likely pretend to play nice until the inauguration. Behind the scenes, he is laying the groundwork. He is the snake laying in wait until January 20th. After that, chaos will break loose, probably outsourced to his minions Gingrich, Giuliani, Christie, Pence, McConnell, etc. <br/><br/>The Democrats better be planning too, to resist at every turn, and to organize for the midterm elections. We need to immediately start thinking about getting three more Senators in 2018....", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478837736", "commentID": 20442105, "userID": 53754055, "recommendations": 1005, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442105}, {"approveDate": "1478842987", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883388", "permID": "20442519", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 20, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Ann", "commentTitle": "<br/>", "commentBody": "I'm still wondering why the NY Times and others are so quick to  surrender the election? Polls Don't Miraculously “Lie”.  What kept HRC from winning? Look at the systematic disenfranchisement of 100s of thousands of voters: rigorous gerrymandering, repressive voter ID laws, limited access to voting machines, shorter poll hours, outright coercion to keep people from the polls, insecure voting machine software. Also look at the Electoral College that thwarted the majority popular vote which elected Hilary. Worth noting: Two reader posts pulled from the Washington Post article detail the polling/data breakout:<br/>\"This was a very close election when you look at the numbers. HC won the national vote and DT won the electoral college vote by just 57,000 voters. That number of voters could have secured Michigan, Pennsylvania and Wisconsin (46 electoral votes) for Clinton. That is 0.05% of the actual voters. In that only 48% of the total eligible voters turned up on the day, if 114,000 more Clinton voters had turned up it would have been a different story.” Another poster noted that had \"Jill Stein's votes gone to Clinton in WI and MI they would have flipped each state. Just about true in PA, too.” Suppressing the vote: now that's hatred.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3171/3359/cropped-31713359.jpg?0.2981304870210938", "createDate": "1478842923", "commentID": 20442519, "userID": 31713359, "recommendations": 618, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442519}, {"approveDate": "1478860351", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478860933", "permID": "20441673", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "VA", "parentID": null, "userDisplayName": "THW", "commentTitle": "<br/>", "commentBody": "Our outgoing President is a thoughtful and sincere man, capable of introspection, critical self-analysis, empathy, and compassion.  Forever strong in the face of obstacles and pressures, many of which we are most assuredly unaware of, President Obama has continued to lead by example with little posturing or bravado and a strong aversion to hyperbole.  While you might disagree with his policies and politics (and I have on numerous occasions), the decency and humanity of his soul shines through the darkest of nights.<br/><br/>In comparison with President Obama, President-elect Trump communicates almost exclusively through posturing, bravado, and hyperbole, causing the true meaning of words and actions to be lost on his supporters.  Perhaps the comment from Maureen Dowd's most recent column sums it up best:  \"The media takes him literally, but never seriously.  His supporters take him seriously, but never literally.\"  <br/><br/>If this is the case, then Donald needs to realize that he must now take himself literally.  Words and actions matter, and they have consequences.  And the price of those consequences just went up bigly. President-elect Trump has very little time to reverse 70 years of character development, but I do hope that he recognizes that the nation will be responding to his lead now.  <br/><br/>Godspeed, Donald.  For your sake and that of the nation I hope that you realize you can't put the toothpaste back in the tube.  The mess needs to be cleaned up instead. ", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478833746", "commentID": 20441673, "userID": 67031634, "recommendations": 367, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441673}, {"approveDate": "1478860558", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478861085", "permID": "20441688", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sydney, Australia", "parentID": null, "userDisplayName": "John Radovan", "commentTitle": "<br/>", "commentBody": "For Trump to have a successful presidency, he will have to pull off two tricks:<br/><br/>1. Convincing non-white Americans, women and the disabled that he didn’t really mean the things he said about them during the campaign. A total misunderstanding of how deeply he cares for them.<br/><br/>2. Convincing world leaders that any agreement he signs with them is worth the paper it is written on. A total misunderstanding of the way he stiffed contractors, banks and shareholders who signed on for his real estate projects, not to mention the unfortunates who signed up for Trump University.<br/><br/>I don’t want to sound like a Jeremiah, but I really do think that snake-oil salesmanship can only take Donald so far. A poor player who will strut and fret his hour, until even his own folks can see through him.<br/><br/>PS When will he release his tax returns?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478833868", "commentID": 20441688, "userID": 64654871, "recommendations": 431, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441688}, {"approveDate": "1478860558", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478861050", "permID": "20441689", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Canada", "parentID": null, "userDisplayName": "Pan-Africanist", "commentTitle": "<br/>", "commentBody": "Trump expressed openly what a significant segment of the population feels and wants privately.  The election results bear that out clearly.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478833874", "commentID": 20441689, "userID": 67799363, "recommendations": 179, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441689}, {"approveDate": "1478860977", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478860977", "permID": "20443324", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 11, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Puerto Vallarta", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "The Clinton Campaign painted Trump supporters as being in a basket of deplorables; i.e. racist, sexist, xenophobic, homophobic and anti-Semitic. I find this particular labeling troublesome as many Trump's supporters are hard working Americans who want their President to focus on national security, the economy, and illegal immigration. This false labeling of Trump was propaganda created to stir up hysteria among the voters and obtain votes for Clinton. In the end this tactic failed because many Americans rejected this dishonest kind of characterization of Trump. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478857962", "commentID": 20443324, "userID": 56162343, "recommendations": 117, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20443324}, {"approveDate": "1478862273", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478862273", "permID": "20441774", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lakewood OH", "parentID": null, "userDisplayName": "BChuck", "commentTitle": "n/a", "commentBody": "Because David Duke supports Donald Trump doesn't have much to do with anything and to quote him in support of this article as evidence of anything is irresponsible journalism...<br/><br/>At some point, I know we are all hungover with the impossibility of what has happened, at some point we're going to have to let go and just be Americans.<br/><br/>It's not bad to be one-- it's not bad to be an American. Most often we all are happy when it's sunny and laugh at funny videos and aren't all 24/7 watching cable news programs. Some people still take walks and build snowmen and don't post it on Facebook and wait for reactions, we live love and cry when it's time.<br/><br/>It's ok to lose graciously and it's hard for me to believe--Donald has been gracious in his victory. <br/><br/>Maybe it is time we don't talk as everyone as white or black or woman or immigrant but as human, american, part of it all.<br/>Perhaps the Democrats (and Republicans and 24/7 news media) separated us all too much into different groups deserving different things when we all just wanted to be treated this same--right now, at this exact moment. <br/><br/>Let's look inward with peace and harmony and not worry about identifying our differences because everything will be messy and uneven and ragged with weeds, we still wake up and either curse or rejoice, it's just another day.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478834779", "commentID": 20441774, "userID": 73483298, "recommendations": 80, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441774}, {"approveDate": "1478862412", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478862412", "permID": "20441789", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincy", "parentID": null, "userDisplayName": "TB", "commentTitle": "<br/>", "commentBody": "Before the election, Trump was deemed unfit for the presidency by the NY Times, almost every other news source, and many political leaders, both Democratic and Republican.  Now that he has been elected, these same media outlets and political leaders are saying we need to support him.<br/><br/>Folks, nothing has changed.  Trump is still unfit for the presidency.  He has dangerous ideas, and the presidency gives him powerful tools to impose his childish will on others.  There is no evidence that the man, having failed to achieve maturity and wisdom in the first 70 years of his life, will suddenly find it between election day and the inauguration. <br/><br/>I do not \"owe him a chance to lead.\"  Nor will I be foolish enough - after all Trump has said in the campaign - to offer him my \"presumption of good faith.\" <br/><br/>And despite the hopes of the NYT editorial board, I do not expect Trump to disavow the very ideas that got him elected.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478834877", "commentID": 20441789, "userID": 68964861, "recommendations": 782, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441789}, {"approveDate": "1478862488", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478862488", "permID": "20441795", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fredericton, Canada", "parentID": null, "userDisplayName": "Shaun Narine", "commentTitle": "<br/>", "commentBody": "It is time to admit and accept that American democracy is a failing institution. The election of Donald Trump proves this - a narcissistic TV game show host and \"businessman\" whose best strategy seems to be declaring bankruptcy. Trump appealed to hatred and xenophobia - as the GOP has done for decades - because it works. Even if he repudiates the hatred that he has unleashed now, it will just demonstrate that he is a man without ethics, willing to say and do anything to get elected. I would love to think that, now that he is President, Trump will become a bigger and better man. But that won't happen; he doesn't know how to be anything other than what he has always been. He is a 70 year old man whose skin is so thin and whose impulse control is so bad his staff had to take away his access to twitter. He is a pathological liar. He is a cheat and a fraud. He is a self-admitted abuser of women. How is it even possible to believe that any of this will change just because he is moving in the White House? It is not. This man is no ordinary candidate; he will not get better with time. As it is, this election should give all Americans a clear sense of how it was possible for Hitler to come to power through democratic means. Americans elected, at best, a bigot and a charlatan to office, knowing exactly what he was and not caring. If that doesn't show that a good chunk of Americans don't understand democracy then nothing does.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478834918", "commentID": 20441795, "userID": 28877360, "recommendations": 621, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441795}, {"approveDate": "1478863750", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883428", "permID": "20443835", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ohio", "parentID": null, "userDisplayName": "J.", "commentTitle": "<br/>", "commentBody": "I just wrote my Republican Senator and Representative about this issue. They have an absolute obligation to demand that their President-elect issue a statement condemning acts of racial, ethnic and religious violence and intimidation. Since both Sen. Portman and Rep. Chabot would vehemently deny that they support racism or white nationalism, they have no choice but to do so.  If they stay silent in the face of bigotry, they tacitly accept it. <br/><br/>We have to hold Republicans in Congress accountable for the acts of their leader.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478863728", "commentID": 20443835, "userID": 52197876, "recommendations": 249, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20443835}, {"approveDate": "1478864602", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478884009", "permID": "20441884", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Oregon", "parentID": null, "userDisplayName": "JrpSLM", "commentTitle": "<br/>", "commentBody": "The hate and bigotry seems to lay heavily with the anti-Trump folks with the effigy burning, the violent protests, the tears, the car burnings, road blockages and the claims to leave the country, etc.  I don't recall those events happening with the anti-Obama folks when he first was elected. If you don't like Trump as President, protest non-violently.  Write your Congressmen to urge them to vote down his policies.  Get off your couch and work for your party.  But, don't whine, whimper and expose your bigotry.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478835579", "commentID": 20441884, "userID": 69066979, "recommendations": 81, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441884}, {"approveDate": "1478866645", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478866645", "permID": "20441952", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Rick", "commentTitle": "<br/>", "commentBody": "It is interesting that a native New Yorker, who is from what is now one of the most ethnically diverse counties in the country put him self out there as a bigot and inspired so much bigotry. I am very concerned that Trump is so thin skinned and psychologically unstable that he will use the bigotry to get more adulation - which he appears to constantly crave - from his devoted bigoted, racist followers. (For those of you Trump supporters inside and outside of New York City who are reading this, I understand that the vast majority of you are not racists or bigots - but that you have other issues - such as economic ones that must be addressed.) If Trump continues fostering bigotry, he must be impeached. Hopefully, the bigoted statements and acts were merely some kind of cynical political ploy that he really did not believe in, but at this point I tend to doubt it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478836122", "commentID": 20441952, "userID": 77070180, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20441952}, {"approveDate": "1478870585", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478870585", "permID": "20442000", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson, MS", "parentID": null, "userDisplayName": "David L, Jr.", "commentTitle": "<br/>", "commentBody": "You say that President-elect Trump has a moral duty to repudiate sexism and racism, but you acknowledge that his campaign was at least partially based on stoking it. I doubt he feels he has a moral obligation to do anything. Do moral calculations play a role in his decision-making?<br/><br/>But I agree. What is needed is a kind of détente between Trump and, well, everyone who isn't okay with hearing their president say and do some of the things he's said and done. He has to show us that he was playing a role, that he's not actually the evil person he has demonstrated himself to be. Pretending to be a xenophobe, a racist, and a misogynist is bad enough; actually being one is worse. Now he should pretend to be something else: contrite.<br/><br/>I'll never entirely forgive some of what Trump has said and done, but I think I and others could come to live with him, to tolerate him, if he abjures and denounces prejudice and hate. Let's be clear-eyed. Many of his supporters thought they were voting for a bigoted president and would be vexed to find out they weren't. The reason Trump was so popular was because he said he'd build a wall on the U.S.-Mexico border and ban Muslims.<br/><br/>Trump is now the president-elect. He's my president and yours. He's the president of blacks, Muslims, and Mexican immigrants. He has to see that. For the sake of the country, we must give him an opportunity for redemption. As Obama might put it, we should extend our hand if he will unclench his fist.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6688/9060/cropped-66889060.jpg", "createDate": "1478836566", "commentID": 20442000, "userID": 66889060, "recommendations": 72, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442000}, {"approveDate": "1478871606", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478871606", "permID": "20442066", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maryland", "parentID": null, "userDisplayName": "reader", "commentTitle": "<br/>", "commentBody": "Sorry NYT but hate speech is free speech in this country and protected under the 1st Amendement.<br/>It goes without saying that our safety should be protected. It's the law. And last time I checked Trump was the law and order candidate. It remains to be seen what he said and meant before and after the election.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478837364", "commentID": 20442066, "userID": 61300352, "recommendations": 49, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442066}, {"approveDate": "1478872030", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883485", "permID": "20445974", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson, MS", "parentID": null, "userDisplayName": "Christopher Neyland", "commentTitle": "n/a", "commentBody": "Please. The Hate is what got him elected, maintained a majority of  Republicans in the Senate, and the Hate is what Trump and Bannon and Coulter aim to use to stay  in power. The Times Editorial Board comes across as silly when it asks an openly racist demagogue  to stop  being an openly racist demagogue.   Better to spend your time and effort trying to educate your readers that Paul Ryan is openly lying about Medicare in an attempt to kill the program.  At least some good may come of that.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478871965", "commentID": 20445974, "userID": 7961339, "recommendations": 309, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20445974}, {"approveDate": "1478878716", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478878716", "permID": "20446514", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Philadelphia", "parentID": null, "userDisplayName": "Chris", "commentTitle": "n/a", "commentBody": "That Trump won is not surprising to me.  Why? It's because people are bigots behind closed doors.  I work in healthcare. When I was a surgical resident in The Midwest, I witnessed anaesthesiologists and surgeons poking fun and making racist comments at patients and other doctors that were not white. Mocking their accents, sharing racist cartoons on their phones etc. Now that I have finished and gotten a job on the coast,  it's almost the same thing. I'm saddened that a group of highly educated people have to resort to bigotry. If you think that 15  years of education and the Hippocratic oath makes someone a better and more caring person, you are sadly mistaken. Prejudice and racial divide runs deep and nothing can reverse it.  I would submit that if doctors say these kinds of things imagine what someone without a ton of education or socioeconomic status says behind closed doors. Physicians have no right to complain or feel morally superior to the rest of the population. Trump just have everyone in America a carte Blanche to be politically incorrect and say or do what they feel. That's why he won. People don't like minorities including LGBT. They just didn't say it. Now they can.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478873252", "commentID": 20446514, "userID": 66030308, "recommendations": 173, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20446514}, {"approveDate": "1478880609", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478884718", "permID": "20442913", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Guam", "parentID": null, "userDisplayName": "Katherine", "commentTitle": "<br/>", "commentBody": "Trump's failure to address this immediately is what has fueled the protests across the country.  He needs to take responsibility for his words and actions.  He cannot, and should not, continue to run away from this.  If he wants respect from everyone, he needs to act now.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478849183", "commentID": 20442913, "userID": 48220509, "recommendations": 95, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442913}, {"approveDate": "1478881098", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478881098", "permID": "20443014", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ft. Lauderdale", "parentID": null, "userDisplayName": "Marc Schenker", "commentTitle": "<br/>", "commentBody": "How can he possibly denounce what's such a part of him? After all, racism got him into The White House. Anti-Semitism sustained him, knowing every Muslim in America would now be watched and denounced. Misogyny is such a vital part of his attitude toward women and women, it seems, didn't mind at all. I don't really think we have a shot at this guy changing. He would, in fact, betray the ones who voted for him and turn them against him. No, I shudder at the next four years and what it's going to do to all of us.<br/><br/>What used to be a beacon of hope to the world, has turned out to be just another Authoritative Dictatorship, just like so many countries around the world. Indeed, a light has gone out in the world, a light consisting of a whole country turned insane. I'm not the first one to say, \"God help us.\"", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6656/7467/cropped-66567467.jpg?0.38136409991420805", "createDate": "1478851411", "commentID": 20443014, "userID": 66567467, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20443014}, {"approveDate": "1478883604", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883604", "permID": "20442088", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Houston", "parentID": null, "userDisplayName": "Melanie Ormand", "commentTitle": "<br/>", "commentBody": "Mr. Trump is tweeting as I respond here how \"it's unfair!\" -- he's referring, of course, to a second night of protests in various cities.<br/><br/>Dream on, NYT. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478837593", "commentID": 20442088, "userID": 63466932, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442088}, {"approveDate": "1478883937", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478883937", "permID": "20442239", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Arizonia", "parentID": null, "userDisplayName": "Sid", "commentTitle": "<br/>", "commentBody": "Let's never forget that Hillary Clinton won more votes than Trump. Every article should start with \"Trump, who lost the popular vote...\"", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/869/2450/cropped-8692450.jpg", "createDate": "1478839181", "commentID": 20442239, "userID": 8692450, "recommendations": 205, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442239}, {"approveDate": "1478884613", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478884613", "permID": "20442374", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cambridge", "parentID": null, "userDisplayName": "Nina", "commentTitle": "<br/>", "commentBody": "Calm down NY Times. A handful of incidents doesn't make a national trend. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478841100", "commentID": 20442374, "userID": 61594551, "recommendations": 37, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442374}, {"approveDate": "1478884899", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1478884899", "permID": "20443324:20449648", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "John", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Angeles", "parentID": 20443324, "userDisplayName": "Amanda", "commentTitle": "n/a", "commentBody": "John, I want to believe that what you say is true -- that the majority of Trump voters cast their ballots for him for economic reasons.   If so, why don't they denounce the hateful racist things that he has said and done? and also denounce those supporters of his who are racist as well? <br/><br/>Silence equals consent.<br/><br/>Those of you who are not racist need to make a stand within your party and let it be known that you exist and that you do not support the sentiments of the others. Otherwise you're with them.   Remaining silent because you approve of an economic plan that will benefit you while accepting that your candidate is espousing racism that could destroy the lives of other people is appalling. Time to make a stand if you really believe what you just wrote.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478882553", "commentID": 20449648, "userID": 3454872, "recommendations": 149, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20449648}, {"approveDate": "1478885327", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478885327", "permID": "20442452", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "portland, or", "parentID": null, "userDisplayName": "jean", "commentTitle": "<br/>", "commentBody": "Thank you, thank you, thank you, New York Times.  This speaks my mind and heart.  I've been waiting to hear this since Wednesday morning, when the media (and reader comments) seemed shocked or surprisingly sanguine (\"now we must all work together and move forward\")  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478842165", "commentID": 20442452, "userID": 63724528, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20442452}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1199, "api_timestamp": "1488822375", "totalReplyCommentsFound": 427, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}