{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 9, "totalParentCommentsFound": 273, "totalEditorsSelectionFound": 9, "depthLimit": 0, "totalRecommendationsFound": 276, "comments": [{"approveDate": "1470573894", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470570294", "permID": "19409204", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Forest Hills", "parentID": null, "userDisplayName": "dEs JoHnson", "commentTitle": "<br/>", "commentBody": "Clearly automation has resulted in job losses. The swing from coal to cleaner energy has also cost jobs. Down through history, increases in efficiency have put people out of work. The adoption of agriculture ended the life-style of hunter-gatherers and drove them into cities often to live in poverty. This has continued into the present. In India, for example, as many as 400 million farmers and family members are to be displaced. It's estimated than 40,000 Indian farmers have committed suicide since 2000, driven to desperation by government policies. The Chinese government has decreed that 250 million people are to be moved off the land and into cities. <br/><br/>So it is abroad. The scale may be different here, but chronic lack of planning has given us cities with great poverty. Laissez faire indeed! Let the rich do as they wish, let the weak founder, and blame someone else. We're better than that... at least I used to think so. But in reviewing the policies of the GOP and their stunted \"ideologies,\" I no longer expect anything resembling enlightened self-interest--never mind compassion--from them. I expect them to blame others and to concoct whatever lies suit their accusations.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6023/4566/cropped-60234566.jpg", "createDate": "1470544706", "commentID": 19409204, "userID": 60234566, "recommendations": 120, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19409204}, {"approveDate": "1470574153", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470570553", "permID": "19409521", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Collbran, CO", "parentID": null, "userDisplayName": "Kingfish52", "commentTitle": "<br/>", "commentBody": "Of course the problem isn't just \"trade\", but that single word fits so nicely on a bumper sticker, which is the only way many voters can conceive of complex issues. The problem is \"free\" trade that promoted offshoring of our manufacturing, and then placed no limits on importing those manufactured goods and services. The resulting loss of jobs, wages, and profits that used to fuel America, now fuel foreign nations, multinational corporations, and Wall Street, while Main Street is abandoned.<br/><br/>The solution isn't simply to cancel all trade deals, but we should certainly revisit them and modify them. But we need to also change our tax structure to make offshoring unattractive, and importing unattractive, and investing in the U.S. and our workers very attractive. <br/><br/>As for the impending TPP, that must be squashed entirely, as it was written by, and for, multinationals, and infringes on our sovereignty as it allows any company that feels a law or regulation might impact their profits, to sue and collect damages. It grants more rights to faceless corporations than our own citizens enjoy! <br/><br/>When the majority of Americans can profit from trade like Corporate America, Wall Street, and the multinationals and foreign countries have, then we will have FAIR trade, and that's something to strive for.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470552386", "commentID": 19409521, "userID": 73348263, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19409521}, {"approveDate": "1470574219", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470570619", "permID": "19410633", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston, MA", "parentID": null, "userDisplayName": "PeterS", "commentTitle": "<br/>", "commentBody": "Trump promises to bring back obsolete industries, like steel. With our wages, and living standard, much higher than that of developing countries, the steel that we produce is more expensive. The finish product, like cars, would be much more expensive too and will not be competitive for export. The only way for us to compete in industry like steel is to reduce cost and automate via robotics. Jobs in some industrial sectors will not come back. The fact is low skill, low knowledge based jobs are gone. Policies to preserve them is a race to the bottom. Do we want the average living standard of China or Brazil or Russia? I don't. While I don't think that we should give up on manufacturing (I am an engineer), in fact, I think that manufacturing is a potential growth area. The trick is that the products that we manufacture must be high value of and that means that high tech skill sets. If you think that your grandfather worked in a steel mill, your father worked in a steel mill, and you and your children must work in a steel mill, then we are lost. Besides revising financial and tax policies to ensure more equal income distribution (increase minimum wage, increase progressivity of income tax, and increase capital gain tax for starters), the government must institute an education system that provide life long training for our citizens. The world is moving too fast for anyone to think that the skills that they learned in their teens will be sufficient through their life. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470573255", "commentID": 19410633, "userID": 50973161, "recommendations": 132, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19410633}, {"approveDate": "1470574731", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470571131", "permID": "19409643", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Bel Air, Maryland", "parentID": null, "userDisplayName": "Annette Blum", "commentTitle": "<br/>", "commentBody": "My first job, inputting prices of caskets into a Wang computer in 1977, for a CPA firm, to produce balance sheets and income statements, would not exist today. Instead, the caskets might be scanned into inventory by bar codes to the funeral home's computer, producing the statements in-house. The info would be sent electronically from the funeral home to the CPA firm, which would generate tax returns at the touch of a button, and then send the returns electronically to the IRS. It can be done much more efficiently now, with fewer people, and ever smaller equipment that is depreciated. Even the office space required would be cut in half.<br/><br/>I remember how excited my bosses were, leaning over the tractor-feed printer, marveling at the new statements that popped out, instead of relying on the expert typing skills of the head secretary out in the anteroom. Her skills, worth much more than mine, would now be considered obsolete, as the partners would now rely on email, instead of business letters.<br/><br/>The three clerical workers, a bookkeeper, and I held jobs back then that would not exist today, but the three CPAs would be working just as hard or harder today, and generating even more work. That Wang computer with its tractor-feed printer was the camel's nose in the tent.<br/><br/>I left the firm, married, and we raised four kids, thanks to Walmart and IKEA, in the narrowing, credit-maxed middle class. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6473/8190/cropped-64738190.jpg?0.706808436429128", "createDate": "1470556985", "commentID": 19409643, "userID": 64738190, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19409643}, {"approveDate": "1470574919", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470571319", "permID": "19410900", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rochester, MN", "parentID": null, "userDisplayName": "OldBoatMan", "commentTitle": "<br/>", "commentBody": "The trade treaties that have wreaked such havoc are not trade treaties that promote trade within the traditional definition of trade.  They should be called faux-trade treaties.<br/><br/>In the traditional sense, trade occurs when a business entity exports its products to foreign market.  That's not what the faux-trade treaties promote.<br/><br/>The faux-trade treaties promote a modern day form of mercantilism.  They encourage American investment in foreign countries, off-shoring of manufacturing operations, the importation of American designed products for domestic corporations in foreign countries  and the formation of off-shore capital pools.  <br/><br/>The faux-trade treaties operate within the context of US policies that reinforce modern mercantilism.  Those policies include taxation, labor regulation, anti-trust regulation and banking regulation.  Since the 50's these policies have resulted in oligopolies, financial institutions dominating the economy and oligarchs controlling the economy and government.  The results are not pretty.<br/><br/>It took over half a century to get us from the relatively egalitarian 50's to raging inequality.  It's not just the faux-trade treaties that need to be corrected, it's the broad range of policies that promote modern mercantilism.  That correction will take many years to accomplish.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470574735", "commentID": 19410900, "userID": 20818051, "recommendations": 92, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19410900}, {"approveDate": "1470576120", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470572520", "permID": "19408489", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Atlanta, GA", "parentID": null, "userDisplayName": "Sebastien", "commentTitle": "<br/>", "commentBody": "Blaming international trade agreements for the woes of American workers is very much like blaming the interstate highway system for your local downtown rush hour traffic. One may have an indirect effect on the other, but shutting it down won't help that much. Middle class Americans have lost their purchasing power primarily because of domestic political choices (weakening of workers unions, lower taxes on the rich, stagnating minimum wage, increased college tuition). It's domestic policy that needs fixing, not international agreements.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470537223", "commentID": 19408489, "userID": 17017859, "recommendations": 110, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19408489}, {"approveDate": "1470576666", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470573066", "permID": "19410803", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Wisconsin", "parentID": null, "userDisplayName": "A. Bloom", "commentTitle": "n/a", "commentBody": "Trade isn't the main force destroying good jobs? It may not look that way from the NYT editorial offices, but out here in the small Midwestern towns where I and my family live, it's as plain as day. The factory that was the largest employer in town, providing income and keeping people in town, where they spent that income at other local businesses, is now gone. It didn't reduce employment by automating; it closed. The things it manufactured are now manufactured overseas. We are left with the abandoned ruin, an eyesore and reminder of our former lifeblood, as one by one, the lights have gone out at our local hardware, drugstore, and grocery stores. They couldn't compete with the cut-rate prices of the big box stores on the outskirts of town, that sell everything at \"always the low price.\" You might not appreciate the shoddy quality of a lot of the merchandise, but that's what you're buying now, because it's all that's available here. And it's all made in foreign countries, with questionable materials and processes we can't observe or control, by workers who are paid far less than the minimum wage here. Economists may have their theories about why we've lost our jobs, but the evidence we're staring at says it's the trade agreements.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470574203", "commentID": 19410803, "userID": 213789, "recommendations": 192, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19410803}, {"approveDate": "1470579791", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470576191", "permID": "19411751", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "nj", "parentID": null, "userDisplayName": "j", "commentTitle": "<br/>", "commentBody": "I support trade; however, we need to understand that capitalism has winners and losers.  The people who have lost are in free fall without a safety net, and have been for years.  We are kidding ourselves if we think manufacturing will ever return on a scale seen 40 years ago.  However, when our trading partners are developing nations, we must recognize there will be a great wage discrepancy between the two nations, and the nation with the higher wages will lose.  That is what has happened here.  Perhaps one day, we will see the rise of international trade unions.  Until that day, there are steps we can take to level the playing field.  We need to compel US companies, through a carrot/stick approach, to focus on long term gains instead of immediate results.  That can be accomplished through taxes.  We need to bring home off shored money, lower corporate taxes and close corporate tax loopholes.  GE should not pay zero taxes while small businesses are paying significantly more.  Finally, community colleges and state schools must establish partnerships with unemployed workers and high school students, to train them in careers of the future.  This should include internships that transition to paid employment.  We can no longer afford to focus only on capitalism's winners.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470579571", "commentID": 19411751, "userID": 26556077, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19411751}, {"approveDate": "1470579992", "commentType": "comment", "userTitle": "NULL", "updateDate": "1470576392", "permID": "19406853", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dallas, TX", "parentID": null, "userDisplayName": "Larry L", "commentTitle": "<br/>", "commentBody": "I would posit that it is not just the NUMBER of jobs lost. But the quality of the jobs that were lost (and continues to lose) and the low quality of jobs they were replaced with. So, median income declined on top of job losses. One should also note that although the trend started in the blue collar world, the trend now is drilling into the white collar world (so those who think they are safe, look out).<br/><br/>The article states Germany lost 25% of its manufacturing jobs but yet was still able to maintain a trade SURPLUS and somehow manages a LOWER unemployment rate than the U.S. I do not know what the income stats in Germany are but I presume they are better than those for American median income.<br/><br/>The main difference is that Germany's government felt some responsibility for safeguarding the interests of its own citizens and workforce where the U.S. did not. The American government just sold out to the highest bidder.<br/><br/>The belated words on the matter of trade policy is too little, too late. And, there is also the question of follow-though. Words are nice. Concrete and substantial action would be better.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1470523953", "commentID": 19406853, "userID": 21066648, "recommendations": 119, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 19406853}], "totalEditorsSelectionReturned": 9, "replyLimit": 3, "totalRecommendationsReturned": 9, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 349, "api_timestamp": "1488822342", "totalReplyCommentsFound": 76, "totalCommentsReturned": 9, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}