{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 15, "totalParentCommentsFound": 293, "totalEditorsSelectionFound": 15, "depthLimit": 0, "totalRecommendationsFound": 307, "comments": [{"approveDate": "1478341067", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478337467", "permID": "20363673", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Madison WI", "parentID": null, "userDisplayName": "John Woods", "commentTitle": "<br/>", "commentBody": "When a sizable percentage of the American electorate believe anything that comes out of Donald Trump's mouth, regardless of how nonsensical it is, how counter to the facts it is, I would say this country has a serious problem. The culture war is raging again. For a while the coals of this war were dying somewhat, but Trump came along and poured on the fuel of outrageous statements and outright lies. Despite this, to his supporters his incompetence has become irrelevant. <br/><br/>Demagogues like Trump thrive by providing scapegoats for the problems of those who are unwilling or unable to get their lives together. They seem to prefer blaming others for what's wrong rather than considering someone who might actually provide some solutions. Hillary is doing all she can to suggest ways to make things better for these folks, but I am unclear that they will accept her ideas even if she is elected. They have too much invested in this authoritarian figure who would make life worse for them and for all of us.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1716/3221/cropped-17163221.jpg?16997218611372477846", "createDate": "1478318167", "commentID": 20363673, "userID": 17163221, "recommendations": 318, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20363673}, {"approveDate": "1478341305", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478337705", "permID": "20364020", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Partha Neogy", "commentTitle": "<br/>", "commentBody": "The misinformation and disinformation being peddled by talk radio, some internet sites and cable TV channels and now a presidential candidate are as addictive and harmful as any hard drug.  Unfortunately, the only feeble recourse we have is better education.  That could help the younger generations, but what do we do with their elders?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478322668", "commentID": 20364020, "userID": 13105665, "recommendations": 218, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20364020}, {"approveDate": "1478341342", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478337742", "permID": "20364054", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "One can debate whether our economic glass is half full or half empty.  But no one with a rudimentary knowledge of economics can doubt that a Trump administration would drain the glass almost to the bottom.  His tax and trade policies, as the editorial notes, would inflict severe damage on an economy still convalescing from the worst recession since the Great Depression.<br/><br/>His vast ignorance of macroeconomics is exacerbated by a well-documented intellectual laziness, combined with a refusal to consult reputable professionals, to remedy his lack of expertise.  Thus, anyone who supports Trump on the grounds that he will surround himself with competent economists has failed to pay attention to his behavior and comments.  In office, Trump would represent that dangerous combination, an arrogant fool.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478323261", "commentID": 20364054, "userID": 63418614, "recommendations": 390, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20364054}, {"approveDate": "1478341599", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478346924", "permID": "20364322", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York City", "parentID": null, "userDisplayName": "Jack", "commentTitle": "<br/>", "commentBody": "Many of the jobs that have been added to the economy since 2009 are also part-time jobs with worse benefits. Jobs are still insecure, and the U-6 unemployment rate is hovering at around 10%.  The number of people in \"near poverty\" – a few pay checks away from poverty – has also increased since before 2008. In California, 4 in 10 people are in near poverty. Also, growth is still slow. Just a few days ago the NYT reported on how global trade is down and international shipping businesses are reporting decreased revenues. Many cooperations are sitting on record amounts amounts of cash because they don't want to invest in growth, and many bond interest rates are either at 0% or negative because investors see that 0% returns is safer than any alternative. Finally, the fed still hasn't raised interest rates because it doesn't think the economy has recovered enough to do so. <br/><br/>Let's also not forget what the state of the economy was like before the recession. Real wages haven't risen for the working class since the 70s, and the average household debt has skyrocketed since then. For many the American dream has become just that, a dream that no longer resembles reality.<br/><br/>History teaches that fascism emerges when the economic conditions are deteriorating. Maybe, instead of further alienating Trump's supporters by saying they have no reason to be angry, we should do a better job figuring out what is fueling the rage which is giving rise to populists like Trump's all around the globe. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478329890", "commentID": 20364322, "userID": 69283011, "recommendations": 102, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20364322}, {"approveDate": "1478350074", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478346474", "permID": "20365052", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Charleston, WV", "parentID": null, "userDisplayName": "Didier", "commentTitle": "<br/>", "commentBody": "We're finally seeing the economic benefits of eight years of stability in leadership.  In reality, a President can do very little to promote economic growth other than providing stable leadership.  When businesses, investors, and consumers feel confident, they expand, invest, and spend.  Mr. Trump's Etch-A-Sketch economic approach will have a devastating impact on the world economy.  <br/><br/>On Thursday, October 27th, the Dow Jones Index stood at 18,169, then James Comey interjected himself into the campaign on Friday, October 28th, and as of yesterday, the Dow Jones Index fell to 17,888.  Why?  Uncertainty.  <br/><br/>For the first time in nearly 40 years of investing, I have no exposure to the stock or bond market because, on October 28th, I liquidated my investments and placed all of my holdings in cash and cash equivalents (I'll live with the tax impact of my capital gains) because of the uncertainty created by James Comey.  <br/><br/>Can you only imagine what long-time prudent investors like me will do if Donald Trump is actually elected?  <br/><br/>If for no other reason than your 401(k), either put everything in cash and treasuries like I did last Friday, or vote for stability and hope for the best on Election Day.     ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5021/0704/cropped-50210704.jpg", "createDate": "1478345140", "commentID": 20365052, "userID": 50210704, "recommendations": 79, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20365052}, {"approveDate": "1478350082", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478346482", "permID": "20365409", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Virginia", "parentID": null, "userDisplayName": "Mike BoMa", "commentTitle": "<br/>", "commentBody": "Trump's supporters are a varied lot, only some of whom believe the economy is the principal reason for his appeal. <br/><br/>Obviously, Trump's fixes are more of the same GOP pablum: advantage the wealthy and all others will magically benefit. They won't. But Trump's \"economic supporters\" are desperate and all they hear is jobs - mostly \"returning\" manufacturing to the US, reinvigorating King Coal and other petroleum-extraction industries, and feeding the paranoia that \"illegals\" are taking the good jobs. He joins these promises, as have his alt-right and GOP henchmen, with lack of spending power, primarily by spewing more big lies about the costs of the ACA. So, yes, the economy is better in several real and significant ways and for many of our citizens. But Trump's appeal is to those who want a quick fix, who want to work, and who need to believe that they will not have to juggle personal finances on a week-to-week if not day-to-day basis. <br/><br/>Trump can't deliver. If Clinton is elected, she needs to connect, really connect, with these people and take action early on that they can see, understand and benefit from. She also needs to move around hostile GOP state governments.<br/><br/>Ironically, as has often been said, these people, and so many others, actually benefit from Democratic administrations and lose ground when Republicans are in power. There are precursor programs from which a Clinton administration can learn much. She needs to move quickly to help these folks.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478348584", "commentID": 20365409, "userID": 26406894, "recommendations": 83, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20365409}, {"approveDate": "1478350091", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478346491", "permID": "20365408", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Ocala FL", "parentID": null, "userDisplayName": "Ken R", "commentTitle": "<br/>", "commentBody": "The only reason the country is so concerned about a Trump victory is the power we have allowed to flow into the executive branch. This started with FDR during the New Deal. Regardless of who wins this election we need to reign in the power of this office. Executive orders, excessive regulations and administrative laws are not the way our constitution frames our republican form of government. We need to get our federal government back to a reasonable system of checks and balances not an all powerful executive.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478348580", "commentID": 20365408, "userID": 66607388, "recommendations": 9, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20365408}, {"approveDate": "1478359236", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478355636", "permID": "20365992", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Near the swamp.", "parentID": null, "userDisplayName": "Clark Landrum", "commentTitle": "<br/>", "commentBody": "There appears to be little doubt that Obama leaves the economy in far better shape than did George Bush. The Democrats should  point this out at every opportunity. They need a better propaganda machine. The Republicans are much better at illusion and don't mind throwing in a few falsehoods.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478352580", "commentID": 20365992, "userID": 64588545, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20365992}, {"approveDate": "1478360175", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478356575", "permID": "20366551", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mexico", "parentID": null, "userDisplayName": "John Townsend", "commentTitle": "<br/>", "commentBody": "The nation has made real economic progress with a coherent President and half a Congress. Unquestionably we are much better off today than we should have been able to expect we would be, when viewed from the bottom of that deep chasm left by Bush.<br/>But because there has not been a full Congress (an adult one) that actually legislated instead of obstructing the nation is now saddled with decrepit airports, deteriorating mass transit systems, and underfunded education systems putting it at a serious economic disadvantage with industrialized countries who are prudent enough to periodically repave their roads, upgrade their water and electrical systems, provide actual high-speed internet and foster a culture of education.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6974/5052/cropped-69745052.jpg?4287809851024206165", "createDate": "1478356907", "commentID": 20366551, "userID": 69745052, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20366551}, {"approveDate": "1478360433", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478356833", "permID": "20366622", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "The Poet McTeagle", "commentTitle": "<br/>", "commentBody": "Rather than risk another bubble that would burst and do yet more damage,  the Obama administration focused on bringing the economy back to stability and the type of growth that would not quickly collapse.  Increases in the minimum wage are widespread stimulus.  Though the GOP would never admit it,  Social Security benefits go right back into the economy, creating local jobs.  Wider access to medical care for the poor via the ACA has done that as well, in multiple ways.  <br/><br/>Now that the economy is finally on more solid ground, the GOP is ready to blow it up again.  Infrastructure spending is verboten, although Bush threw away billions in Iraq and Afghanistan, building roads and airports that are now in ruins.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5853/8937/cropped-58538937.jpg?528475954165759791", "createDate": "1478357676", "commentID": 20366622, "userID": 58538937, "recommendations": 73, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20366622}, {"approveDate": "1478361016", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478357416", "permID": "20366778", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Morgantown, WV", "parentID": null, "userDisplayName": "Aaron Staats", "commentTitle": "<br/>", "commentBody": "I am no fan of Donald Trump and I understand that our economic outlook is better than it was 1 year ago but it is accurate to say the numbers are a bit deceiving.  How much of the decline in unemployment is due to a decreased labor participation rate and how much of our recovery is simply a product of an evolving economy?  <br/><br/>Of the 15 million jobs created, how many are part of the monthly amount needed just to keep up with population growth?  What percentage of that job growth has been with part-time and temporary low paying jobs that offer no benefits and little chance for advancement?<br/><br/>It is easy to say that the economy is getting better but is it truly reality?  Where are the manufacturing jobs needed that create the wealth paying jobs responsible for a strong middle class?  For all the disdain of Trump, he is correct in his analysis of our economy regarding those type of jobs.  They are no longer American jobs but instead have been moved to places like Mexico, China and other countries that ship finished goods back to us with no repercussions from our government. <br/><br/>Michael Moore, no fan of Trump gave a speech in which he described how Trump threatened auto executives with tariffs if they shipped jobs to Mexico.  Calling it \"an amazing thing to see\" he described how Trump spoke to executives in a manner no other politician has.  Say what you will about Mr. Trump, he is right on many issues that Dems are dropping the ball on and that includes facts regarding the economy.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478358836", "commentID": 20366778, "userID": 75959687, "recommendations": 21, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20366778}, {"approveDate": "1478361130", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478357530", "permID": "20366801", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "J Stuart", "commentTitle": "<br/>", "commentBody": "The unemployment rate during the Reagan era started at 7.6%, rose to nearly 11% during his second year as President then fell to 5.5% by the time he left office. In 2009, the first year of President Obama's term in office, and inheriting  one of the greatest economic collapses in American history, the unemployment rate reached 9.6%. Today it is 4.9% and falling.  Yet Reagan's policies are still regarded as one of the greatest economic successes. Hopefully history will be able to move past biases and see economic realities, The Donald cannot.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478359011", "commentID": 20366801, "userID": 57886889, "recommendations": 51, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20366801}, {"approveDate": "1478361775", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478358175", "permID": "20367022", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Cab", "commentTitle": "<br/>", "commentBody": "Progress is being made and recovery is happening BUT it hasn't reached most of those who are supporting Trump. Our working class, industrial and manufacturing people have been knocked down by decades of outsourcing and kept there by the very people they voted for. It doesn't help that the Republican Party aggressively prevented the Obama Administration from doing all that could be done to help. <br/><br/>The GOP depends on discontent to motivate its base and has done little to provide assistance and guidance to set displaced workers on a new course. All that they have done was blame Obama and they will blame Clinton, should she be elected, continuing to disrupt any progress. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478361133", "commentID": 20367022, "userID": 13657032, "recommendations": 35, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20367022}, {"approveDate": "1478364169", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478360569", "permID": "20367185", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "fbraconi", "commentTitle": "<br/>", "commentBody": "The lack of historical memory in much of the American public is astounding. Eight years ago our economy was in free fall and the financial system in near collapse.  In the short time President Obama had a Democratic congress to work with, a stimulus plan which stemmed the bleeding was enacted, 20 million Americans were provided access to health care, and Dodd-Frank was adopted which has helped to avoid the financial excesses of the Bush years.  President Obama even managed to negotiate a tax increase on top earners that has helped to narrow the budget deficit dramatically.  Yes, there are still serious economic problems to address, but the economy has improved steadily over the past eight years. Yet millions of Americans are prepared to vote for a presidential candidate who embraces the same trickle-down, deregulation policies that led to the Great Recession and financial crisis to begin with.  If people were voting on the economic issues with clear eyes and some understanding of the recent past, this election would be a landslide.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478362414", "commentID": 20367185, "userID": 67120604, "recommendations": 63, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20367185}, {"approveDate": "1478364209", "commentType": "comment", "userTitle": "NULL", "updateDate": "1478360609", "permID": "20367198", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Murrieta", "parentID": null, "userDisplayName": "Jon", "commentTitle": "<br/>", "commentBody": "When I first heard Trump tell CNN in March of this year that the unemployment rate for black youth was 57%, I decided to look it up (since you can't count on CNN to correct Trump's multitude of lies).  The actual rate at the time was 23.3%, the 4th lowest rate out of 530 months on record.  Trump has been deviously trying to scare people about blacks and \"inner cities\" ever since.  I saw an interview this week of a white male Democrat in Pennsylvania who said he would be voting for Trump.  He cited the \"fact\" that inner cities are such a mess.  Trump planted the seed, albeit with a blatant lie, and it sprouted.  <br/><br/>The unemployment rate for black youth is now 27.6%, which is still in the lowest decile of historical rates.  For comparison, when it was \"morning in America\" in 1984 under Reagan, the unemployment rate for black youth ranged from 38.6% to 46.8%.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1478362516", "commentID": 20367198, "userID": 59969301, "recommendations": 58, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20367198}], "totalEditorsSelectionReturned": 15, "replyLimit": 3, "totalRecommendationsReturned": 15, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 522, "api_timestamp": "1488822324", "totalReplyCommentsFound": 229, "totalCommentsReturned": 15, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}