{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 6, "totalParentCommentsReturned": 19, "totalParentCommentsFound": 530, "totalEditorsSelectionFound": 25, "depthLimit": 0, "totalRecommendationsFound": 431, "comments": [{"approveDate": "1449745810", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449750369", "permID": "16912876", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Valley Lee, Md", "parentID": null, "userDisplayName": "Carolyn Egeli", "commentTitle": "<br/>", "commentBody": "Why did not the NYTimes publish this months ago? But does no one see that the issues he successfully exploits are because we are in endless wars? Stop the wars! Give up the pipelines in the Middle East and leave those people alone! Let's get busy and build renewable energy in this country. There are plenty of solutions. Even now, Germany must ask the Danes to slow down their wind energy supply as it is causing congestion in their wires, there is so much they can't use up! Solar on individual homes and businesses have reduced utilities in many places to energy consulting around the world. There is no reason why we couldn't do that here. Distributing power laterally, would literally take the wind out of Trump's blow heart speechifying. Because nothing could be more democratic or empower local communities and individuals to open up new entrepreneur opportunities for Americans and less the appeal of the likes of Trump, like plenty of clean and cheap power. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449745796", "commentID": 16912876, "userID": 62499561, "recommendations": 484, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16912876}, {"approveDate": "1449747188", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449750462", "permID": "16913014", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Brooklyn, New York", "parentID": null, "userDisplayName": "Matthew Carnicelli", "commentTitle": "<br/>", "commentBody": "The Times is passionate in this editorial, proclaiming that: \"The time to renounce Mr. Trump’s views was the day he entered the race, calling Mexico an exporter of criminals and rapists.\" <br/><br/>Yet, how many inches of digital and conventional ink has it given him since the day that he entered this race?  How many times did this paper allow Maureen Dowd to offer a softball piece about him?  I can remember at least two, possibly three.  And it's not as if his demonization of immigrants is the worst thing he's done in recent years.  That would be his attempt to delegitimize a sitting American President by attempting to propagate that witless birther meme, in the process undermining the Office of the Presidency and a people's faith in perhaps its most important national institution.<br/><br/>The fact is that Trump squandered the right to be covered as anything other than a loathsome sideshow well before 2012. <br/><br/>This narcissistic bully craves attention like the rest of us crave oxygen - and the major media now needs to deprive him of that oxygen, assuming it's management has moral courage to do so.<br/><br/>As regards the issue of Trump's deleterious impact on our national comity, the sad truth that he is merely playing to a base that has been radicalized by now 30+ years of poison pen journalism and media - and there isn't a form of collective psychotherapy that I know of capable of undoing that radicalization either quickly or easily, if at all.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5567/8593/cropped-55678593.jpg?0.11945834088370622", "createDate": "1449747145", "commentID": 16913014, "userID": 55678593, "recommendations": 860, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913014}, {"approveDate": "1449749228", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449758923", "permID": "16913261", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 46, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Richard Luettgen", "commentTitle": "<br/>", "commentBody": "Again with this fascism meme. There’s nothing fascistic about the right in America and nothing about Donald Trump that meets that description, either. But clearly Dem theme-central has gotten out the word that fascism is the club of the moment, probably because someone thinks the word just SOUNDS icky. They should crack a dictionary and inform themselves about what “fascist” actually means. A “fascist” is a dictator, a despot, an autocrat, and no Republican candidate espouses related sentiments. Indeed, those characterizations far more closely describe a president who imposes policy preferences by diktat because he lacks the political skills to horse-trade with ideological adversaries.<br/><br/>Then, there IS no “leading Republican candidate”. The polls are split all over the place. Trump simply has the most at present, clearly, the preference of Republicans is “massively undecided”. The field is as open today for a new leader to emerge as it ever was – and, indeed, support shifts among Trump, Carson and Cruz, with even Christie risisng.<br/><br/>Trump’s excess on Muslims springs from understandable concern that we’re not sufficiently vetting immigrants for ties to ISIS and to radical Islamist jihadism generally – as the recent outrage in San Bernardino proves conclusively. This is a concern embraced by a lot of Americans, and Democrats as well as establishment Republicans would do well to answer those concerns more effectively, as they’re likely to be a major campaign issue next year.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/3844/cropped-47123844.jpg?0.06419149620228637", "createDate": "1449749197", "commentID": 16913261, "userID": 47123844, "recommendations": 65, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913261}, {"approveDate": "1449758168", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449759205", "permID": "16913261:16915072", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Princeton", "parentID": 16913261, "userDisplayName": "ClearEye", "commentTitle": "<br/>", "commentBody": "Mr. Luettgen:<br/><br/>As you style yourself an opinion leader, you should really be more informed about both history and contemporary realities.<br/><br/>Of course there is a Republican front runner, as there has been for months, as the Real Clear Politics average of national polls shows: <a href=\"http://bit.ly/1IH4S6x\" title=\"http://bit.ly/1IH4S6x\" target=\"_blank\">http://bit.ly/1IH4S6x</a>  Mr. Trump is also leading in all the early contested states, usually by double digits. <br/><br/>On the authoritarian trend in Republican politics, William F. Buckley himself recognized more than 60 years ago that logic and reason would not be enough to defeat the New Deal consensus, so invented the idea of ''movement conservatism,'' emphasizing individualism in the economic realm untouched by any government combined with an appeal to the authoritarian strains of Christianity, fundamentals that could not be challenged by any argument.This led to Joe McCarthy and the John Birch Society (which, BTW, sprung from the National Association of Manufacturers,) Nixon's Southern Strategy, Reagan's fact-free assault on ''welfare queens,'' and Bush's Willie Horton.<br/><br/>So its little surprise that a large part of the Republican base, particularly those who wonder what happened to their middle class dreams, fall in behind Mr. Trump (over 40% would support a military coup <a href=\"http://bit.ly/1IH5IAc\" title=\"http://bit.ly/1IH5IAc\" target=\"_blank\">http://bit.ly/1IH5IAc</a> )<br/><br/>Try as they might, the other Republicans can't match him. But they are trying, as they can't win without his voters, a circumstance they have helped create over 60 years.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449758139", "commentID": 16915072, "userID": 22403264, "recommendations": 373, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16915072}, {"approveDate": "1449758870", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449758870", "permID": "16913617", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": null, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "Trump, despite his current popularity, remains a fringe candidate, no more electable that George Wallace.  His real importance lies in his impact on the GOP  and the tone of the campaign.  In extreme form, he represents notions that Republicans have peddled for decades.<br/><br/>The lineage of this candidacy traces back to Nixon's southern strategy in 1968.  He cynically calculated that the path to victory lay through a negative appeal to disaffected white Democrats from Dixie, angered by their party's transformation into a champion of civil rights.  Nixon's success encouraged Reagan to double down on the strategy.  The former actor camouflaged the vicious approach with a veneer of geniality and a promise of \"morning in America.\"  But the smile on Reagan's face could not conceal the message that the Democrats had victimized the white working class through unjust favoritism toward blacks.<br/><br/>The depiction of the Democrats as almost an illegitimate class-based party infected the GOP view of government.  The Dems had used state power to help the poor and minorities, so government itself had become unreliable, an enemy of the working class. Obama has simply reinforced this view. <br/><br/>Trump has embarrassed his party by candidly stating, in extreme form, the GOP's message of hostility to ethnic minorities as a threat to American values.  His apparent success has forced other candidates to deplore his excesses while embracing the core message.  The party's chickens have come home to roost.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449751834", "commentID": 16913617, "userID": 63418614, "recommendations": 155, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913617}, {"approveDate": "1449758944", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449758944", "permID": "16913261:16913374", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": 16913261, "userDisplayName": "Edin", "commentTitle": "n/a", "commentBody": "Unless you are a Muslim,all that sounds great.I am a Muslim who has never prayed in his life,nor does know how to pray.It just runs in my family for generations.So,what he is saying is as stupid as it gets.He is talking about members of one of the largest religions in the world.People who are ignorant and don't know many Muslims are supporting this opportunist.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449750092", "commentID": 16913374, "userID": 73725080, "recommendations": 195, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913374}, {"approveDate": "1449758949", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449758949", "permID": "16913261:16913500", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Berlin, Germany", "parentID": 16913261, "userDisplayName": "BettyK", "commentTitle": "<br/>", "commentBody": "May be you underestimate our ability to analyze Republican \"policy proposals\" and predictwhat they may become. In the 1920s, Hitler spent time espousing his \"policy proposals,\" before the people empowered him to follow up on his promises.<br/>\"...no Republican candidate espouses related sentiments.\" Let's see- suppressing a religious group, deporting an ethnic group, ethnic profiling, profiling the poor, undermining reproductive health laws, eroding the social safety net, denying healthcare, environmental regulations, etc., etc.<br/> Our current president's \"political adversaries\" already set a great example for what's to come:  They are monolithic obstructionists, set on destroying  government.<br/>Lastly, the concern about Syrian refugees applying for asylum might be understandable if Republicans would be so openminded as to listen to the arguments  that there are 6 federal and international agencies involved in the vetting process which lasts about two years. Somehow, however, they are deaf but to the sound of their own arguments and the righteousness of their own convictions of what does or does not constitute fascist ideology.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449751077", "commentID": 16913500, "userID": 69411051, "recommendations": 216, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913500}, {"approveDate": "1449759042", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449759042", "permID": "16913261:16914837", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kentucky", "parentID": 16913261, "userDisplayName": "Michael Friedman", "commentTitle": "<br/>", "commentBody": "I follow Mr. Luettgen's comments with interest, and as always he makes the best possible defense of the indefensible.  We liberals see Trump trying on 'fascism' like he would an embroidered ball cap.  His appeals to nativism, his constant abuse and denigration of opponents, preening cult of personality and now demonization of an entire religion seem a lot more 'fascist' than Obama's legal and fully precedented reliance on executive orders, for example.<br/><br/>It's also worth noting that even the estimable Mr. Luettgen no longer presents Jeb as the inevitable Republican nominee, now insisting instead that it's anybody's race to win.  Meanwhile, Trump packs them in while his rivals scramble for scraps.  We'll all see what really happens in Iowa and New Hampshire, but if responsible conservatives want to preserve the Republican Party they're going to have to stop sugarcoating Trump's bigotry as an 'excess' that 'springs from understandable concern.'  Anti-Islamism, like anti-Semitism, is foolish, shameful, and deeply un-American. <br/><br/>Finally, if the mass murder in San Bernardino proves conclusively that we need to vet immigrants for jihadist contamination, the mass murders in Sandy Hook, Charleston, Oklahoma City, Aurora, etc. prove conclusively that we need to vet white loners for fitness to purchase assault weapons... even though that most certainly WON'T be a campaign issue next year.  Thanks--", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6875/5185/cropped-68755185.jpg?0.7620835347607057", "createDate": "1449757178", "commentID": 16914837, "userID": 68755185, "recommendations": 376, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16914837}, {"approveDate": "1449759362", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449759363", "permID": "16914969", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Kalidan", "commentTitle": "<br/>", "commentBody": "Really?  Trump effect?  Trump is not effecting anything.<br/><br/>The causality is reversed.  Trump is the effect of republican causes.  The cause is a segment of population that faces absolutely no consequences for their hatred, fear, loathing.  Not one of the people who showed up outside the mosque in Irving TX with big guns to scare women and children saw so much as a slap on the wrist.  <br/><br/>Not one.<br/><br/>That this segment of Americans is also the most dependent on subsidies from the government, hates the government, and lines up for every single entitlement while yelling \"keep the government off my social security\" is the irony.  <br/><br/>The cause is that the republican establishment.  And what a cause it is.  They have succeeded in getting the middle class to hate the poor, the working class to hate Mexicans, blacks and everyone else.  They sold a bill of goods: \"they\" are eating your lunch, now \"they\" are all bad and should be herded, registered, banned, and excluded.  To a cheering chorus.<br/><br/>Trump wouldn't say a word that he did not think would resonate among his audience.  He is not causing anything.  He is the effect of very successful, albeit diabolical, republican causes.  And have they succeeded!<br/><br/>Kalidan", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449757726", "commentID": 16914969, "userID": 65362458, "recommendations": 228, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16914969}, {"approveDate": "1449759555", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449759555", "permID": "16915435", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cranford, NJ", "parentID": null, "userDisplayName": "Sue K", "commentTitle": "<br/>", "commentBody": "Let us not forget, also, the additional conditions that make this kind of hatred even more potent: gerrymandering and the ongoing effort to restrict voter rights. As a result, our voting districts have been drawn to create right-wing majorities where moderate electorates should have held sway. Republican efforts continue to place undue burdens on low-income and minority citizens attempting to register to vote. In the current environment, voter intimidation is also a very real threat.<br/><br/>In the past, reasonable, moderate Americans could take comfort in the fact that our system of representative government would inoculate us from the rise of demagoguery. Now that the system has been gamed, that comfort and confidence is very much in danger.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449759341", "commentID": 16915435, "userID": 25737924, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16915435}, {"approveDate": "1449759916", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449759916", "permID": "16913035", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "MM", "commentTitle": "<br/>", "commentBody": "I have been a registered Republican since I was at 18, and this party doesnt reflect my views anymore. We are a great country that has flourished due to immigration, attracting the best and the brightest. The vitriol expressed by Trump, and implicitly endorsed by most of the field is detestable. If its Ms. Clinton versus Mr. Trump, it wont be a close vote for me. I am not a fascist and I wont aid and abet the election of a fascist.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449747274", "commentID": 16913035, "userID": 35219385, "recommendations": 265, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913035}, {"approveDate": "1449764294", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449764294", "permID": "16913063", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Commerce MI", "parentID": null, "userDisplayName": "Jackie Shipley", "commentTitle": "<br/>", "commentBody": "The GOP is just embarrassed because Trump does not use the code words and dog whistles of the right to get the base riled up.  He comes right out and says exactly how they all think and feel.  The GOP created this monster and like Dr. Frankenstein, cannot kill it.  The fact that almost every GOP leader (to date) has come out and said they would support Trump if he gets the nomination, speaks volume to the values and ethics of the right.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449747618", "commentID": 16913063, "userID": 35210453, "recommendations": 152, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16913063}, {"approveDate": "1449767369", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449767369", "permID": "16914955", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Flagstaff", "parentID": null, "userDisplayName": "James", "commentTitle": "<br/>", "commentBody": "The NYT is right on target with this, but the problem goes way beyond the selective examples of nativism the Times cites. Think of the whole storm around Obama's birth certificate or the persistent belief that he is a Muslim (time to recall Colin Powell asking why it should even matter). I understand that citizens are fearful, and I wish my fellow citizens would understand the fears of those of us who feel terrorized by all mass shootings whoever is behind the gun. But, the fear driving Trump's followers wasn't born from the recent terrorist attacks or rise of ISIS, or even from a post-9/11 psychosis, it's a deep fear of a changing America, racially, ethnically, and religiously; culturally; economically. Leadership should be about smoothing the way for change and making sure people are not left behind or isolated. It shouldn't be about stoking fear for personal and political gain.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449757693", "commentID": 16914955, "userID": 66222588, "recommendations": 103, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16914955}, {"approveDate": "1449767782", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449767782", "permID": "16914998", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Pasadena, CA", "parentID": null, "userDisplayName": "Vivian", "commentTitle": "<br/>", "commentBody": "I want to applaud the NYT for saying what needs to be said not only about Donald Trump and his candidacy, but the Republican Party as a whole. The fearmongering and inciendiary speech is not new to our culture or history, but it is absolutely unacceptable. Yesterday on NPR was an interview of a Japanese man who was interned with his family for 4 years during World War II. Hearing his story moved me to tears. Donald Trump's rhetoric is taking us to that dark place once again. I have to believe the American people will rise up and loudly and unequivocally say no. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449757860", "commentID": 16914998, "userID": 61360894, "recommendations": 75, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16914998}, {"approveDate": "1449768057", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449768057", "permID": "16915740", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Diego", "parentID": null, "userDisplayName": "Bruce Higgins", "commentTitle": "<br/>", "commentBody": "I think we should thank Mr. Trump.  His temper tantrums and bigotry are forcing us to take a hard look at what we value as a country and what we look for in a leader of our country.<br/><br/>For my part I want a leader that rejects the politics of fear and division, one who inspires our country to be better than we are now, who knows that it is our diversity that makes us stronger than we would be separately.   A leader that knows that it is service to our country which is important in the job of President, not an opportunity to fill his/her ego or bank account.  A leader that accepts that equal opportunity, not necessarily equal outcomes, is a founding principle of our nation.  A leader that will defend the weak and succor the needy, both at home and abroad.  Where others around the world use their differences to tear their nation apart and export fear and hatred, we know that like a steel alloy, it is our differences that make us strong.  What may seem to others to be a acrimonious argument, is how we air differing views and arrive at consensus. <br/><br/>I utterly reject the politics of fear, hatred, separatism, and me first.  I want a leader who sees all of our faults and knows we can be better anyway.  One who will demand that we fulfill the promise our our founding fathers 'with liberty and justice for all.' ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449760492", "commentID": 16915740, "userID": 58146393, "recommendations": 70, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16915740}, {"approveDate": "1449768271", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449768271", "permID": "16914301", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersy", "parentID": null, "userDisplayName": "Ultraliberal", "commentTitle": "<br/>", "commentBody": "Lets put things in perspective. To begin with, Trump is not a bigot, &amp; he is not a Politician, and does not have the slickness of a Politician . He speaks like a street Kid which endears him to the common people.He has a major disadvantage running for President,as he does not have any governmental background. The only way he could get attention is to feed off the fear of the public.Unfortunately, this approach has been used by despotic tyrants since time began. He is put himself in the company  of some of the most hated people in History, where he doesn't belong.If he would have presented himself as what he really is, his profile would be quite different than what he is depicted by his rivals &amp; the media.He is a master builder, he is secular, &amp; he is progressive, one would say he's more of a Democrat then a Republican.<br/>He like many of the Democrats I know, have become disenchanted with the radical liberalism that has taken over the Democratic Party, especially since Obama took office.If the Republicans were wise they would embrace him. He may not get the minority vote , but he would get the majority of the independent vote &amp; the moderate Democrat vote, which will more than make up for the loss of the minorities, who would not vote Republican anyway.As a life long Democrat I would vote for my fellow New Yorker Donald Trump.I must have touch a New York Times nerve, they won't let me submit my comments.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449755160", "commentID": 16914301, "userID": 56907400, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16914301}, {"approveDate": "1449769481", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449769481", "permID": "16916268", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Luomaike", "commentTitle": "<br/>", "commentBody": "Part of me can accept that Trump’s messaging appeals to the insecurities and fears of a certain portion of the electorate.  What I can’t for the life of me figure out is why that electorate goes for Trump the man, since he has nothing but disdain for the people who would form his constituency (he even said as much in Iowa).  Intellectually, he’s a pretty dim candle on the birthday cake, and he has developed his business in fluff areas like gambling and luxury real estate with no history of public service of any kind.  He flaunts his helicopters, jets, properties, etc. as the primary evidence of his worthiness to lead.  Really, this kind of person is going to care about the common person?  Compare Trump to someone like Bill Gates, who is a bona fide genius, started a business that revolutionized human communication and the global economy, and has devoted a large portion of his wealth to advance health in areas of unmet need around the world.  I’m not saying the Gates is the best choice for President, but I would vote for him in a heartbeat over Trump.   But I guess he doesn’t shout loudly enough.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449762637", "commentID": 16916268, "userID": 66053346, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16916268}, {"approveDate": "1449770587", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449770587", "permID": "16917923", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Fairfax, VA", "parentID": null, "userDisplayName": "Salman", "commentTitle": "<br/>", "commentBody": "Trump is not some bizarre aberration of the conservative movement.<br/><br/>He's the natural consequence of decades of fear and hate mongering, bigotry and zealot like nationalism at the expense of all decency and morality.<br/><br/>The GOP problem with Trump is not that he doesn't represent their views.  It is that he represents their views perfectly - in such a manner that there is no way to veil the nastiness that fuels the American conservative movement.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449768970", "commentID": 16917923, "userID": 66998948, "recommendations": 77, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16917923}, {"approveDate": "1449770604", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449770604", "permID": "16917340", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "TX USA", "parentID": null, "userDisplayName": "RK", "commentTitle": "<br/>", "commentBody": "  What is scarier than Trump's comments is the fact that he is still topping the polls, which means the public opinion is backing him. If this is just an election gimmick then it can be overlooked, but if Trump is going to act on his election promises, then we have a problem. The puzzle is , we don't know if he is serious about his comments. Now every presidential hopeful could get bolder and make  racier comments to score brownie points. What is even more worrisome is that this effect could percolate down to the people - political and apolitical - and they could take a leaf out of their leader's book.<br/>After that what effect could it have on the American Muslims is anyone's guess.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449766608", "commentID": 16917340, "userID": 31260589, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16917340}, {"approveDate": "1449770742", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449770742", "permID": "16912733:16915459", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "GEM", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "flyover land", "parentID": 16912733, "userDisplayName": "prettyinpink", "commentTitle": "<br/>", "commentBody": "With over 30 state houses and governorships held by the hated Republicans, both houses of the congress, and the Democrats on the verge of losing the presidency, I find you claim of the impending death of the Republican party to be vastly overstated.  ", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449759426", "commentID": 16915459, "userID": 59008462, "recommendations": 8, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16915459}, {"approveDate": "1449771187", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449838453", "permID": "16918231", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "America", "parentID": null, "userDisplayName": "Colin", "commentTitle": "<br/>", "commentBody": "I'm the leader of my household. If I were running a massive deficit, had negative cash flow, and survived almost exclusively on loans, I wouldn't be inviting people over for dinner.<br/>I believe in the great melting pot, but I also believe in sanity. We need to get the American 'house' in order before allowing ANY immigrants into our nation. The immigration program should be put on hold until we can adequately take care of the population that is already here.<br/>I'm from Connecticut. I live next to the city of Bridgeport. Bridgeport shares a common trait I have seen in cities in every state I have visited; it is crumbling. Bridgeport is filled with outdated public facilities, abandoned warehouses, people suffering in poverty, drug use, and crime. Dannel Malloy wants to bring 1,600 Syrians to my state. I guess he figures 1,600 more people living on government handouts won't make much of a difference.<br/>This also completely ignores the intelligence we are getting from Europe that at least 1% of the immigrants from the middle east will be radicalized. So 1,600 new people living on food stamps in government sponsored housing and 16 ISIS fighters.<br/>\"Here is $1,000 to get you started. And here are the keys to your new apartment. Your government subsidy will arrive on the 15th of each month, as will your food stamps. Your housing stipend to get furniture will arrive shortly. The home depot is just down the road. You can get 85% of what you need to make a bomb there. Welcome to America.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449770502", "commentID": 16918231, "userID": 73662235, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16918231}, {"approveDate": "1449773298", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1449773298", "permID": "16913261:16918552", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "London, ON", "parentID": 16913261, "userDisplayName": "Darren Chapman", "commentTitle": "<br/>", "commentBody": "That Trump's comments spring from \"an understandable concern that we're not sufficiently vetting immigrants for ties to ISIS...\", completely misses the point for most Americans -- its not the enemy from afar that you should be worried about, but those within.  Immigration of Syrians (or Muslims) who are trying to escape exactly what most Americans (or Western democratic citizens) fear are not the concern - its those within the borders who have more free reign and access to weapons than any immigrant does.  You can lock out the ones coming in (and ironically, they have the most security assessment of anyone), but the folks who are you are America's problems and are bigger than you realize -- and the world is now watching and assessing what freedom really means in America.  As a Canadian, I wish your nation well, as what methods and consequences will affect Canada in some way -- but I certainly am glad that we replaced our tyrant leader earlier this year and I hope you'll not elect one.  This is lunacy -- freedom of one does not come at the expense of another's -- both can be free.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449772536", "commentID": 16918552, "userID": 57667921, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16918552}, {"approveDate": "1449774738", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449774738", "permID": "16917752", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hoboken, NJ", "parentID": null, "userDisplayName": "c kaufman", "commentTitle": "<br/>", "commentBody": "Something changed in American politics over time, and it’s not just the singular demagogues that dominate the stage today. Deregulation in banking returned us to market manipulation and system collapse in ‘08, deregulation in elections and media have brought 1930s political manipulation back. There is real misery and low expectations on Main St., but Washington is too self-absorbed in personal aggrandizement. Demagogues are used to distract and deflect accountability.<br/><br/>Many talking heads on TV have long been parroting party doctrine for the audience in news, not discussing it with any rational detachment. Party affiliated cable TV news has paper-thin walls between the press and the parties’ propaganda machines. Put aside the proto-fascist stuff we hear from Trump, listen to one question they asked Bernie Sanders in a debate, “Are you a capitalist or a socialist?” It’s a false choice.<br/><br/>Capitalism is a system for running markets and banks, not a form of democratic government. A capitalist IS a banker or financier, not any voter or a senator who believes in it. Examples abound where the government is the corporation, but not in a democracy. Socialism can be a code word for Soviet style communism, or the publically managed not-for-profit stuff that’s existed for a century or more, as in Medicare, the FDA, and public schools. Which is it?<br/><br/>We should get a US psychiatrist general (like the surgeon general) to write a warning that viewing political debates &amp; ads are bad for you.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449768185", "commentID": 16917752, "userID": 39553902, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16917752}, {"approveDate": "1449777320", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449777320", "permID": "16919164", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "West Coast", "parentID": null, "userDisplayName": "Gonzo", "commentTitle": "<br/>", "commentBody": "I agree that the time to denounce Donald Trump's views was the day he entered the race but instead, our culture responded by treating him as some sort of political funnyman when he should have been regarded as a hateful, dangerous bigot.  He was celebrated on NBC while hosting Saturday Night Live while skits were shown over and over on various TV news programs and media personalities yucked it up and slapped their knees with laughter.  Donald Trump is the culmination of years of malicious and malevolent Repub lican rhetoric that snowballed into the party of intolerance and hate that we see today.  Trump has become the ultimate Ugly American who is supported by ugly Americans.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449776246", "commentID": 16919164, "userID": 23485937, "recommendations": 40, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16919164}, {"approveDate": "1449780295", "commentType": "comment", "userTitle": "NULL", "updateDate": "1449780295", "permID": "16919636", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "jbtingstad", "commentTitle": "<br/>", "commentBody": "I write this on behalf of my students as I read that Georgia wishes to deny students like mine access to an education.<br/><br/>I am a retired professor with thirty-eight years of experience, who was offered a part-time  position teaching middle school \"internationals\" European history and an honors essay course.  English is their only common language.  And I'm a native speaker, never mind my field was not European history.  Or teaching the delights of writing essays in English.<br/><br/>These have become, in the past seven years, my people.  And more than half are Muslims.  But I've learned that middle schoolers are just that.  Girls more emotionally developed than boys.  One occasionally has to bully them into getting down to work.  The majority complain about the school food.<br/><br/>Most work very hard.  Harder than a many of the \"natives\".  I'm not sure if they're trying to prove anything.  I think they just want to make their way.  And they know (as do many of their parents) that it's all up to them.<br/><br/>I've come to the point where I don't think much about religion and my students,  I did at first, as one can't miss the dress many display.  But not now.  They're just my \"kids\", who stop me in the halls or after class with questions or comments... and smiles.<br/><br/>Georgia?  You're missing out if you deny people like my kids.  Give it a chance for people to get to know them.  Other students are missing out.  Teachers likewise of the experiences I've had.  To deny them is to deny everyone.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1449778684", "commentID": 16919636, "userID": 23251246, "recommendations": 58, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 16919636}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 784, "api_timestamp": "1488822372", "totalReplyCommentsFound": 254, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}