{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 3, "totalParentCommentsReturned": 22, "totalParentCommentsFound": 1084, "totalEditorsSelectionFound": 27, "depthLimit": 0, "totalRecommendationsFound": 767, "comments": [{"approveDate": "1480469889", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480525629", "permID": "20646725", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 37, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Clawson, Mich", "parentID": null, "userDisplayName": "Mark Thomason", "commentTitle": "<br/>", "commentBody": "Of course what Trump said is nonsense.<br/><br/>I am more worried that major media are also supporting censorship, in the form of corporate actions to stop \"fake reporting\" with an algorythem meant to define and ensure only \"true\" reports.<br/><br/>In addition, there is a list being circulated of news to blacklist. I'm sure there are some deserving candidates, but I also remember what happened the last time we blacklisted people. McCarthy.<br/><br/>I am still more worried about the attempts at censorship and blacklisting because McCarthy tactics like red baiting were a major feature of Hillary's campaign, anyone who did not like her was a Putin-bot or hated women or was just racist, or all of the above.<br/><br/>We must correct course, and the usual \"good guys\" are leading the way in the wrong direction, even while warning off Trump from doing what they are doing even as they warn him.<br/><br/>So yeah, let's be more careful of the Constitution, all of us.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3767/4938/cropped-37674938.jpg?0.41398809710517526", "createDate": "1480469857", "commentID": 20646725, "userID": 37674938, "recommendations": 259, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20646725}, {"approveDate": "1480500366", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480500366", "permID": "20646911", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 15, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "GF", "commentTitle": "<br/>", "commentBody": "Do we know whether Donald Trump has even read the Constitution? Perhaps one of the legal scholars he admires, or one of the many lawyers around him, could walk him through it. To get the ball rolling, I'd suggest ordering a copy of the Constitution online and having it shipped to the President-elect at Trump Tower. Pocket-sized editions are available for as little as $1; leather-bound versions with gold-embossed covers of the sort Mr. Trump might favor cost more, but in this case (as with so many gifts), it's literally the thought that counts. If a few thousand of us do the same thing, perhaps Mr. Trump would finally come to understand that this great document is what Makes America Great.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480470921", "commentID": 20646911, "userID": 468951, "recommendations": 579, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20646911}, {"approveDate": "1480504914", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480518957", "permID": "20647150", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 28, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Montreal, Canada", "parentID": null, "userDisplayName": "David Brown", "commentTitle": "<br/>", "commentBody": "This is a very tough test of the first amendment.  People who burn their flag essentially reject the very foundations of their country and declare that the country is not sufficient well governed and principled to include them.  In my view, as a Canadian, burning the national flag is a very serious issue and the good intentions of those who do so are open to questions.  This may merit placing their citizenship on hold.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480472066", "commentID": 20647150, "userID": 61173392, "recommendations": 6, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647150}, {"approveDate": "1480505528", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480518980", "permID": "20647150:20650037", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": "David Brown", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new jersey", "parentID": 20647150, "userDisplayName": "gailweis", "commentTitle": "<br/>", "commentBody": "This is America.  We don't place citizenship on hold.  We value our free speech, no matter how much we may abhor the words and actions of some of our citizens.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480505485", "commentID": 20650037, "userID": 4608288, "recommendations": 351, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20650037}, {"approveDate": "1480505737", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480505737", "permID": "20647292", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SE Michigan", "parentID": null, "userDisplayName": "MikeInMi", "commentTitle": "<br/>", "commentBody": "Many in media seemingly like easily digestible, overly simplistic catch-phrases that describe hugely complex and multi-layered issues, so here's one you're going to love: post-Constitutional. Get used to it, because in spite of Trump's and the GOP's professed love for the document, most everything they propose of any significant moment is going to, at the very least, rub up against its protections and proscriptions. <br/><br/>You may even wish to add post-democratic to your lexicon, as it will prove equally handy. Good luck with this guy, for unless you understand that he will require an entirely new dynamic and approach to reporting what he does, we all will be truly lost. That's something that you should have realized long ago--long before he ever became a reality beyond the television show where he learned his stock in trade and half country learned to think him a buffoon.<br/><br/>I will say the Times has done far better than most the media at explaining Trump, especially of late, so it will be up to you to reach and teach the rest of the media what must be done: dispel notions of false equivalencies as being tantamount to fairness; clearly call lies just what they are; and for goodness sake, stop chasing the bright, shiny object that usually presents itself in the form of a tweet. Focus on what the man is actually doing.<br/><br/>I would wish you luck in this effort, but we need more than luck; we need the absolute accomplishment of the task he has set before you. The nation depends upon it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480472805", "commentID": 20647292, "userID": 16529673, "recommendations": 711, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647292}, {"approveDate": "1480514646", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480514646", "permID": "20649999", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lewiston, Maine", "parentID": null, "userDisplayName": "Jim Howaniec", "commentTitle": "n/a", "commentBody": "I'm 58 years old. I've finally just given up on this country. It is just so hopelessly broken. The winner of the presidential popular vote is the loser.  The party that wins the most popular votes in House raises loses the most seats because of gerrymandering.  Money continues to suffocate democracy.  A mentally unbalanced man is president. It would have been a silver lining if he had at least come in and drained the swamp, but instead he is bringing in the most extreme right wingers from the establishment. Most painfully, we are about to lose the Supreme Court for a generation. Voting rights will be under even greater attack. Women's reproductive rights will be gone. The environment will continue to be jeopardized. And that's the least of our worries, should this madman unleash the nuclear codes.  People in this country are just hopefully torn apart. I have no more in common with Ted Nugent and the Tea Partiers in Cngress than I do with aliens from Mars. I'm done investing my care into this country. I'm going to look out for myself and my family, maintain my little home, and hope the whole thing doesn't just blow up. We are about to experience a massive tyranny of the majority unleashed in a terrifying manner. This country is hopelessly broken.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480505102", "commentID": 20649999, "userID": 68128943, "recommendations": 623, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20649999}, {"approveDate": "1480518157", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480518157", "permID": "20649469", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Istanbul", "parentID": null, "userDisplayName": "Veli", "commentTitle": "<br/>", "commentBody": "The freedom afforded by the US Constitution and consequently its interpretation and its implementation (by the courts) is both commendable and worth defending. If burning the flag is explicitly allowed as a way of expressing ones opinion it also expresses many other things as well. It lets everybody know that the freedom is not on shaky ground. It lets everybody know that there is strength behind the accepted ways and that the freedom and its established order is unshakable. It gives the message that what is claimed is also meant - that one really can express ones opinion so long as no one gets hurt. This is something worth living up to and also defending.<br/><br/>It gets shaky however when these ideals become only relevant depending on the person wanting to rattle on it. I can remember no outrage of this level when Hillary Clinton co-sponsored the (failed) Flag Protection Act of 2005 where the law would have prohibited burning or otherwise destroying and damaging the US flag (even with a possibility of a prison term). Nor can I remember this ever being a topic here on the NYT Editorial during the elections that would disqualify HRC. Where was the outrage then?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5915/0148/cropped-59150148.jpg?0.9138059796552701", "createDate": "1480495231", "commentID": 20649469, "userID": 59150148, "recommendations": 34, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20649469}, {"approveDate": "1480518542", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480518542", "permID": "20652804", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Hopewell, NJ", "parentID": null, "userDisplayName": "Judy Livingston", "commentTitle": "<br/>", "commentBody": "I am forever grateful that the Constitution guarantees freedom of speech, including burning the flag as a protest.  However, I don't think burning the flag is a good form of protest.  It's kind of a horrifying image, and, for me at least, works against the protest, even if I agree with the cause.  Flying the flag upside down is a symbol of distress, but that's supposed to be done only in cases of imminent danger.  For me,  the best expression of free speech is actual speech, because the word and and pen are both mightier than the flame.  <br/><br/>What I find most horrifying in this instance is the President elect's ignorance of, or disregard for, the Constitution.  If he actually tries to strip citizenship or jail someone for burning a flag, perhaps then we actually should fly the flag upside down.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480517743", "commentID": 20652804, "userID": 67861195, "recommendations": 163, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20652804}, {"approveDate": "1480518680", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480518680", "permID": "20650216", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Denmark", "parentID": null, "userDisplayName": "Morten", "commentTitle": "<br/>", "commentBody": "In Denmark, it is illegal to desecrate the flags of foreign countries as well as the flags of the United Nations and Council of Europe, but legal to burn the Dannebrog, Denmark's national flag, according to section 110(e) of the Danish penal code because Parliament has decided that burning other countries' flags is a matter of foreign policy, as it could be construed as a threat.<br/><br/>According to Danish tradition, burning is actually the proper way to dispose of a worn flag. According to tradition, care must be observed to ensure that a flag never touches the ground, i.e., even when being disposed of, it should be placed on top of a fire. Flying the flag after sundown is also inappropriate behaviour.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480506748", "commentID": 20650216, "userID": 28995234, "recommendations": 51, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20650216}, {"approveDate": "1480519027", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480519027", "permID": "20647150:20650171", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David Brown", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salem, OR", "parentID": 20647150, "userDisplayName": "Dick Yates", "commentTitle": "<br/>", "commentBody": "Burning a flag is a symbolic act. What it symbolizes depends on the intent of the person doing it.  David Brown says that \"People who burn their flag essentially reject the very foundations of their country and declare that the country is not sufficient well governed and principled to include them.\" <br/><br/>But, he is simply making this up.<br/><br/>Historically, the primary purpose of the First Amendment was to protect criticism of the government in particular. And the intent of doing this by burning a flag could very well be to protest the government's abandoning of its \"very foundations.\" <br/><br/>I do think, however, that burning a \"Make America Great Again\" hat would be less likely to be misinterpreted.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480506462", "commentID": 20650171, "userID": 65614836, "recommendations": 216, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20650171}, {"approveDate": "1480519088", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1480519088", "permID": "20647150:20650494", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David Brown", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "oregon", "parentID": 20647150, "userDisplayName": "cyninbend", "commentTitle": "<br/>", "commentBody": "The flag is merely a piece of fabric that stands for something much greater.  The person who destroys that fabric actually exercises the rights that flag stands for.  Americans try to have patience with the fellow citizen who does not quite get this relationship.  For all he does is damage a representation of something--not the thing itself.  But were we to punish him for that act, we'd be the ones destroying one of the most important things for which that fabric stands.  <br/><br/>We always have had the Supreme Court to help us understand this and other difficult concepts when we fell short.  Let's hope that institution is preserved!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480508435", "commentID": 20650494, "userID": 66679742, "recommendations": 108, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20650494}, {"approveDate": "1480519265", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480519265", "permID": "20648372", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Sarah Maywalt", "commentTitle": "<br/>", "commentBody": "The First Amendment is, in my mind, what makes America, America. Its pure progressive idealism has been mimicked, but never truly reproduced. It is the bright light that allowed our country to overcome much of its darkness, some of which embarrassingly enshrined in other parts of the same document. In my opinion, there is nothing more patriotic than exercising the rights granted in the First Amendment, and that includes burning an American flag to make a point. The fact that we are allowed to show our uncensored rage at our own country is one of America's greatest strengths. America is not just the home of the brave. America is brave. <br/><br/>Mr. Trump made \"Make America Great Again\"  his campaign slogan, but he clearly knows nothing about what has made America great. If he plans to take away my First Amendment rights away from me, he may as well take my citizenship too, because at that moment the America I love, the great America, will be dead. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5849/4347/cropped-58494347.jpg?0.646166778402403", "createDate": "1480479558", "commentID": 20648372, "userID": 58494347, "recommendations": 164, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20648372}, {"approveDate": "1480519290", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480519290", "permID": "20648909", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Pasadena,CA", "parentID": null, "userDisplayName": "Charlotte W.", "commentTitle": "<br/>", "commentBody": "Mr. Trump needs to reread his Constitution carefully before taking the Oath.  His seeming disrespect for the Constitution is more scary than some of his Cabinet nominees.  While  I agree with many that the Trump ego is fragile, he must understand that the Constitution and the government he wants to lead are not subject to his every whim.  There are rights in the Constitution that not subject to removal simply because their exercise does not please him.  Lawrence v. Texas (Flag burning) is an exercise of rights that he, Trump, has made extensive  brutal use of during his campaign and transition.  Failure to respect those rights is a clear indication of one's desire to reign, not to govern.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480484153", "commentID": 20648909, "userID": 61138065, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20648909}, {"approveDate": "1480519758", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480519758", "permID": "20648726", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "womanstruth", "commentTitle": "<br/>", "commentBody": "I actually don't believe his tweet is based on a lack of knowledge of the constitution at all. It is setting us up. He is saying that some forms of presently protected political speech \"must be punished\". He suggests that maybe it could and should lead to \"loss of citizenship.\" Note that both burning of the flag and citizenship as irrevocable are based on Supreme Court decisions. The latter appears to have been hotly debated across a ten year period with the court reversing itself in that time. The President-Elect will be putting someone on the Supreme Court to make it a conservative majority. His tweet can be viewed as hyper-nationalism, similar to the suggestion of a Muslim registry. He is speaking this on the same day he's announcing dates for his new \"Thank you\" rally tour. This is not a coincidence in my opinion. It is tactical.<br/><br/>We must strongly consider the possibility that these planned rallies are not simply to inflate Mr. Trump's ego as some have suggested. He'll use them to fan the flames of his base with this kind of White Nationalist rhetoric because an autocrat in a democracy needs a fervent base to protect his rule as he takes apart the country's freedoms. All while appearing to be a defender of its symbols. In other words, he needs a fervent base until he doesn't anymore.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480482476", "commentID": 20648726, "userID": 44605734, "recommendations": 159, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20648726}, {"approveDate": "1480519801", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480519801", "permID": "20653283", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Greenville, NC", "parentID": null, "userDisplayName": "Jonathan Dembo", "commentTitle": "<br/>", "commentBody": "I think President-Elect Trump hit the nail on the head.  I much prefer to have a president whose blood boils at the desecration of the American flag, and who is intemperate in defense of it, than to have one who can listen to his minister rant \"God Damn America\" for several decades without responding, and who seems entirely dispassionate about the country he leads.  I don't think that Trump was making laws or violating the Constitution in making his remarks;  I doubt whether he plans to pursue legislation to punish flag burners;  it would likely be impossible to get such a measure through Congress and the Courts, anyway;  but Trump showed that he feels what every American ought to feel when they see or hear that the flag has been insulted.  I think that was Trump's goal and he achieved it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480519365", "commentID": 20653283, "userID": 56198239, "recommendations": 11, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20653283}, {"approveDate": "1480519881", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480519881", "permID": "20651513", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Michael L.", "commentTitle": "<br/>", "commentBody": "Yep it is an ugly and reprehensible statement, reminds me so much of Hillary Clinton's statements about flag-burners over the past 2 decades and her attempts to push forward a constitutional amendment to punish this form of protected free-speech. It was one of the reasons I often cited to fellow liberals as to why I was lackluster on my support for Hillary Clinton. The blank stares I got in return proof that Democrats have a real blindness when their own undermine the constitution. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480512923", "commentID": 20651513, "userID": 46548182, "recommendations": 30, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20651513}, {"approveDate": "1480520311", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480520311", "permID": "20653018", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Francisco", "parentID": null, "userDisplayName": "Jim Wigler", "commentTitle": "<br/>", "commentBody": "The delightful editorial board of the New York Times again bumps up against the brutal common sense of President Elect Donald J. Trump. I believe the mean and narrow emotional renderings of the board must exhilarate Mr. Trump in the same way they animate me. Donald Trump speaks to me, he delivers judgments of my own mind and he resonates with the innermost sensations of sixty million Americans. The confused reflections of the editorial board, the absurdities of their perceptions and their vulgar contemptuousness for the President Elect and half the American people inspire us all with the rapture of knowing we must be right.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480518478", "commentID": 20653018, "userID": 74232466, "recommendations": 13, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20653018}, {"approveDate": "1480521020", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480521020", "permID": "20649301", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Scotland", "parentID": null, "userDisplayName": "Qrt", "commentTitle": "<br/>", "commentBody": "I am an alumn of Hampshire College, where the event to which he is referring occurred. As is befitting an institution of higher education, it has had an open process of discussion on this issue, even while being attacked with juvenile and dangerous rhetoric. At Hampshire, students are taught to value critical thought and inquiry, respect for difference of opinion, and the value of freedom of thought and expression. Perhaps Mr. Trump could use of dose of this... It might help him understand that we have a little thing called the Constitution which prohibits what he says he wants to do and guarantees speech he does not like (and also guarantees that he can make outrageous - indeed offensive - pronouncements).", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480490845", "commentID": 20649301, "userID": 41286664, "recommendations": 65, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20649301}, {"approveDate": "1480522870", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480522870", "permID": "20647910", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": null, "userDisplayName": "Joe", "commentTitle": "<br/>", "commentBody": "Within the editorial, mention is made of a federal law against flag burning.  That law was passed by the Senate and House, and signed by the President in 1989.  That law was in response to the Supreme Court decision Texas Vs. Johnson.  The new law was challenged in United States vs. Eichman, and ruled unconstitutional.  A constitutional amendment exempting desecration of the flag from protected free speech was proposed, but did not gain sufficient support to continue.<br/><br/>Based on the above, criminalizing desecration of the flag was a popular, and reasonable position of a great many leaders and legislators.  This is not the opinion of a troll or a crazed madman, but a very popular position.  In fact, there are many that believe the Supreme Court was wrong in its decision, as it was in many others.  The Supreme Court has never been deemed infallible.  <br/><br/>Tone it down, NYT.  Your vitriol and hate for Mr. Trump is neither newsworthy, nor professional.  I believe the term \"yellow journalism\" is all that is left to describe such ingenuous opinion. As an editorial board, I believe you have once again misjudged the volume of souls that do not share your view from your ivory tower.  Millions, perhaps the majority, believe desecration of the flag should be banned as free speech.  Your attempt to paint Mr. Trump as a lone troll is clearly a politically motivated hatchet job.   Shame on you.     ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480476477", "commentID": 20647910, "userID": 78000424, "recommendations": 15, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647910}, {"approveDate": "1480523097", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480523097", "permID": "20647912", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Denver", "parentID": null, "userDisplayName": "Josseline", "commentTitle": "<br/>", "commentBody": "Mr. Kahn offered his copy of the Constitution....it's time Mr. Trump reads it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480476488", "commentID": 20647912, "userID": 51493432, "recommendations": 139, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647912}, {"approveDate": "1480524220", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480524220", "permID": "20647929", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "Mike", "commentTitle": "<br/>", "commentBody": "Somebody either wake me up, or sign me up for the next flag-burning party.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480476563", "commentID": 20647929, "userID": 59983857, "recommendations": 53, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647929}, {"approveDate": "1480524337", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480524337", "permID": "20647987", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Manhasset", "parentID": null, "userDisplayName": "HilaryC", "commentTitle": "<br/>", "commentBody": "My Uncle, Silver Star recipient for a battle in Nazi Germany, was the first to cut a Nazi flag down in a small town in Germany after seeing his troop dwindle to 300 from 3000. He taught me that America is worth fighting for because its citizens CAN burn the flag without fear if and when they feel the need to. That is what freedom is. We should be more concerned with WHY anyone would want to. \\\\\\", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480476917", "commentID": 20647987, "userID": 77759085, "recommendations": 109, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20647987}, {"approveDate": "1480524434", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480524434", "permID": "20648070", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Kansas", "parentID": null, "userDisplayName": "Robert", "commentTitle": "<br/>", "commentBody": "Freedom of speech is one thing; desecration of the American flag is another. Untold thousands have been maimed and killed to defend that flag. Those who choose to dishonor that sacrifice should pay a price, but certainly not forfeiture of their citizenship. A substantial fine would seem appropriate for the first offense, and a little time in jail for further transgressions.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480477448", "commentID": 20648070, "userID": 32522667, "recommendations": 9, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20648070}, {"approveDate": "1480535114", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480535115", "permID": "20654806", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Basking Ridge, New Jersey", "parentID": null, "userDisplayName": "John Marlin", "commentTitle": "<br/>", "commentBody": "I'm an Army veteran of 14 years service, and I agree completely that one of the rights we were defending was the right to burn the flag: it's protected expression and that we consider it so says something important and special about our nation.<br/><br/>I find it ironic though, that those who want to exercise that right do so by desecrating the symbol of the national constitution that affirms that right.<br/><br/>I was highly disappointed, the last time that this came to a vote, that one of my Senators, Robert Menendez (D-NJ) voted with so many others to criminalize the act, as did a certain Senator from the state of New York.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480526689", "commentID": 20654806, "userID": 78008125, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20654806}, {"approveDate": "1480539155", "commentType": "comment", "userTitle": "NULL", "updateDate": "1480539155", "permID": "20655092", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Howard Godnick", "commentTitle": "<br/>", "commentBody": "\"140 Character President\"<br/>The presidency is a sobering office<br/>With pressures and so many factors<br/>The dignity it deserves and demands<br/>Is diminished in 140 characters<br/><br/>The election at times indeed got quite rough<br/>Leaving half of our country quite bitter<br/>But the duties you fought so fiercely to win<br/>Cannot be discharged on Twitter<br/><br/>So put down the phone and consider a briefing<br/>The world's issues are hardly discrete<br/>'Cause climate change, terrorism and poverty<br/>Cannot be cured with a simple retweet ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1480528148", "commentID": 20655092, "userID": 12988652, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20655092}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1662, "api_timestamp": "1488822358", "totalReplyCommentsFound": 578, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}