{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 2, "totalParentCommentsReturned": 8, "totalParentCommentsFound": 148, "totalEditorsSelectionFound": 10, "depthLimit": 0, "totalRecommendationsFound": 200, "comments": [{"approveDate": "1452312848", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452350291", "permID": "17166162", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Clawson, Mich", "parentID": null, "userDisplayName": "Mark Thomason", "commentTitle": "<br/>", "commentBody": "No more gun free zones? Does that include the Capitol Building? The White House? The Courts? Or is it only places where President Trump would not be?<br/><br/>Obama did something thoughtful and smart. Trump's talk is the opposite.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3767/4938/cropped-37674938.jpg?0.41398809710517526", "createDate": "1452312821", "commentID": 17166162, "userID": 37674938, "recommendations": 389, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17166162}, {"approveDate": "1452340484", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452348693", "permID": "17166643", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new Jersey", "parentID": null, "userDisplayName": "Babel", "commentTitle": "<br/>", "commentBody": "\"My first day. There’s no more gun-free zones.”<br/><br/>Certain things totally and completely defy logic.  Every law enforcement officer in the U.S. should be appalled by such a statement.  If that were to come to pass when mass shooting occur and first responders arrive at a scene in a school the first thought in every police officers' mind would be everyone could be  packing.  When we witness the hair trigger response of certain cops in urban settings, we can only imagine in scenes of mass confusion the kind of wild west scenario that could ensue.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452320344", "commentID": 17166643, "userID": 48307985, "recommendations": 165, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17166643}, {"approveDate": "1452340507", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452354107", "permID": "17167475", "status": "approved", "trusted": 1, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Waltham, MA", "parentID": null, "userDisplayName": "Christine McMorrow", "commentTitle": "<br/>", "commentBody": "\"A near giddy investment manager hailed the president as “the best gun salesman on the planet,” as if the Republicans, with their irrational campaign warnings, were not the industry’s supersalesmen.\"<br/><br/>Only in America: the pursuit of profits from weapons designed to kill.  It's beyond irresponsible, beyond obscene.  The cowboy culture, which so many of us boomers grew up watching when TV was in its infancy, the belief that nothing's impossible with a gun in hand--has become reality.  \"Annie\" is no longer the only one getting her gun--packing is our birthright.<br/><br/>The biggest sin in my book is the myth created and perpetuated by the NRA and its fawning politicians that any reasonable attempt to treat guns like cars or any dangerous machinery--demonstrated proficiency, licensing, jail time for drunk driving or use--ends up in government confiscation.<br/><br/>Which is because gun purchase and use is based on fear.  Fear of the \"bad\" guy, fear of the \"other,\" fear that somehow we'll be mowed down.  Never mind that no matter how many guns get sold, the danger actually increases, with data correlating with wider gun ownership with increased deaths.<br/><br/>This editorial calls for some leader, any potential elected leader to call the \"Oz-like bluff of the NRA\" and successfully make changes to increase public safety.  Any takers?<br/><br/>I thought not.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2073/520/cropped-2073520.jpg?0.18587254704312467", "createDate": "1452340488", "commentID": 17167475, "userID": 2073520, "recommendations": 209, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17167475}, {"approveDate": "1452340574", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452348581", "permID": "17166544", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Utah", "parentID": null, "userDisplayName": "lostinspace", "commentTitle": "<br/>", "commentBody": "Mr. Trump's bombast is not merely based on his audience's ignorance of the president's actual powers (he's not an emperor, after all) but also on the flat-out lying so common to the Republican response to President Obama's comments. Especially the charge that Obama wants to take away all our guns is outrageous. He has suggested no such thing. Most well-informed \"liberal\" responses to America's gun crisis suggest no such thing. The Republican teeth-gnashing recalls the domino theory that pushed us into such fiascoes as the Vietnam War. These demagogues want \"freedom-loving Americans\" to visualize a tyrannical government progressively picking off their individual rights until they have none left. It has worked in the past for the unthinking, and continues to work even now. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452318172", "commentID": 17166544, "userID": 6331896, "recommendations": 167, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17166544}, {"approveDate": "1452349011", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1452620165", "permID": "17166381:17167185", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NJ", "parentID": 17166381, "userDisplayName": "Dennis Waldron", "commentTitle": "<br/>", "commentBody": "Apparently David, you haven't spent much time with this issue. The underlying discontent with Obama's new rules is not the rules in and of themselves, it is the way these same rules have been attempted over the last 20 years. The erosion factor. I don't believe that there are many gun owner who oppose background checks. What they oppose is the gradual erosion of their rights over a period of years. Think of it this way. each time a politician has tried to enable sweeping gun legislation, he or she has been shot down by the majority of Americans. So, these same politicians try a different tact, they move on a tiny piece of legislation and succeed. They couldn't consume the cookie in one bite, but after many tiny bites the cookie is still gone. In the end, what the gun owners are telling you is that none of these controls will end violence on the streets of America as the government has done NOTHING to disarm the criminal element. What the liberal element fails to realize is that a criminal will not knowingly walk into an environment knowing that the other party is armed. If Obama and these other politicians want to succeed, make facilities available to the general public that teach firearm safety and proper use. No, you won't see immediate improvement - as the populace is generally distrustful of the government and the police - but over time, it will work. Once the criminal element learns that the next home they invade may have an armed and trained occupant.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452335792", "commentID": 17167185, "userID": 73341860, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17167185}, {"approveDate": "1452352241", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1452352241", "permID": "17166381:17168751", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arlington, Texas", "parentID": 17166381, "userDisplayName": "James Lee", "commentTitle": "<br/>", "commentBody": "Dennis, what alternative universe do you inhabit?  What gradual erosion of rights?  The prevailing trend in this country for some years has been a rapid expansion of the freedom of gunowners to tote their hardware in more public places, without any concern for the well-being of the rest of the public.  As for disarming the criminal element, it is the NRA that opposes any effort to restrict gun ownership for any reason.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452350504", "commentID": 17168751, "userID": 63418614, "recommendations": 162, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17168751}, {"approveDate": "1452352305", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452352305", "permID": "17168910", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Williamsburg, VA", "parentID": null, "userDisplayName": "Dennis taylor", "commentTitle": "<br/>", "commentBody": "Of all our Constitutional \"rights\" only that of the 2nd Amendment is argued to be absolute. All others are limited by the concern that absolute rights can, and do ultimately infringe on the rights of others in our democracy. The Second Amendment too is limited by this principle. My right to life, liberty and the pursuit of happiness is not curtailed by another's right to have a gun. It's about time the courts acted to ensure that this is so, otherwise we only live in a society where our freedom can be threatened by anyone with the absolute right to have a gun.  Our future is seen in the mirror of Oregon as we speak. They have guns so they can claim to act for the people,  but I am one of the people and they don't act for me and never will.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452351405", "commentID": 17168910, "userID": 15641207, "recommendations": 142, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17168910}, {"approveDate": "1452353746", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452353772", "permID": "17169171", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mountain View, CA", "parentID": null, "userDisplayName": "Dr. John Burch", "commentTitle": "<br/>", "commentBody": "Where is the discussion of the fundamental, root causes for gun violence? Where is the investigation of why our country has become a world leader in random attacks, and accidental deaths? Why are we so worried about rights, gun sales, ammo, laws and winners and losers, when the real debate should be about the CAUSES for violence, the lack of attention to societal mental wellness, and things like that?<br/><br/>At the very least, these fundamental, root cause issues should occupy a significant part of our consciousness as we attempt to make sense of gun related problems. Education, prevention and changes in culture are orders of magnitude more efficient and long-lasting than legal, regulatory symptom repair solutions. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452353036", "commentID": 17169171, "userID": 60829618, "recommendations": 16, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17169171}, {"approveDate": "1452356823", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452357286", "permID": "17169759", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mass", "parentID": null, "userDisplayName": "JW", "commentTitle": "<br/>", "commentBody": "We need to change the debate language to \"Responsible Gun Ownership\" vs. \"Gun Control\".  After all, who in their right mind is not for Responsible Ownership?  Lets start there. <br/><br/>I am looking forward to the first Presidential debate Republican vs. Democrat and hope this is front and center. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452356612", "commentID": 17169759, "userID": 61371253, "recommendations": 38, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17169759}, {"approveDate": "1452357256", "commentType": "comment", "userTitle": "NULL", "updateDate": "1452357256", "permID": "17169827", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Columbus Ohio", "parentID": null, "userDisplayName": "MJG", "commentTitle": "n/a", "commentBody": "I am the fifth of ten children, who can of age in the 1970s. My oldest brother was killed by his wife, when he told her he wanted a divorce. They had just had a daughter. His wife shot him seven times. My parents, especially my mother, was devestated. My mother wanted to check into the psychiatric ward of a hospital. However, my father told her no and assured my mother that \" we'll make it through.\" My brother was 25-years-old when this tragedy struck our working class family. My brother was three years removed from having returned home from serving in Vietnam. He was injured while walking through a land mine and at the time he was shot and killed at home, he was struggling with the shrapnel that remained in his body from the battlefield of Vietnam. <br/><br/>I cringe when I hear, read, or listen to arguments about 2nd Amendment rights. What about the right of life, liberty, and the pursuit of happiness for Joe or Jane Nobody or Anybody? When did we evolve into this country of gun-crazed, fire off a rifle to cook bacon crazies. <br/><br/>My brother was attempting to move one with his life when it was cut short. The trajectory of our family, especially his daughter, was altered in a manner that none of us requested. I remember my brother's homicide as if it were yesterday. This is the lesson that someone needs to teach a presidential candidate who would dare utter the words of doing away with \"gun-free zones.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1452356965", "commentID": 17169827, "userID": 25145144, "recommendations": 109, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 17169827}], "totalEditorsSelectionReturned": 10, "replyLimit": 3, "totalRecommendationsReturned": 10, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 281, "api_timestamp": "1488822373", "totalReplyCommentsFound": 133, "totalCommentsReturned": 10, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}