{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 612, "totalEditorsSelectionFound": 29, "depthLimit": 0, "totalRecommendationsFound": 881, "comments": [{"approveDate": "1465383872", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465411003", "permID": "18773299", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Princeton, NJ", "parentID": null, "userDisplayName": "Len Charlap", "commentTitle": "<br/>", "commentBody": "I voted for Bernie today. I knew he had no chance of winning, but my hope was that every vote for him would help to persuade Hillary to move towards his positions when those positions are the right ones such as health care, federal spending, and above all, campaign contributions.<br/><br/>I am, however, overjoyed to be able to vote for a candidate as intelligent, experienced and knowledgeable as Hillary in the general election. To those who would smear her with the logic that \"If X is bad and Hillary is for A, then Hillary is bad. If she opposes X, she is lying,\" I say, \"Give her a chance.\" Go to her WEB site. Read her platform. See if you honestly disagree with what she stands for.<br/><br/>Before Trump clinched the Republican nomination, Bernie said, \"On her worst day Secretary Clinton is a hundred times better than any of the Republican candidates.\" I think that knowing that Trump is the candidate, he would change that \"hundred\" to a \"million.\" I look forward to him strongly campaigning, not only for Hillary, but for all the down ticket Democratic candidates.<br/><br/>Let's make this a wave election!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2889/45/cropped-288945.jpg?1428275941928453894", "createDate": "1465351339", "commentID": 18773299, "userID": 288945, "recommendations": 624, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18773299}, {"approveDate": "1465386639", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465391047", "permID": "18773683", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 13, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mordor", "parentID": null, "userDisplayName": "Elfton", "commentTitle": "<br/>", "commentBody": "I voted for Bernie. I voted for Bernie because he is a progressive. <br/><br/>I will not be voting for Hillary Clinton because she is not a progressive. <br/><br/>Feel the logic. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7512/3823/cropped-75123823.jpg", "createDate": "1465353827", "commentID": 18773683, "userID": 75123823, "recommendations": 159, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18773683}, {"approveDate": "1465386767", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465522537", "permID": "18773704", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "orchid99", "parentID": null, "userDisplayName": "ockham9", "commentTitle": "<br/>", "commentBody": "As a life-long (64-year) progressive Democrat, I have supported Sanders through this primary season. I'll certainly vote for Clinton in November, but I still retain the conviction that Sanders' world view is closer to my own. And frankly, I'm tired of hearing Clinton supporters who say that Bernie and the other 10 million who supported him this year should fold their tents and close ranks with the Clinton campaign. In my view, Hillary has a choice now, if she wants to win in November: she can either continue as she has, refusing to acknowledge those to the left of her, or she can make real concessions to the progressive wing of the party and run on a platform that is bold, ambitious, inspiring, knowing that not only will this capture the imagination of those who will be our successors in the next generation, but it will also make the country more egalitarian. If this were a parliamentary government, Clinton would not win a clear majority in the election, and she would need to deal with those who could coalesce to form a majority. That would include major concessions on policy and positions of responsibility in leadership. In our system, those deals must be made before the election, or I'm afraid there will be no second chance to achieve victory. The ball is now in her court, not in Sanders'.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465353947", "commentID": 18773704, "userID": 43768554, "recommendations": 243, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18773704}, {"approveDate": "1465387241", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465383641", "permID": "18774638", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Northern Virginia", "parentID": null, "userDisplayName": "Mark", "commentTitle": "<br/>", "commentBody": "For Sanders supporters, Bernie is a fabulous fellow.  But please just google \"obama clinton situation room images\" and note that only one candidate -- the one you will see in that room -- has had that kind of very serious practice run, so to speak, before actually being the person in that room issuing the orders.   The cold, bare fact is this:  Hillary Clinton is the most qualified, most experienced, most inside-knowledge Presidential candidate that this nation has had in more than half a century.  As Secretary of State she gained deep and invaluable experience with most of the current world leaders.   As First Lady for 8 years, she has White House protocol down pat, and has valuable first-hand observer experience from a front row seat during another 8-year presidency.  Hillary Clinton is, with no reasonable question, the most qualified person to be President that this nation can produce at the current time.  Sanders has performed a great service, but Hillary has won not because the game is rigged, but because she has the experience, and many, many people do not fail to know it.  It is time to close ranks against the Republican Party's charlatan show, which truly does insult to all of America.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3671/5041/cropped-36715041.jpg?0.5386118929897704", "createDate": "1465359289", "commentID": 18774638, "userID": 36715041, "recommendations": 470, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774638}, {"approveDate": "1465387457", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465383857", "permID": "18774859", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Falls Church, VA", "parentID": null, "userDisplayName": "James Jordan", "commentTitle": "<br/>", "commentBody": "Mrs. Clinton played by he rules, fought hard, and won the primaries, now on to winning the election with a landslide victory and the largest mandate in history to recast this government and correct the economic, justice, energy, environment, trade,  education and health care deficiencies that have been building for 40 years.  It will not be easy to address the distribution of incomes and jobs in an economy that continues to only barely grow.  We must to better.  A huge mandate will be required and I strongly believe it can be achieved if the convention has the wisdom to pull Senator Bernie Sanders to the ticket.  They are a natural team.  They have known each other for 25 years and have the potential to be the greatest government team.  Senator Sanders came out of nowhere and his natural candor, honesty, and character and principles will carry not only the Dems but bring in the Independents and probably some Republicans.  These two have the potential to make the world a much better place and knock-off this human desire for war.<br/><br/>She SHOULD NOT release speeches to the Wall Street bundlers, but she should admit that the way she approached this campaign fund raising was wrong and she has seen the light through Senator Sanders.  Both should work to restore integrity to the American Democracy.<br/><br/>I look forward to an editorial that will recognize the commitment of these two great public servants and let's all work to get the turn-out and make the American future better. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4049/8339/cropped-40498339.jpg?0.3815787552870329", "createDate": "1465360735", "commentID": 18774859, "userID": 40498339, "recommendations": 104, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774859}, {"approveDate": "1465388183", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465384583", "permID": "18774250", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Here", "parentID": null, "userDisplayName": "Brian", "commentTitle": "<br/>", "commentBody": "From a Sanders supporter.  I question the lede of this article, that Hillary must somehow prove her Stage 1 victory legitimate.  I mean, what's left to contest this? <br/><br/>My guy didn't win.  And I hope Hillary does take the message my friends and I have sent to heart - I think it's the path to the White House.<br/><br/>But you can't quibble with the legitimacy of her victory.  In the primary season drawing to a close, Hillary won by a large margin in:<br/>Popular vote<br/>Pledged non-super delegates<br/>State count<br/>Super delegates<br/>Total delegates (obviously) <br/><br/>Mazel Tov, HIllary.  Make us proud.  The alternative is kinda frightening.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465357054", "commentID": 18774250, "userID": 162272, "recommendations": 578, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774250}, {"approveDate": "1465388658", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465385058", "permID": "18774484", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "St. Louis", "parentID": null, "userDisplayName": "Principia", "commentTitle": "<br/>", "commentBody": "Clinton doesn't need to convince Sanders voters she won fairly, she needs to convince Sanders supporters that she's not another neoliberal war-starter, in the pocket of the Wall Street banks. <br/><br/>I don't know how she can do that, frankly, other than selecting Liz Warren as her VP. If, instead, Clinton reaches out to the Bill Kristol's of this world,  continues to claim that Netanyahu will be visiting her in the oval office on day one, and that she's still itching to bomb Iran, she could lose half of Sander's voters to the sofa. <br/><br/>I don't know where she'll land, because I rarely know where she stands. I can only hope her general competence carries the day. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4992/3880/cropped-49923880.jpg?0.980964150512591", "createDate": "1465358317", "commentID": 18774484, "userID": 49923880, "recommendations": 213, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774484}, {"approveDate": "1465388732", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465385132", "permID": "18774502", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palo Alto", "parentID": null, "userDisplayName": "DRHensler", "commentTitle": "<br/>", "commentBody": "When Obama beat Clinton in 2008 I didn't whine about how the system was rigged and we needed to change the rules mid-stream so Clinton would win. Mr. Obama didn't have to \"win me over,\" I knew in a heartbeat I would vote for him over Mr. Romney, the true hero of the 1%. (Remember that recording?) But somehow when a women **finally** wins a presidential nomination she has to go many extra miles to prove to the boys that she really, really, deserves it -- even when the alternative is an ignorant, arrogant, lying racist.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465358390", "commentID": 18774502, "userID": 14423230, "recommendations": 516, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774502}, {"approveDate": "1465388877", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465385277", "permID": "18774593", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westfield, NJ", "parentID": null, "userDisplayName": "Glen Macdonald", "commentTitle": "<br/>", "commentBody": "Proud of Hillary. Proud of our country for nominating an intelligent, well-qualified and dedicated public servant to lead our country and to continue the foundation to rebuild our nation with greater justice, peace and prosperity for all -- an endeavor that the great President Obama began in 2008 after a horrible tenure of greed, war and neglect. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6855/7282/cropped-68557282.jpg?0.7799382680095732", "createDate": "1465359023", "commentID": 18774593, "userID": 68557282, "recommendations": 295, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774593}, {"approveDate": "1465388933", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1465385333", "permID": "18774316:18774600", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Susan Anderson", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Portland, Oregon", "parentID": 18774316, "userDisplayName": "Shonun", "commentTitle": "<br/>", "commentBody": "It may come as a surprise to some of you who ardently believe that Hillary Clinton is a progressive, but recent articles right here in the NY Times, as well as in other web zines, discussed quotes from defense establishment hawks and Pentagon insiders that go way back in years, lauding Clinton for her \"Republican\" outlook when it comes to the business of war and foreign policy.  Many years ago, I was a Clinton believer, until NAFTA and some other blights on our horizon.  HRC is a Democrat In Name Only, and has shifted her position constantly to meet the desires of the crowd du jour.  Do I believe she will make a good president?  Perhaps... but certainly one who will embroil us far more deeply in costly wars overseas and, being embedded with Wall Street, one who will serve only the stratospheric interests of Washington.  Better than Trumpmania?  Yes.  That's about it, however.  I see no shining light on the horizon, other than the laudable accomplishment of, finally, being the first female president.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465359074", "commentID": 18774600, "userID": 30911974, "recommendations": 143, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774600}, {"approveDate": "1465389090", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465385490", "permID": "18774655", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "SF Bay Area, CA", "parentID": null, "userDisplayName": "J", "commentTitle": "<br/>", "commentBody": "Ive been a strident Sanders supporter since I got over my disbelief that someone would run as a democratic socialist in the USA. Reluctant congratulations to Secretary Clinton, you won fair and square. <br/><br/>Our revolution is not over, it is beginning. An octogenarian senator from Vermont managed to reach millions of Americans who are being ground to death by our political institutions and economic system. His message was real, they speak across generations, and it is hard to claim that, in a vacuum, his policies would not be beneficial to the country. It now falls to us Bros, those of us in our 20s and 30s, to carry and preserve the message. <br/><br/>Agency and organization are key. Do your homework, get out in the community, make sure that true progressives are entering offices such as county electoral committees. Continue to hold political rallies and discussions. Show the DNC that THIS IS WHAT WE WANT OUR COUNTRY TO LOOK LIKE. The GOP adopted this strategy: they're not so smart but it worked for them. We lost this battle, but I will use my franchise and energy to fight on until the People's voices are heard. <br/><br/>Secretary Clinton is far from an ideal candidate, and I would say that she is indeed flawed in some respects. But she will be able to get the job done; she is as smart as a whip (oftentimes a know it all) and can get a solid grasp on the minutiae of complex situations. And she is a true progressive. A HRC presidency is better than the nightmare that DJT would foist upon us.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465359385", "commentID": 18774655, "userID": 706113, "recommendations": 385, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774655}, {"approveDate": "1465391588", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465398622", "permID": "18778053", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson Heights, NY", "parentID": null, "userDisplayName": "Ecce Homo", "commentTitle": "<br/>", "commentBody": "I like Sanders, a lot. But I don't get this idea that Clinton didn't win \"fairly.\" I especially don't get the idea that the supposed unfairness relates somehow to superdelegates.<br/><br/>If superdelegates were abolished, Clinton would have won by more than 400 pledged delegates. So the only conceivable basis for Sanders continuing his campaign is the existence of superdelegates. You don't get to condemn superdelegates as unfair while simultaneously relying on them as the sole basis for your campaign.<br/><br/>The fact is, by relying very heavily on proportional award of delegates in primary states, the Democratic Party nominating process is more democratic than any major party's nominating process in the history of the Republic - no winner-take-all, no minimum vote necessary.<br/><br/>Caucuses, where Sanders did especially well, deprive the voter of the confidentiality of the voting booth - not exactly a hallmark of modern democracy.<br/><br/>Sanders had a great run, and his contribution to American politics will benefit the country for years to come. But he lost - fair and square - and it's time to move on.<br/><br/>Saying otherwise tempts fate more than we can afford - even if Trump were a standard-issue conservative and not a bigoted blowhard, we cannot take any unnecessary chances about who gets to select Scalia's replacement on the Supreme Court. Not, that is, if we care about civil rights, voting rights, abortion rights, health care, Citizens United, etc., etc.<br/><br/><a href=\"http://politicsbyeccehomo.wordpress.com\" title=\"politicsbyeccehomo.wordpress.com\" target=\"_blank\">politicsbyeccehomo.wordpress.com</a>", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465389545", "commentID": 18778053, "userID": 21639730, "recommendations": 304, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778053}, {"approveDate": "1465391619", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465521452", "permID": "18778222", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Austin, Texas", "parentID": null, "userDisplayName": "Edie clark", "commentTitle": "<br/>", "commentBody": "A bit of advice to those who are trying to win over those of us who have supported Senator Sanders. This is going to take some time, just as it did with Clinton's supporters in 2008. Let's admit that the process by which nominees are selected is flawed and needs changes in the rules - moving to uniform voting in primaries instead of undemocratic caucuses with convoluted multi-tier delegate selection processes, opening primaries to the millions of independents who are shut out, and reducing the role of superdelegates for a start. In addition, a campaign should be represented on key convention committees in proportion to how many delegates it wins. Hillary Clinton can do much to earn our trust by naming a new chair for the DNC. Much of the resentment that continues to fester can be traced directly to Debbie Wasserman Schultz whose questionable decisions have fanned suspicions of bias. <br/><br/>Most of us will vote for Hillary Clinton in November, just as most of her supporters did in 2008. Many of us may actually volunteer and donate to her campaign, but only if we see real commitment to the progressive ideas our party once stood for. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465390213", "commentID": 18778222, "userID": 62421793, "recommendations": 139, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778222}, {"approveDate": "1465393463", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465522124", "permID": "18775672", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Tallahassee", "parentID": null, "userDisplayName": "Jack", "commentTitle": "<br/>", "commentBody": "The idea that Clinton will \"expand on her ideas\" for real progressive policies having already won the primary is either deeply naive or insincerely offered. Likewise suggesting that the DNC will reexamine the rules which brought victory to the candidate they clearly preferred from the outset. Clinton will drag the party further to the right the same way her husband did on domestic policy and the same way she did foreign policy as Secretary of State, and the DNC will put off reforming the twisted and undemocratic primary process until the indignities of the season are forgotten. Anyone who protests will be labeled a traitor and told to unite or die, at least until the election is over, after which they will simply be ignored.<br/><br/>A previously obscure socialist won the support of millions of voters, including previously disinterested apoliticals and independents, and came to the brink of winning the nomination (except of course for the cabal of insiders whose superthumbs tip the scales). The response from the DNC and their anointed candidate has been to shut their eyes, cover their ears, and pretend it's not happening. Sanders supporters may as well stay home or write in Deez Nutz. The Democratic party was given a chance to move to the left. Instead they pinned their hopes on a political dynasty who brought us the welfare \"reform,\" prison \"reform,\" and regulatory \"reform\" that set the stage for the major crises of the last decade.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465370401", "commentID": 18775672, "userID": 60716348, "recommendations": 146, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18775672}, {"approveDate": "1465393790", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465390190", "permID": "18778307", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Oliver", "commentTitle": "<br/>", "commentBody": "Congratulations Mrs. Clinton on a hard fought primary victory! However, I have a few concerns about the upcoming general election. People are wont to make the comparison between this primary and the one that Clinton lost to Obama in 2008. The big difference is Clinton was a woman with a future in the Democratic Party.  She had a reason to embrace party unity. Sen. Sanders, on the other hand, is not a democrat. He has no allegiance to the party. He only ran as a democrat because of high visibility. <br/><br/>I really worry about Sanders ' supporters voting for Clinton. If Clinton and the DNC are corrupt (according to Sanders) then why would he endorse her and why would his supporters vote for her? It seems to me that if Bernie Sanders all of a sudden has a change of heart about Clinton, that makes him as two-faced as any other politician, and if I'm not mistaken part of his appeal is that he isn't your run-of-the-mill politician. <br/><br/>But then again the willing suspension of disbelief is baked into the election process and we all kind of nod and wink and move on. <br/><br/>You never know what a human being will do five minutes from now and if Sanders runs as an Independent in the general election, believing that those large crowds of supporters will vote for him, I would not be surprised.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465390567", "commentID": 18778307, "userID": 64760773, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778307}, {"approveDate": "1465393867", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465390267", "permID": "18776538", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cherry Hill, NJ", "parentID": null, "userDisplayName": "Joel Gardner", "commentTitle": "n/a", "commentBody": "It is important to remember that independents, centrists affiliated with neither party, generally determine presidential elections.  Clinton must be careful not to swing too far left, because the opportunity to claim rational Republicans is more important and potentially more valuable in swing states. Democrats have elected three presidents since 1968, and all three won because they claimed the center.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465382545", "commentID": 18776538, "userID": 52568180, "recommendations": 60, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18776538}, {"approveDate": "1465394873", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465391273", "permID": "18779195", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NC", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "I fail to understand why the first female nominee for President is, in the view of the NY Times, obligated, in the absence of any allegation of voter fraud, to prove the \"fairness\" of the nominating process.  As unfounded as various attacks against the first African-American nominee were, no one claimed Obama was obligated to prove the fairness of the system.  Needless to say, no white male has ever been asked to prove that he was fairly nominated.  Bernie Sanders, for example, hasn't be asked to prove that caucuses are a fair and democratic process.  So why claim that Hillary should bear this burden?  If the rules need to be changed, the party should work it out by consensus -- even if Hillary wanted to change the rules, she'd only be accused of more \"unfairness\" for whatever changes she suggested.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465393613", "commentID": 18779195, "userID": 34268335, "recommendations": 202, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18779195}, {"approveDate": "1465399511", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465395911", "permID": "18774839", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "San Diego", "parentID": null, "userDisplayName": "Travis", "commentTitle": "<br/>", "commentBody": "This Gen-Y'er voted for Bernie just over 2 hours ago and I am thrilled to support Hillary Clinton in the general election. Senator Sanders more closely represents where I think government should go, but Mrs. Clinton is probably one of the best qualified candidates we have seen in decades. I have yet to hear anything other than ambiguous insults as a reason not to support her. Congratulations on making history, Mrs. Clinton!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465360601", "commentID": 18774839, "userID": 53719236, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18774839}, {"approveDate": "1465400070", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465396470", "permID": "18778844", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Minneapolis", "parentID": null, "userDisplayName": "TQ White II", "commentTitle": "<br/>", "commentBody": "I see people talking about reforming the primary process to be \"simpler and more accountable\", \"uniform primaries\", etc. I disagree. These people want to turn an interesting process that tests the abilities of the candidates and their organizations on many levels into the equivalent of education's high stakes testing.<br/><br/>Contrary to the opinion of the losers, the Nevada process showed us, for example, that Hillary runs a team that covers the details and plans carefully. It showed that Bernie and his campaign were not up to the task. That's important information for voters.<br/><br/>Caucuses show a campaign's ability to reach out in a small-ball, emotional context. The sequence of conventions and their negotiations show the power and savvy of the candidate. These are all important.<br/><br/>Primaries replace this complexity with a single, uniform (and fairly boring) test. Money plays an outsize role because of advertising. So do special interest organizations who can muster volunteers. They, too, have their place but to change it all into a monoculture would be bad.<br/><br/>Super delegates enrich the situation, too. They actually represent one more primary challenge for the candidates. It takes entirely different skills and characteristics to appeal to professional politicians. The stated purpose is to prevent a Trumpian disaster, but they also represent the judgment of the seasoned people who really know how politics works.<br/><br/>I do not think the primary system is broken at all. It fulfills many needs.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465392439", "commentID": 18778844, "userID": 195386, "recommendations": 43, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778844}, {"approveDate": "1465400121", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465522872", "permID": "18780140", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MA", "parentID": null, "userDisplayName": "Nicholas", "commentTitle": "<br/>", "commentBody": "\"Among some of his supporters there will be lingering frustration and a belief that the party’s leaders conspired to deprive them of their choice. This isn’t an accurate or fair assessment...\"<br/><br/>Clinton will win the nomination, if she wins it, with the votes of the superdelegates, who include the elected officials and other democratic notables - the national leaders of the party. Among them are dozens of lobbyists who serve as the conduit of influence and cash between the power groups and the Democratic elected officials. If not for the superdelegates, Clinton would not get the nomination on the first ballot, and an open convention would result, with the pledged delegates chosen at the primaries freed to vote however they chose on subsequent ballots. <br/><br/>Therefore the party leaders have in fact made the decision and taken away the choice. No one disputes that this is exactly the function that superdelegates are supposed to play in the party - to give party insiders a significant and potentially decisive role in choosing the nominee.<br/><br/>Clinton could address this issue in a simple way - she could announce that she will only accept the nomination if superdelegates are discarded and the convention is allowed to go to a second or later ballot, and she wins the necessary number of delegates from amongst those chosen during the primaries. If she does not do this, then Sander's supporters are absolutely correct that party insiders have pre-empted their choice. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465397122", "commentID": 18780140, "userID": 73116705, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18780140}, {"approveDate": "1465400275", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465396675", "permID": "18779809", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Moss Beach, CA", "parentID": null, "userDisplayName": "Bob Swift", "commentTitle": "<br/>", "commentBody": "Mrs. Clinton’s next hurdle is expressed quite clearly in the lead for today's editorial. I for one will not be able to vote for her with a clear conscience unless something is done to give me hope that my country’s badly degraded presidential voting system can be restored. The only way this can happen quickly enough for her to have my support in defeating the presumptive GOP candidate in November lies with the Democratic National Committee. By establishing its super-delegate system and appointing delegates without current voters’ input the DNC has stolen electors from the voting public. It is these 700-plus (roughly 15%) supers who have swung media opinion and likely many one-citizen-one-vote believers into the “Anyone but Trump!” camp. By anointing Mrs. Clinton years in advance of the party convention the DNC have committed to an individual whom many distrust, I among them. And at age 85 I am no Millenial. Action by the Democratic National Committee would not ensure America’s return to fair elections but it would be a first step.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6605/1504/cropped-66051504.jpg?0.30624218052253127", "createDate": "1465395815", "commentID": 18779809, "userID": 66051504, "recommendations": 52, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18779809}, {"approveDate": "1465400347", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465396747", "permID": "18778944", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Mike", "commentTitle": "<br/>", "commentBody": "\"Unless she makes a substantial effort to win them over, they might stay home, and low turnout historically helps Republicans.\"<br/><br/>-- And herein lies the essence of the piece. What does HRC have to offer to the Sanders crowd? Better yet, what leverage will Sanders have at the Democratic Convention, having decided to stay in the race until Philadelphia and this having earned the right to offer leverage in deciding the nature, scope, and ideals of the Democratic platform? <br/><br/>Hillary may be the presumed nominee, but she will not get anywhere without the Sanders wing that has, despite all the DNC party elites' derision and revulsion, awakened a veritable army of voters and engaged citizens more interested in safeguarding democracy and good governance than continuing whatever \"legacy\" Hillary is carrying from the 1990s. <br/><br/>Her alleged leadership skills will now be put to the test as she desperately needs to secure a coalition with the Sanders camp. That may require offering Bernie a high ranking position either in the Party or on her ticket. The Bernie of Bust crowd is an inconvenient truth to Hillary and the DNC and one that needs to be overcome in time to go after Trump in November. Otherwise, the presumed nomination of the first women of a major political party will begin her \"historic milestone\" on very weak foundations.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465392809", "commentID": 18778944, "userID": 1584349, "recommendations": 44, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778944}, {"approveDate": "1465401107", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465397507", "permID": "18776447", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Arroyo Grande, Ca", "parentID": null, "userDisplayName": "Bzl15", "commentTitle": "<br/>", "commentBody": "In 2008 I was a  diehard supporter of Hillary who had said that I will never ever vote for Obama. I was certain that I will vote for MaCain. Then, a few weeks passed and I heard Obama and MaCain in the general election campaign and realized what was at stake and, not only voted for Obama, I actually campaigned for him! I have never been happier that I decided to vote for Obama. In this election, voting for Trump would be voting for setting the country back decades, destroying eight years of hard work by President Obama to get this country out of the mess Bush and Republicans had created, giving The Supreme Court to the neocons, and possible fascism. Sanders has lost fair and square and, I hope, his supporters will understand that our country can't afford a Trump presidency. It is time to unite and defeat this hate mongering, know-nothing and self promoting racist. America can not turn the clock back. Stakes can not be higher.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465381847", "commentID": 18776447, "userID": 51628432, "recommendations": 76, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18776447}, {"approveDate": "1465403413", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465399813", "permID": "18778554", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Columbus, OH", "parentID": null, "userDisplayName": "Ysais Martinez", "commentTitle": "<br/>", "commentBody": "I personally believe that Mrs Clinton has to stop pretending that she is poor. Like if her and her husband's wealth were a crime. It is not. This is America. They are rich, they have rich friends, etc. Her biggest burden for her will be the lack of trust in her brand of politics. Many people in her own party call her a \"compromiser\", which I call a pragmatic politician. She should just unleash her real self and show people that she comes as she is. She already enjoys a vast support among minorities, women, many independent minded whites, etc. Destiny granted her the opportunity to run against a man that says erratic things left and right but that should never be underestimated. I really feel Mrs Clinton has it all stacked in her favor to win the next election. She just needs to stop being so shy around. Scream Mrs Clinton like Senator Sanders does. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7257/0877/cropped-72570877.jpg?0.5305832191370428", "createDate": "1465391390", "commentID": 18778554, "userID": 72570877, "recommendations": 19, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18778554}, {"approveDate": "1465404773", "commentType": "comment", "userTitle": "NULL", "updateDate": "1465522923", "permID": "18775525", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "new york city", "parentID": null, "userDisplayName": "ellienyc", "commentTitle": "<br/>", "commentBody": "If many in the \"newest generation\" don't trust Secretary Clinton, then it should be easy to understand why so many of us older folks -- boomers -- don't trust her. We've lived with her (not to mention her family; good grief, talk about Clinton fatigue) for decades, watched helplessly as she marched into New York CIty (instead of back to Arkansas) in 2000 to pull a \"Bobby Kennedy\" and run for Senate after making nice to all the appropriate local Dem machine politicos and black clergymen. I am so exhausted by this family and by her neediness in particular. Just going to hold my nose I guess and hope she's gone in 4 years.<br/><br/>As a boomer, I had really hoped to see a president who more closely represented my views during my lifetime. Bernie came close, and I am glad to see he hasn't given up as easily HRC hoped he would by \"claiming\" her nomination in prime time.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1465368339", "commentID": 18775525, "userID": 63296061, "recommendations": 46, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18775525}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1167, "api_timestamp": "1488822343", "totalReplyCommentsFound": 555, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}