{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 21, "totalParentCommentsFound": 957, "totalEditorsSelectionFound": 22, "depthLimit": 0, "totalRecommendationsFound": 853, "comments": [{"approveDate": "1481616992", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481616992", "permID": "20785623", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Minneapolis", "parentID": null, "userDisplayName": "B", "commentTitle": "<br/>", "commentBody": "Appointing the CEO of Exon, who opposes Russian sanctions, as Secretary of State is certainly going to make the leaders of countries bordering Russia feel safe and certainly strengthens our barrier to Russian expansion!<br/><br/>And now that Russia has joined the OPEC countries in a plan to limit production in order to increase the price of oil, Exon will help them drain trillions of dollars from our economy and sorely needed money from the pockets of Americans.<br/><br/>1984 isn't quite on the horizon yet, but we are about to relive 1974 again.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481601164", "commentID": 20785623, "userID": 65301548, "recommendations": 378, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785623}, {"approveDate": "1481617377", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481617377", "permID": "20785722", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "East Setauket, NY", "parentID": null, "userDisplayName": "Paul Wortman", "commentTitle": "<br/>", "commentBody": "Rex Tillerson shares the same fundamental conflict-of-intetest problem as Donald Trump--business ties with foreign leaders like Russian President Vladimir Putin who advocate policies not in our national interest. With no government or diplomatic experience and an Administration already unbalanced with pro-Putin members like National Security Advisor, Michael Flynn and the President-elect, the Senate should, given Russian efforts to destabilize our election, reject Mr. Tillerson's nomination.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481602453", "commentID": 20785722, "userID": 57715665, "recommendations": 360, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785722}, {"approveDate": "1481617401", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481617401", "permID": "20785733", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Salt Lake City, Utah", "parentID": null, "userDisplayName": "Andrew G. Bjelland, Sr.", "commentTitle": "<br/>", "commentBody": "Trump's appointment of so many plutocrats to his cabinet, and with this likely double whammy of Tillerson-Bolton at State, the final reel of this horror movie is in the can. Grab your popcorn and Cokes and enter the theatre to watch \"Invasion of the Booty Snatchers\"!<br/><br/>If there is one thing that is sacrosanct in Donald Trump's approach to misgovernance, it's the promotion of the economic interests of himself, his family and his select group of fellow plutocrats--his appointees. We can rest assured that their interests will be served as Mr. Trump leverages the power and prestige of the American presidency for all that it's worth.<br/><br/>Never before in American history has so much political-economic power been consolidated among so few readily identifiable individuals.<br/><br/>Every day--as I read, hear and watch--it becomes more and more evident that we are on the brink of what is likely to be, or at the very least appear to be, an extremely corrupt Trump administration. Mr. Trump reportedly has economic interests and various degrees of indebtedness in at least 18 foreign countries, some of which--like Putin's Russia--are, to put it mildly, less than friendly to our nation's interests. <br/><br/>Mr. Trump's business arrangements are multi-leveled, buried within multiple LLCs, and extremely opaque.<br/><br/>His cabinet and staff appointments reveal that his pro-worker populace campaign stance was a total sham, but a very successful con.<br/><br/>It is now Trump's world, and welcome to it.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481602623", "commentID": 20785733, "userID": 58063917, "recommendations": 614, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785733}, {"approveDate": "1481617673", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481617673", "permID": "20785796", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "lee ny", "parentID": null, "userDisplayName": "sherm", "commentTitle": "<br/>", "commentBody": "Trump sees the world as an empty stage , or building lot, that is his to give substance.  I think he is selecting his cabinet, not to be members of a coherent team, but as co-creators.  I can't imagine Trump giving  giving orders and direction to such a capable and experienced man as Tillerson. More like \"Rex, you know the world like the back of your hand. So just do what you think needs to be done, and keep Pence advised.\"<br/><br/>All his cabinet picks are individuals that have a strong contrary notion of what the department they are chosen to lead should be doing. So EPA will get a global warming denier (more properly \"ignorer\") at the top plus  all like thinking subordinate political appointees. Education gets Secretary who sees public education as an entity to be replaced by vouchers and private schools. And so it goes down the line.<br/><br/>With Tillerson in the cabinet, Trump sees himself rubbing elbows with one of the crown jewels of industry, and that feels good.  Since it's certain that Trump will have nothing to do with experienced diplomats, Tillerson may be the next best thing. Smart, experienced and capable people can see a new job for what it is, rather than a continuation of a past career. You can only hope.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481603340", "commentID": 20785796, "userID": 20019851, "recommendations": 91, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785796}, {"approveDate": "1481618239", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481618239", "permID": "20785946", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "Stan D", "commentTitle": "<br/>", "commentBody": "Like Calvin Coolidge, Trump believes the business of America is business and what better to staff his administration then members of the business class.  During his campaign for the nomination, Trump said we should have confiscated the Iraq oil fields as  payment for our efforts there. Trump's admiration for Putin, along with Tillerson's strong relationship with Russia and world oil, makes him perfect as Trump's Secretary of State. Trump's flirtation with Romney can now be seen as no more than Kabuki theater. As for John Bolton, an unrepentant neocon who supported the Iraq war that Trump said he opposed, he will be there to disrupt America's traditional ties with the rest of the world.  Good cop Tillerson, bad cop Bolton.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481605730", "commentID": 20785946, "userID": 69551151, "recommendations": 124, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785946}, {"approveDate": "1481618431", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481618431", "permID": "20785992", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Sacramento, CA", "parentID": null, "userDisplayName": "DbB", "commentTitle": "<br/>", "commentBody": "Maybe I'm missing something, but I thought the guiding principle of U.S. foreign policy for the past several decades has been to promote democratic governments and human rights around the world.  There doesn't seem to be much in Mr. Tillerson's background to suggest that he would be committed to those goals.  Instead, his experience (like Trump's) has focused on making business deals to enrich his company.  Both he and Trump seem to share the philosophy of Charles Wilson, President Eisenhower's defense secretary, who said, \"What's good for the country is good for General Motors and vice versa.\"   The problem is, what is good for the oil and gas industry is not usually healthy for the environment, and helping to empower Russia is not usually healthy for democracies.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481606507", "commentID": 20785992, "userID": 41973174, "recommendations": 460, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20785992}, {"approveDate": "1481620247", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481620247", "permID": "20786390", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Warrenton VA", "parentID": null, "userDisplayName": "silver bullet", "commentTitle": "<br/>", "commentBody": "The president-elect's choice for secretary of state \"has no background in diplomacy beyond corporate deal making\". You don't say! The next president has no experience in government, politics or national and foreign affairs, yet his lack of qualifications weren't a deterrent to running for and winning the White House. How could such a policy novice be expected to understand the complex difficulties of staffing Cabinet positions with knowledgeable and qualified nominees who will be charged with running his administration after he is sworn in? That the next president is \"ignorant of national security issues\" only illustrates that his stewardship in the Oval Office will be akin to the blind leading the blind.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/7591/1032/cropped-75911032.jpg", "createDate": "1481618953", "commentID": 20786390, "userID": 75911032, "recommendations": 420, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20786390}, {"approveDate": "1481631857", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481631857", "permID": "20786937", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "great neck new york", "parentID": null, "userDisplayName": "et.al", "commentTitle": "<br/>", "commentBody": "This is a dangerous pick that should not be rubber stamped by the Republican Senate. That Trump had so many meetings with Romney, and then passed on a much better choices is frightening. Did a public shaming by Kelly Ann Conway affect this Neophyte President? Who is in control of a man who dismisses daily security briefings? Do we want an oil baron, he himself a neophyte,  so close in line to the Presidency? Where is the Republican leadership? ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481629920", "commentID": 20786937, "userID": 60468609, "recommendations": 330, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20786937}, {"approveDate": "1481639560", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481639560", "permID": "20788904", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Lubbock", "parentID": null, "userDisplayName": "Bobmactx", "commentTitle": "<br/>", "commentBody": "Mr. Trump has dismissed the intelligence community's conclusions about the intent of Russian meddling in the election by noting that they are coming from the same people who concluded there were weapons of mass destruction in Iraq.  Are Mr. Bolton's fingerprints not all over the decision to go to war in Iraq?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481639225", "commentID": 20788904, "userID": 67932551, "recommendations": 133, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20788904}, {"approveDate": "1481640654", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481640654", "permID": "20788160", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Dadof2", "commentTitle": "<br/>", "commentBody": "Probably the ONLY thing about Tillerson that is a positive is that he recognizes that Global Warming and Climate Change are real and is willing to have ExxonMobil adapt to the changing political world climate. That alone makes him unique among Trump's designees.<br/><br/>But John Bolton is a clumsy, rude fabulist who, like all of Dubya's neocons lives in a fantasy world where everything is simplistic and there are good guys and bad guys and the good guys are supposed to shoot the bad guys and not waste time talking to them (BTW, he's a chicken hawk who avoided serving in Viet Nam while supporting that war--as long as OTHER men risked their lives).<br/><br/>But if I were Tillerson, I would strenuously object to having Bolton as my #2 in State because Bolton IS  a clumsy, ridiculous loudmouth.  His bizarre claim that the CIA report on Russian interference in our election was an Obama false flag is as loony and ludicrous as the conspiracy nuts who alternate between 9/11 being a plan of the Bush admin and an Israeli operation!<br/><br/>Finally, Trump's retribution against Mitt Romney failed.  It was clear he'd NEVER pick Mitt as SecState and only dangled the bait to get Mitt to humiliate himself. But, to his credit, Romney never retracted or apologized for the (true) things he said about Trump, so Trump couldn't squeeze that out of him before jerking the bait away, as he always intended to.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481636633", "commentID": 20788160, "userID": 21069407, "recommendations": 131, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20788160}, {"approveDate": "1481640775", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481640775", "permID": "20788458", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Tripoli, PA", "parentID": null, "userDisplayName": "Bill Tritt", "commentTitle": "<br/>", "commentBody": "Comrade Trump, Comrade Putin, Comrade Tillerson, Comrade Flynn, Comrade Comey, Comrade Bolton, Comrade Bannon, and last but not least Comrade Kellyanne. If I wanted to live in the Soviet Union, I would move there. To all the deplorables who voted to \"make American great again\" you ain't gettin jobs, you are getting facism. You have been \"Trumped\".  How much does the president elect owe Putin?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481637597", "commentID": 20788458, "userID": 23555442, "recommendations": 244, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20788458}, {"approveDate": "1481641080", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481641080", "permID": "20789104", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 9, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Florida", "parentID": null, "userDisplayName": "Karl Haugen", "commentTitle": "<br/>", "commentBody": "Obama has stood idly and watched Russia take over half of the Ukraine and run roughshod over Syria. I challenge anyone to define Obama's policy toward Russia, or towards the Mid-East-because he doesn't have one. Putin has humiliated Obama and Kerry and HRC. Tillerson is a smart, tough engineer who knows how define policy, set goals and get things done. The State Department has annual budget of $66 billion and more than 30,000 employees. Maybe it's time for some effective management. Of course he has had plenty of business dealings with Putin-and had his picture taken with him-that's what oil company CEO's do.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481639842", "commentID": 20789104, "userID": 11212740, "recommendations": 29, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789104}, {"approveDate": "1481641118", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481641118", "permID": "20789107", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "VA", "parentID": null, "userDisplayName": "Kodali", "commentTitle": "n/a", "commentBody": "The very purpose of appointing Rex Tillerson is to benefit from his experience and negotiating skills and not for him to be some one else. Trump said during campaign, 'isn't it wonderful if we can work with Russians'. That is exactly what he is trying to do, work with Russians to solve world problems. We made a mess in world affairs and now is time to clean up the mess by changing the course. No doubt, Russia and China want to hurt U.S., because it is the only country in the way blocking them to dominate the world. May be a change from military deals to business deals would steer away both nations from confrontation and work towards peace.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481639853", "commentID": 20789107, "userID": 17594760, "recommendations": 25, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789107}, {"approveDate": "1481641322", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481641322", "permID": "20789178", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Maine", "parentID": null, "userDisplayName": "Susan", "commentTitle": "<br/>", "commentBody": "Trump not only chooses to personally retain conflicts of interest that will make all of us nationally and globally doubt his every decision, he also chooses to pick In-your-face appointments that only enhance this distrust.  We see Trump shilling for his businesses while speaking as President Elect while refusing to provide his financial information so that Congress can perform its proper role of oversight.  Mr. Tillerson is the perfect pick if we now agree with the GOP that the US is no longer a democracy but  an oligarchy whose primary obligation is to provide tax savings, earnings, etc. to its shareholders and owners alone.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481640051", "commentID": 20789178, "userID": 58169122, "recommendations": 80, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789178}, {"approveDate": "1481641346", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481641346", "permID": "20789189", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Westborough, MA", "parentID": null, "userDisplayName": "Rob", "commentTitle": "<br/>", "commentBody": "Each day brings new affirmation of my deepening concern that Mr. Trump is clueless about his role as commander in chief and his job description. These cabinet choices are very disturbing, comprising a who's who of billionaires, right wing zealots and unqualified public figures with marginal skills pertaining to the jobs they've been chosen to perform on our behalf. We're in for one hell of a ride.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4446/9104/cropped-44469104.jpg?0.7963294084183872", "createDate": "1481640093", "commentID": 20789189, "userID": 44469104, "recommendations": 145, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789189}, {"approveDate": "1481641430", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481641430", "permID": "20789224", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Wolfeboro, NH", "parentID": null, "userDisplayName": "Lisa Braiterman", "commentTitle": "<br/>", "commentBody": "Todays news included the tidbit that Donald Trump is not very interested in security briefings, choosing to ignore information, intelligence or facts about the world. This goes along nicely with his statement during the campaign, \"if it isn't true, it ought to be\". Now we have a list of appointees who though they might actually read books on occasion, have limited or no government experience, views well outside the mainstream, and inherent conflicts based on lifetimes of extreme views or a career spent in self-interest, corporate interest or opportunism.<br/>The Senate must stand up to these nominees. Even conservative Republicans pst understand that these nominees are embarrassingly under qualified, hostile to the agencies they seek to lead, sometimes even to the mission of the agency, and not the people to lead our nation in difficult and dangerous times. If Donald Trump is leading the nation to the brink of catastrophe in the next four years - it will be the ultimate destruction of the Republican Party. And if they fail to stand up to him in the hearings to come, good riddance to them.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481640217", "commentID": 20789224, "userID": 68543286, "recommendations": 111, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789224}, {"approveDate": "1481641711", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1481641711", "permID": "20788571:20789469", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "David", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "MD", "parentID": 20788571, "userDisplayName": "NER", "commentTitle": "<br/>", "commentBody": "Nearly every Trump cabinet pick has been terrible. A woman who undermined public education to promote charter schools and voucher programs that have not improved student achievement will head the Department of Education. A neurosurgeon with no background in housing policy will head HUD. Trump chose a climate change denier whose claim to fame is suing the EPA to lead the EPA. The Department of Labor will be run by a fast-food franchise owner with multiple safety and labor practice violations. A man who couldn't be confirmed as a federal judge by a bipartisan group of senators because of racist remarks will lead the Department of Justice. Health and Human Services will be run by a man who decried Medicare as socialist. Trump has requested a list of everyone at the Department of Energy who's had anything to do with policy related to climate change. And he's appointing 3 Wall Streeters after attacking Clinton relentlessly for ties to Wall St.<br/><br/>2.8 million more Americans voted for Hillary Clinton, and they didn't endorse Trump's radical agenda.<br/><br/>Add to all that Trump's ignorance of foreign policy, his unselfconscious belief that his own \"smarts\" negate the need for daily intelligence briefings, and his willingness to upset decades of diplomacy on China before he even takes office. These are ample reasons to critique what we've already seen and heard, and to dread Trump decision-making to come.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481641022", "commentID": 20789469, "userID": 65877035, "recommendations": 197, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20789469}, {"approveDate": "1481643214", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481643214", "permID": "20790047", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Georgia", "parentID": null, "userDisplayName": "Omgoodness", "commentTitle": "<br/>", "commentBody": "I'm beginning to see that even some of his supporters are outraged by Mr. Trump's recent actions. I noticed on his Twitter page how some of his likes that he usually receives are dwindling in numbers. The sad thing about this is why is anyone surprised, shocked or disappointed by anything that he does? The same Mr. Trump that we saw in the primaries is the same Mr. Trump we saw during the general campaign and is the same Mr. Trump that we see as President Elect who will be the same Mr. Trump as President of the United States of America. I'm hopeful the word United will stand out much more than the Trump name. With all that is going on around us, we need unity more than ever. I'm an independent and after 2016 will probably never be affiliated with the major two parties again as I am saddened that instead of speaking out for the good of our country many namby-pambied on both sides thus leaving us where we are today.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481642809", "commentID": 20790047, "userID": 69166128, "recommendations": 59, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20790047}, {"approveDate": "1481644328", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481644328", "permID": "20790538", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Northern CA", "parentID": null, "userDisplayName": "SDT", "commentTitle": "<br/>", "commentBody": "Every cabinet pick is an affront to common sense, and some would be straight up comical if it all wasn't so tragic. Rick Perry for Energy Secretary? Didn't Perry want to eliminate the Energy Department? Is this Trump being funny? Ben Carson for HUD, why, because he grew up in an apartment in a city? One can only assume that Trump is repaying favors and he does not care at all what happens within these agencies or the country going forward. He will sit back in that disgusting gold plated thing he calls home and rake in the dough.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481644292", "commentID": 20790538, "userID": 66558654, "recommendations": 115, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20790538}, {"approveDate": "1481644583", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481644583", "permID": "20790608", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Dallas, TX", "parentID": null, "userDisplayName": "Ed", "commentTitle": "<br/>", "commentBody": "Our only hopes for exposing the Russians are three Republican senators willing to stand up to bully Trump and reject this nomination.  With the additional appointment of Perry as energy secretary, it's clear that Trump is out to destroy cabinet agencies from the inside out, or as Charles Blow eloquently put it, \"like a worm inside an apple.\"  If Trump puts the management of his empire in the hands of his sons and Tillerson is approved by the Senate, then the U.S. is headed to banana republic status, with every move by Trump and Tillerson suspicious because of their conflict of interests and cozy relational with Vladimir Putin, who is out to destroy our way of life, and that of eastern European nations as well.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481644559", "commentID": 20790608, "userID": 66384108, "recommendations": 105, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20790608}, {"approveDate": "1481650302", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481650302", "permID": "20791490", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "AEK in NYC", "commentTitle": "<br/>", "commentBody": "Perhaps Trump is choosing pro-Russian candidates for top U.S. government positions for the simplest, if basest, of reasons: he's indebted big-time to the Russian money-lenders. Trump has lived a life grounded entirely on borrowed money, starting with his dad, through to Japanese, Chinese and Middle Eastern money-lenders. U.S.-based banks have long ago stopped lending him money, so it's almost certain that Trump turned to the Russian oligarchy to maintain his \"bigly\" lifestyle and image (something that an examination of his soon-to-be/never-to-be tax returns might reveal).  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1481647888", "commentID": 20791490, "userID": 30214406, "recommendations": 68, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20791490}, {"approveDate": "1481727770", "commentType": "comment", "userTitle": "NULL", "updateDate": "1481727770", "permID": "20797890", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Los Gatos, CA.", "parentID": null, "userDisplayName": "Joe M.", "commentTitle": "<br/>", "commentBody": "Everything is simple for Trump.  Simply say jobs will appear, and they must.  Simply forbid Apple from outsourcing manufacturing - and iPhones will be made in America and people will have great jobs.  Simply tell China you're tearing up all treaties, and they'll acquiesce to your every demand.  Simply tell the generals you know more about ISIS and Aleppo than they do, and tell them answers to the worlds geopolitical problems are as simple as the noses on their faces - and they'll thank you for never having thought of that.<br/><br/>Simply say whatever comes into your mind, and because you're Donald Trump, a self-proclaimed \"very smart person,\" everything is made right.<br/><br/>No need to imagine you need those intelligence briefings - they're boring and repetitious and you pay others to do that for you.  No need to imagine why your predecessors set things up the way they did - it's all wrong.<br/><br/>Making America great is simple.  Just say whatever makes you feel good, and everything will fall into place.<br/><br/>And what good are nuclear weapons if you never actually use one?<br/><br/>Gee.  I guess we'll find out.  The codes are simple if you're President.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6961/4056/cropped-69614056.jpg?0.18688293092406794", "createDate": "1481677896", "commentID": 20797890, "userID": 69614056, "recommendations": 1, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20797890}], "totalEditorsSelectionReturned": 22, "replyLimit": 3, "totalRecommendationsReturned": 21, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1496, "api_timestamp": "1488822347", "totalReplyCommentsFound": 539, "totalCommentsReturned": 22, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}