{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 24, "totalParentCommentsFound": 685, "totalEditorsSelectionFound": 29, "depthLimit": 0, "totalRecommendationsFound": 596, "comments": [{"approveDate": "1475564913", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475561313", "permID": "20011871", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 15, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cincinnati, Ohio", "parentID": null, "userDisplayName": "PaulB", "commentTitle": "<br/>", "commentBody": "Part of Trump's tax \"plan\" would also do away with the estate tax, a levy intended to prevent the extremely wealthy from transferring their estates to heirs without paying a tax on those assets. The estate tax affects only a tiny fraction of families. If Trump succeeds in this, he would be giving himself and his family an enormous -- no, obscene -- tax break.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475546804", "commentID": 20011871, "userID": 6136710, "recommendations": 943, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20011871}, {"approveDate": "1475565093", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475561493", "permID": "20011919", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 10, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NC", "parentID": null, "userDisplayName": "PAN", "commentTitle": "<br/>", "commentBody": "Bankrupt man walking.<br/><br/>How could anyone believe this man, who claims is a genius - especially on using the tax system to his benefit - would change the rigged tax system that is rigged in his favor?<br/><br/>No wonder the wealthy do not like a simple flat tax - as that would not allow them to play three-card-monty with their taxable incomes.<br/><br/>If Trump truly believed in free market capitalism he would be flat broke, homeless and on the street with no other skill than an obnoxiousness that no used car dealership would hire.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475547161", "commentID": 20011919, "userID": 582307, "recommendations": 578, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20011919}, {"approveDate": "1475565500", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475561900", "permID": "20012102", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "wynnewood", "parentID": null, "userDisplayName": "jbtodsttoe", "commentTitle": "<br/>", "commentBody": "\"Developers like Mr. Trump are allowed to use their real estate losses to offset income from activities unrelated to real estate.\"<br/>Exactly. Mr. Trump's claim that his intimate knowledge of our complex tax codes make him uniquely qualified to \"fix\" them seems to have duped some voters into missing the fact that he also uniquely benefits from the codes and therefore would be hurting himself if he \"fixed\" them. Unless, of course, he \"fixes\" them in such a way that he and his cronies benefit even more, which to those of us doing the actual math seems to be what his tax proposals would lead to. Otherwise, he just wouldn't be very \"smart,\" now would he?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475548442", "commentID": 20012102, "userID": 59278376, "recommendations": 464, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012102}, {"approveDate": "1475565673", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475562073", "permID": "20012201", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Germantown, MD", "parentID": null, "userDisplayName": "Jack Nargundkar", "commentTitle": "<br/>", "commentBody": "It is pretty obvious now why Trump has been refusing to release his tax returns—they will most likely expose him to be someone quite different from the image that he has portrayed of himself—that of a rich, smart, successful, philanthropic businessman.  <br/><br/>Based on a Washington Post investigation, we already knew that he has made no charitable contributions to his Trump Foundation since 2008.  Now the NY Times has revealed that Mr. Trump incurred ~$1 billion in net operating losses (NOL) in 1995.  So Mr. Trump’s much vaunted philanthropy and success appear illusory.<br/><br/>Were Mr. Trump to actually release his tax returns, we might just find out that he is also not as rich as he claims to be?  More significantly, this self-proclaimed “king of debt” could be heavily indebted to foreign nations, such as, Russia—which might explain why he is so enamored by Putin the patron? <br/><br/>If Trump were really smart, not only would he not have incurred ~$1 billion in losses in a single year, but also he would not make “follow the money” threats against his opponent—when his own finances have been so disastrous and his own money trail is so nebulous that it inhibits him from releasing his tax returns?   <br/><br/>Finally, Mr. Trump’s reference to “legal obligations” regarding using his NOL to avoid paying taxes reminded me of Al Gore’s “no controlling legal authority” defense on foreign donations.  The American people don’t buy it, Mr. Trump—we see you as a taker, not as a maker that you claimed to be!", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475549071", "commentID": 20012201, "userID": 20135455, "recommendations": 512, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012201}, {"approveDate": "1475565720", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475562120", "permID": "20012214", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 7, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Irvington", "parentID": null, "userDisplayName": "ghorowitz", "commentTitle": "<br/>", "commentBody": "Trump is saying that he owed a \"fiduciary duty\" to creditors and family members to pay as little in personal income tax as possible.  From a legal perspective this is nonsense.  But the fact that he professes to believe this is even more troubling:  As President, he would assuredly have the same supposed duty to block any tax reform that would increase taxes for himself and his family.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475549172", "commentID": 20012214, "userID": 15204202, "recommendations": 605, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012214}, {"approveDate": "1475568730", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475565130", "permID": "20012277", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "OSS Architect", "commentTitle": "<br/>", "commentBody": "Mr Trump's business empire consists of over 500 LLC's (limited liability corporations) which funnel their income to him, firewall one failed investment from another's assets, and all with his children as company officers. This is a byzantine structure that just reeks of organization for the purposes of tax evasion. <br/><br/>Seemingly legal, given the number of IRS audits he has survived, but it represents a man that has spent his life trying to bend ethics and tax law to the breaking point.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5772/0058/cropped-57720058.jpg?1456154267842695124", "createDate": "1475549614", "commentID": 20012277, "userID": 57720058, "recommendations": 519, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012277}, {"approveDate": "1475569322", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475565722", "permID": "20012541", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "em", "commentTitle": "<br/>", "commentBody": "Operating losses indicate that a company’s core operations do not generate enough revenue to cover costs let alone make a profit. Trump's  core operations were never profitable.  Do we really want someone running the country who ran his own businesses at a loss and then has the hubris to say he is a great businessman and blames others for any mistakes. If he becomes president and runs this country into the ground, the rest of the world will not bail America out the way the U.S. tax code and financial community bailed him out.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475551786", "commentID": 20012541, "userID": 63637188, "recommendations": 727, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012541}, {"approveDate": "1475569376", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475565776", "permID": "20012554", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "undefined", "parentID": null, "userDisplayName": "tony", "commentTitle": "<br/>", "commentBody": "He is asking us to put all our faith in him to make the lives of the middle and working class better when he has no record of any kind of doing anything of the kind. Employed thousands of people? They were just there as tools to enrich himself. Are we supposed to just ignore all the lawsuits that testify how he tried to cheat contractors out of owed money? Should we just turn a blind eye to the ex-workers who have said how terrible it was to work for him? There's plenty of proof he's enriched himself with no thought to others. Proof that he has sacrificed for someone else? None. Trust him to rewrite the tax code so that he and his children won't continue to benefit? I'd have more faith that the sun will rise in the west.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475551981", "commentID": 20012554, "userID": 1012816, "recommendations": 632, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012554}, {"approveDate": "1475569402", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475565802", "permID": "20012567", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palo Alto", "parentID": null, "userDisplayName": "WG", "commentTitle": "<br/>", "commentBody": "Laws and regulations well intended and thoughtly designed can be had by the greedy and self interested.  There are always the cracks that the morally challenged can and will run through for their own personal benefit.  The megalomaniac NY real estate developer Trump is not alone - there are others like him.  Can you  imagine in the last 16 years trying to convince a Republican President or Congress to change anything related to real estate developer tax write-offs?  No chance.   No chance at all.  if this man had any intention to state this was a problem or he had the solution, he would have made his tax returns public to make his point, and clearly propose a solution.  He has done neither willingly.  He will do neither if elected.... The conversion of LLC  income in his current tax proposal to a flat 15% tax rate is the biggest fraudulent tax grab ever - quickly followed by his elimination for he estate tax. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475552102", "commentID": 20012567, "userID": 1168413, "recommendations": 290, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012567}, {"approveDate": "1475575916", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475572316", "permID": "20012700", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "MaryEllen", "commentTitle": "<br/>", "commentBody": "Donald Trump’s con job has come full circle. The incredible irony of Trump supposedly being the outsider, the one who would shake up Washington, change the status quo, but who is actually living high off the hog as the consummate insider, is stupefying. Trump basically got $1 billion of tax free income off the backs of the American taxpayer. Imagine that. Imagine if you could fail catastrophically, and then pay no taxes for 18 years. While you were slogging away, paying your fair share, he was bilking our country. And laughing all the way to the bank.<br/><br/>Trump is the epitome of the rigged system his supporters hate. He is the gleeful beneficiary of laws that massively favor the rich and produce the wealth inequality that mobilized the Trump and Sanders campaigns.<br/><br/>Don’t you see, that in voting for Trump, you are voting to continue the very system that has enraged you? The system you know is rigged against you—and you are right, it is—and that the man you believe understands you only cares about himself and will never change anything that disadvantages him and his pals?<br/><br/>He has no interest in changing laws that would not favor him. He has no interest in helping struggling workers. His tax policies will only perpetuate wealth inequality. <br/><br/>And the ultimate irony is that American taxpayer dollars will pay his salary as president.  Sickening.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475553337", "commentID": 20012700, "userID": 31637014, "recommendations": 490, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012700}, {"approveDate": "1475576297", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475572697", "permID": "20012828", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago", "parentID": null, "userDisplayName": "msm", "commentTitle": "<br/>", "commentBody": "Trump didn't write the tax code.  We can't blame him for the special rules that give developers a huge break.  It's right to be upset that those rules exist.  And opinions may differ about whether taking advantage of those rules makes Trump smart or immoral.  But that is not what really concerns me.  What concerns me is that there are still a lot of people out there ready to elect as our next president a man who apparently thought it was ok to put at risk the collective livelihood of all the others that were ultimately impacted by an almost $1 billion one year loss -- all the businesses, municipalities, employees, etc., who weren't paid and had to absorb that loss. How can we even consider making a man capable of such reckless behavior the leader of the most powerful country on earth?  Trump supporters should also hear the stories of those who suffered the consequences of that loss ...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475554763", "commentID": 20012828, "userID": 58405352, "recommendations": 342, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012828}, {"approveDate": "1475576550", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475572950", "permID": "20012890", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Santa Rosa, CA", "parentID": null, "userDisplayName": "Kathy Lollock", "commentTitle": "<br/>", "commentBody": "It is not a surprising revelation that this exploitive and manipulative person has worked, and most likely continues to work, the \"system\" as it presently occurs. Also, it does not come as a shock that his supporters regard him as a \"genius\" and justified in his actions, or lack there of. After all, this is the Republican ideology...to pay little or no taxes whenever possible. He is probably one of a number of multi-millionaires who have carried this self-serving practice to a less than ethical extreme. <br/><br/>But here is the first question to his voters: How is he going to produce those jobs improving our deteriorating infrastructures without adequate taxation? And where will the money come from to improve our public education, even at the elementary level? He rants how the middle class has been left behind. Well, Mr. Trump, most these struggling Americans can not afford a private education nor the taxes required without you and your ilk doing your fair - and moral - share.<br/><br/>Bernie Sanders and now Hillary Clinton have it right. We can not justify our present taxation paradigm. We the middle class are placed in a situation where we are unfairly carrying the burden while the wealthy are getting away with paying proportionally less than they should. The loop holes and lopsided codes and rules must change to benefit the 99%. No more 1% favors.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475555460", "commentID": 20012890, "userID": 65256487, "recommendations": 276, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012890}, {"approveDate": "1475576643", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475573043", "permID": "20012914", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Partha Neogy", "commentTitle": "<br/>", "commentBody": "What we are realizing is that we have allowed the system, over time,  to be incrementally favorable to the moneyed interests and unfair to the rest of us.  What the Trump candidacy has made clear is that that trend could be pushed to grotesque extremes.  So, what are we going to do now?  Ignore the rising temperature till we are all boiled to death like the proverbial frog?  Or are we going to take control of the political process and make sure that this insidious trend is brought to a stop.  Time to pay attention, reflect, and do the right thing on November 8th.  It isn't often that we are allowed the opportunity to make a difference!  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475555729", "commentID": 20012914, "userID": 13105665, "recommendations": 194, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20012914}, {"approveDate": "1475582650", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475579050", "permID": "20013207", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "ann arbor, mi", "parentID": null, "userDisplayName": "richard heberlein", "commentTitle": "<br/>", "commentBody": "So let me see if I got this right. He has in effect shifted his losses onto the ordinary tax -payer (you and me) which he claims makes him \"smart\". He avoided serving his country in the military through another loophole which I assume also makes him \"smart. So the bottom line is that he is calling all those of us who served and pay taxes stupid.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475560639", "commentID": 20013207, "userID": 58244735, "recommendations": 302, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20013207}, {"approveDate": "1475582750", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475579150", "permID": "20013211", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Mark Kessinger", "commentTitle": "<br/>", "commentBody": "We should certainly dispense with the notion that Trump possesses any business prowess (although he does seem to have a certain undeniable talent for finding ways to extract himself from the financial messes he creates).  But more importantly, I think, we should have long ago dispensed with the very notion that being an effective CEO has much of anything at all to do with being an effective President of the United States.<br/><br/>A CEO runs an organization that has a aingle, overarching purpose:  the pursuit of profit and/or an increasing share value.  A President presides over a government that must serve many purposes to many different constituencies, some of whose interests are at cross purposes others'.  A CEO surrounds himself with people who have little choice but to implement his or her agenda without question, on pain of losing their jobs; a President must contend with a legislature comprised at least in part of often hostile political adversaries.  A CEO is accountable to a board of directors, which can be counted on to stay out of his way so long as the stock price continues to rise; a President is accountable to the entire electorate, which can be counted on not to stay out of his way for any reason.  A CEO can implement new policy merely by ordering it; a president must cajole, persuade, negotiate and build consensus.  In short, the skills of being an effective CEO have virtually nothing at all to do with being an effective President.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475560725", "commentID": 20013211, "userID": 165864, "recommendations": 196, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20013211}, {"approveDate": "1475582802", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475579202", "permID": "20013247", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "California", "parentID": null, "userDisplayName": "Dave Hearn", "commentTitle": "<br/>", "commentBody": "Donald Trump has filed for bankruptcy six times.  That is six massive failures that have left other people holding the bag.  <br/><br/>Trump lost over a billion dollars in a single year.  <br/><br/>Trump has failed at other businesses too.  He overpaid for Eastern Airlines, which was successful, and then ran it into the ground.  In 18 months he lost 128 million dollars and he finally walked away from over 200 million in debt.<br/><br/>If Trump wasn't able to shirk the huge debt of six bankruptcies and his other business failures where would he be today?  Penniless. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475561674", "commentID": 20013247, "userID": 63858546, "recommendations": 179, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20013247}, {"approveDate": "1475583180", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475579580", "permID": "20013438", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "AZ", "parentID": null, "userDisplayName": "Ann", "commentTitle": "<br/>", "commentBody": "No one said it better than the former GOP Mayor of New York City Michael Bloomberg:  \"Throughout his career, Donald Trump has left behind a well-documented record of bankruptcies, thousands of lawsuits, angry shareholders, and contractors who feel cheated and disillusioned customers who feel ripped off.......Trump says he wants to run the nation like he's run his business. God help us.\"", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475566879", "commentID": 20013438, "userID": 71283896, "recommendations": 386, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20013438}, {"approveDate": "1475583365", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475579765", "permID": "20013491", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "heartsny", "parentID": null, "userDisplayName": "MIMA", "commentTitle": "<br/>", "commentBody": "1995 - We scrimped away on our teacher/nurse combo salary because our kids were going to be going off to college soon and we wanted to make sure college for them would happen.  Drove old cars, paid our mortgage, ate frozen pizzas, gave a little to our church, grew a little garden, all those \"normal\" saving middle class things to get by and make ends meet.  Oh yeah, we paid federal income taxes, too.<br/><br/>Meanwhile Trump flew around in his own planes, lived in a penthouse, partied with the elite, and didn't pay a penny to the federal government?  The same government that helps pay for schools, roads, national parks, those things that we are all supposed to benefit from?<br/><br/>The difference?  He's a genius?  Doesn't add up, does it?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475568581", "commentID": 20013491, "userID": 51905269, "recommendations": 300, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20013491}, {"approveDate": "1475587936", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1475584336", "permID": "20012531:20014038", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "stu freeman", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "River Heights", "parentID": 20012531, "userDisplayName": "Carson Drew", "commentTitle": "<br/>", "commentBody": "@stu freeman: As proof of Trump's \"genius,\" Rudolph Giuliani said on \"Meet the Press\" last Sunday that Donald re-built his fortune after his massive failure in 1995 and is now worth billions.<br/><br/>The question that occurred to me was about the thousands of small business people who suffered losses due to Trump's casino bankruptcies. Wouldn't an honorable man have used some of the billions he supposedly acquired subsequently to pay them back? If he's as fabulously wealthy as he and his surrogates claim, he surely can afford to. If he truly cared about the \"little guys\" he's now counting on to vote for him, wouldn't he have have made justice for them a priority?<br/><br/>How could Trump just walk away, conscience-free, and allow others to suffer from his business incompetence and recklessness?", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2690/0165/cropped-26900165.jpg?0.8206388991097251", "createDate": "1475576768", "commentID": 20014038, "userID": 26900165, "recommendations": 147, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014038}, {"approveDate": "1475587972", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475584372", "permID": "20014041", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Amherst, MA", "parentID": null, "userDisplayName": "John", "commentTitle": "<br/>", "commentBody": "Trump's record of lying means we cannot believe anything about his finances, especially without seeing his taxes. Nothing to hide? no problem. At one point, as Trump defaulted on a loan from Deutschebank, and the bank almost foreclosed. Then they realized he'd collateralized the loan with shares in a number of ventures which were based on the 'Trump name brand', which would become worthless if Trump went into highly public financial ruin, and they 'renegotiated'. Trump had become too big to fail. He is a con man of epic proportions. face it.<br/>The Orange Messiah now boasts that he alone knows the tax code well enough to fix it. This doesn't fly. Not now. Not without tax forms. Trump could have, from the start, said, 'Look, here's my taxes. See the zeroes? That's a problem, and here's how I'd fix it so that I owe the IRS a bunch of money it's losing to loopholes.' But THAT was not the way Trump rolls...", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475576792", "commentID": 20014041, "userID": 30311589, "recommendations": 103, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014041}, {"approveDate": "1475588855", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475585255", "permID": "20014382", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY", "parentID": null, "userDisplayName": "Bob", "commentTitle": "<br/>", "commentBody": "Trump talks of having a fiduciary responsibility to his company and shareholders but is this loss not taken on his personal return? I don't see how that benefits anyone but himself.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475579457", "commentID": 20014382, "userID": 76956154, "recommendations": 97, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014382}, {"approveDate": "1475588889", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475585289", "permID": "20014398", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "East Hampton, NY", "parentID": null, "userDisplayName": "East End", "commentTitle": "<br/>", "commentBody": "It is one thing to simply state that you have used the tax code to your advantage. All of us do. It is quite another thing if you wish to be a leader and a role model to admit to this fact but then hasten to add that thew system is unfair and needs reform. Trump boats of the former and is silent about the latter. What one can conclude by any reasonable standard is that his priority is his own enrichment. His brand of selfishness may be representative of his political party, especially the wealthiest within it, but it is not an accurate reflection on the honest generosity of the majority of Americans. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475579559", "commentID": 20014398, "userID": 48026298, "recommendations": 51, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014398}, {"approveDate": "1475589200", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475585600", "permID": "20014451", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Jackson, NJ", "parentID": null, "userDisplayName": "MLS", "commentTitle": "<br/>", "commentBody": "During the Primaries he said that he gave politicians money, consequently expecting and getting favors. In other words he bragged about bribing people. Now he says \"they\" allowed the tax loopholes he use to avoid taxes. The same \"they\" he bribed?<br/><br/>And his tax plan, as published, does not do away with the loopholes he uses.<br/><br/>He lies as he breathes.", "userURL": "NULL", "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475579970", "commentID": 20014451, "userID": 36888586, "recommendations": 87, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014451}, {"approveDate": "1475589273", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475585673", "permID": "20014489", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "USA", "parentID": null, "userDisplayName": "Alan", "commentTitle": "<br/>", "commentBody": "Republican philosophy:  Rich people who pay no taxes are geniuses.  Poor people who pay no taxes are moochers.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475580223", "commentID": 20014489, "userID": 49334022, "recommendations": 233, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014489}, {"approveDate": "1475589428", "commentType": "comment", "userTitle": "NULL", "updateDate": "1475585828", "permID": "20014649", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "metro detroit", "parentID": null, "userDisplayName": "veh", "commentTitle": "<br/>", "commentBody": "There's a certain logic to saying he was smart to leverage the tax code in order to avoid paying taxes<br/><br/>There is NO logic in claiming to be a yuuge success at business when the record shows he lost that much money. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1475581109", "commentID": 20014649, "userID": 49057690, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20014649}], "totalEditorsSelectionReturned": 25, "replyLimit": 3, "totalRecommendationsReturned": 25, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 973, "api_timestamp": "1488822359", "totalReplyCommentsFound": 288, "totalCommentsReturned": 25, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}