{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 1, "totalParentCommentsReturned": 20, "totalParentCommentsFound": 844, "totalEditorsSelectionFound": 21, "depthLimit": 0, "totalRecommendationsFound": 835, "comments": [{"approveDate": "1479296745", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479407298", "permID": "20500251", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 17, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island N.Y.", "parentID": null, "userDisplayName": "Patrick", "commentTitle": "<br/>", "commentBody": "Rudolph the brown nosed Reign Dear talks down to people and defers to his own opinion while disregarding others. To send Guiliani to other nations would only export the arrogant dictatorial attitudes both he and Trump have. A diplomat is depended on to keep the peace and negotiate with other nations to promote trade and comraderie. Unfortunately Giuliani is a former federal prosecutor accustomed to adversarial conduct and accusing others of crimes, a counterproductive trait for any diplomat.<br/><br/>If Trump really wants to make America great again, he must find a capable diplomat from within the experienced ranks of the State Department to keep the peace so we can grow without the chains of foreign conflict or distraction.   We can only become great if our new isolation is matched with effective management of threats to our peace and prosperity. <br/><br/>The next four years will be an experiment I really want to work now that we have no choice but to be a part of it. We will be isolated indeed making seasoned effective diplomacy even more important than ever.<br/><br/>I'm not kidding when I say that Trump should select Clinton or Kerry as Secretary of State with their wealth of experience, in turn showing the world that we can succeed peacefully and lead by example. <br/><br/>New political appointments are wasteful of years of experience and knowledge.<br/><br/>Picking Giuliani who is bucking for any job is a mistake that will alienate the world and really isolate us. Choose experience and low drama for peace.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4428/7968/cropped-44287968.jpg?0.07104355978353172", "createDate": "1479272003", "commentID": 20500251, "userID": 44287968, "recommendations": 429, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20500251}, {"approveDate": "1479296836", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479407300", "permID": "20500273", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 16, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Toronto", "parentID": null, "userDisplayName": "Joyce", "commentTitle": "<br/>", "commentBody": "Is there anything that the NYT or anyone else says or do will make a difference to how Trump will act.  The fact is the lunatics have taken over and sadly the craziness will have to play out. <br/><br/>The best thing that can be done is to work in a very positive, constructive, focused way to defeat the Republican Congress and Senate in two years and to prevent him from having a second term. <br/><br/>All ugliness about Trump has been exposed. To keep attacking  him will make him react more viciously. It will also strengthen the loyalty of his supporters. If he feels cornered, he will look to distract and do crazy things like arrest Hillary or start a war somewhere. ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3466/4758/cropped-34664758.jpg?0.15662570018321276", "createDate": "1479272182", "commentID": 20500273, "userID": 34664758, "recommendations": 593, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20500273}, {"approveDate": "1479303261", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479303261", "permID": "20501847", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Long Island", "parentID": null, "userDisplayName": "Renaissance Lost", "commentTitle": "<br/>", "commentBody": "I was a tourist traveling in Istanbul shortly after President Obama was elected in 2008. There, I remember seeing his face on the cover of a copy of Time magazine at a busy curbside newsstand. I felt especially proud again to be an American abroad, a proud citizen of the USA, as well as a citizen of the world.  <br/><br/>I remember President Obama receiving the Nobel Peace prize when he quite literally had done nothing yet worthy of such an honor and yet, at that time, to many Americans, it felt right. Even though now I must admit that winning the prize then was wildly premature and inappropriate. Nonetheless, our nation had shed some of the over-the-top, self-serving post 911 attitude prevalent during the Bush years.<br/><br/>If Rudy Giuliani takes the office of Secretary of State, we will most certainly look at the Bush years as enlightened by comparison. Rudy has not demonstrated even the slightest bit of diplomatic skill. His world view is still rooted in the horrors of 911. No doubt he will reconstitute the worst possible aspects of our nations post 911 world.<br/><br/>We can be tough on trade deals and we can insist that our allies do their fair share in supporting global security without being a bully. Instead we can be tough, like Ronald Regan: Peace through strength; Trust but verify. There is nothing, absolutely nothing about Rudy Giuliani that even begins to project an image that will serve our nation well. We should reserve his bitter, sneering, snarl for right wing cable news punditry.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479295182", "commentID": 20501847, "userID": 634163, "recommendations": 221, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20501847}, {"approveDate": "1479303419", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479303419", "permID": "20503043", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 4, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Austin", "parentID": null, "userDisplayName": "slimjim", "commentTitle": "<br/>", "commentBody": "Guliani is like those things that leap out of people chests in the Alien movies.  Gingrich, Christy, Bannon, Ailes, are all like characters in the bar scene in Star Wars.  The First Family are like robots programmed for monarcho-fascism.  So, put a bunch of paranoid crackpots, oligarchs-in-waiting and desperate has-beens in a gilded palace to divvy up unimaginable power, and place at the center a terrified, clueless, instinctively cruel narcissist who never dreamed in his worst nightmares that he would be in such an impossible position, what could go right?  He will be desperate to conceal his incompetence, and live in constant fear of being further revealed as exactly the corrupt, self-serving insider he has always been and falsely accused Clinton of being.  Wish him good luck if you want to, but that won't be enough.  The silver lining may be that they are so unable to pull together a coherent government that the bureaucracy muddles along essentially unguided until adults can be be put back in charge. It isn't as if America is solidly behind him.  He ran third:. 50% didn't vote, Clinton got 48% + a million, Trump a flat 48%.   And 60%+ still think he may well be dangerously unqualified.   And for Republicans, the faster they can push him out and install Pence, who has demonstrated that he has no spine of any kind, and will do and say as he is told to, the better.   ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479301709", "commentID": 20503043, "userID": 52033678, "recommendations": 291, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20503043}, {"approveDate": "1479303600", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479407304", "permID": "20503107", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NYC", "parentID": null, "userDisplayName": "Bill B", "commentTitle": "<br/>", "commentBody": "Giuliani has no foreign policy experience and no real background in the area. What he does have is being one of the few people who defended the President-elect after the Access Hollywood tape issue and also being someone who has taken the indefensible position that Trump shouldn't put his holdings into a blind trust.  This is a bad sign that the appointments will value personal loyalty over qualifications.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479302069", "commentID": 20503107, "userID": 4523842, "recommendations": 271, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20503107}, {"approveDate": "1479303650", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479303650", "permID": "20503416", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 8, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, NY", "parentID": null, "userDisplayName": "Ric Fouad", "commentTitle": "<br/>", "commentBody": "There is also Giuliani's deplorable character, intense selfishness, and cruelty, as revealed in dozens of examples. Here are just two.<br/><br/>In perhaps the most galling court request ever, then Mayor Giuliani asked the judge in his divorce proceeding to order his wife to allow his mistress to stay under the same roof as his wife and kids, pending conclusion of the divorce. Giuliani argued that the judge should grant this shameful request because as mayor, he lived in Gracie Mansion, with his family, and the latter needed to accommodate him. The judge of course said no.<br/><br/>When the bereaved mother of an African-American youth who had been killed fleeing the police questioned then Mayor Giuliani about it, the heartless Giuliani offered not one syllable of empathy, concern, or simple acknowledgment that he understood her pain as a mother who had lost a child. Instead, Giuliani lashed into her viciously, said it was her fault for the way she raised the young man, and curtly dismissed her. I was in shock just hearing such chilling words, and from a public figure.<br/><br/>There is no end to stories just like these. The common themes are insatiable desire for ego gratification, total disregard for decency, sheer cruelty to those without power—would only I had more space, we could look at his shameless pandering too: the man is a moral coward to boot.<br/><br/>The bottom line is that Giuliani has long since shown himself unfit for any public office, least of all Secretary of State.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/1463/8698/cropped-14638698.jpg?0.07996711158193648", "createDate": "1479303442", "commentID": 20503416, "userID": 14638698, "recommendations": 591, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20503416}, {"approveDate": "1479305270", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479305270", "permID": "20503097", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York, N.Y.", "parentID": null, "userDisplayName": "sixmile", "commentTitle": "<br/>", "commentBody": "As per the editorial, while Giuliani is no statesman, has a raft of potential conflicts of interest, has made dodgy decisions and inflammatory remarks all over the map and is unfit to be Secretary of State, he does display the slavish devotion and loyalty to his lord and master -- than which few if any qualities are regarded more highly as qualifications for office, any office, by the president-elect.  Add in raving to the edge of lunacy, frequently appearing unhinged and foaming at the mouth and, well, you can see how irresistible this little attack dog is to the incoming administration.  As Jimmy Breslin described Giuliani, he is \"a small man in search of a balcony.\"  In Trump he seems to have found it. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479302034", "commentID": 20503097, "userID": 10891595, "recommendations": 263, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20503097}, {"approveDate": "1479305490", "commentType": "userReply", "userTitle": "NULL", "updateDate": "1479305490", "permID": "20499993:20500971", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": "Richard Luettgen", "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Europe", "parentID": 20499993, "userDisplayName": "Red Lion", "commentTitle": "<br/>", "commentBody": "Richard, please. Let's leave aside for the moment that Giuliani has a temperament rooted in rage and grievance. Let's leave aside for a moment his history of overt racism. Let's leave aside for a moment his significant conflicts of interest.<br/><br/>Even if all those things were not in play, he has almost zero experience in diplomacy. I think John Bolton is a war-mongering psychopath, but at least one can make a case that he has experience that is relevant to the job. Giuliani has none.<br/><br/>Giuliani is up for the job because his fact-free resentment of everyone who doesn't him mirrors that of his would-be boss.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4712/7241/cropped-47127241.jpg?0.9181589698418975", "createDate": "1479280379", "commentID": 20500971, "userID": 47127241, "recommendations": 180, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20500971}, {"approveDate": "1479306394", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479306394", "permID": "20501851", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Palm Beach Fl.", "parentID": null, "userDisplayName": "Edward Calabrese", "commentTitle": "<br/>", "commentBody": "Giuliani is the worst possible choice for ANY diplomatic post.<br/>He can no longer speak without screaming like a madman. His ties to unfriendly governments (as clients) certainly disqualify him that much further.<br/>Giuliani is a take no prisoners bully, His feuds when he was mayor  were legend.The man ran a police state and Police brutality was rampant under his tenure as mayor.<br/>He is a divisive, immoral man who not only cheated on his wife but publicly humiliated her by announcing his divorce plans at a news conference before informing her.<br/>A perfect Trump character profile.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479295205", "commentID": 20501851, "userID": 75786909, "recommendations": 315, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20501851}, {"approveDate": "1479306596", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479306596", "permID": "20503806", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Searsmont, ME", "parentID": null, "userDisplayName": "opop", "commentTitle": "<br/>", "commentBody": "Guiliani is a bully's bully, of course he's a front runner for our bully president-elect's cabinet. Best we can hope for is a very short run if he's selected because, after a moment of sneering collusion, our bully-in-chief will feel threatened and fire the bully-of-state.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479305019", "commentID": 20503806, "userID": 32706350, "recommendations": 118, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20503806}, {"approveDate": "1479306886", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479306886", "permID": "20502104", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cornelius, NC", "parentID": null, "userDisplayName": "Thomas Payne", "commentTitle": "<br/>", "commentBody": "Exactly as I figured: they win the big prize and now don't have competent, honest people to put into the jobs. Giuliani, Bolton, Gingrich, all the failed retreads of the republican party will insure that we will never rise above \"incompetent\" as we head for \"greatness.\" ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5740/5110/cropped-57405110.jpg?0.4209849031176418", "createDate": "1479297024", "commentID": 20502104, "userID": 57405110, "recommendations": 249, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20502104}, {"approveDate": "1479307543", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479307543", "permID": "20504318", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Washington, Dc", "parentID": null, "userDisplayName": "Ed", "commentTitle": "<br/>", "commentBody": "Mayor Giuliani did a super job as U.S. Attorney in NY for a number of years, then in serving as mayor of NYC for eight years. His particular service in raising the spirits and economic health of the city and its citizens after 9/11 deserves every kudo imaginable. During that service in NYC, Mr. Giuliani became friends with Mr. Trump, and they've maintained their friendship throughout the years - something which cannot and should not be underappreciated.<br/><br/>However, as is the case with a number of Republican leaders, Mr. Giuliani has actively supported someone who has a limitless history of bullying others, unwarranted insults, racist comments, and assaults on woman. And it will never, ever be appropriate for any thinking American to find such abhorrent personal behavior and disrespect for the human dignity of others to be acceptable.<br/><br/>Hopefully Mr. Giuliani and other leaders in our government will realize that vile personal behavior and disrespect for the human dignity of others should always be called out for what it is, and be strongly objected to – particularly by those in seats of power to which they were elected or appointed to serve. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479306776", "commentID": 20504318, "userID": 66458333, "recommendations": 28, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20504318}, {"approveDate": "1479308370", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479308370", "permID": "20501653", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Richmond, RI", "parentID": null, "userDisplayName": "Ed M", "commentTitle": "<br/>", "commentBody": "He could be in charge of getting rid of unwanted car window washing at stop lights.  That was helpful.  Can't think of anything else useful.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479293145", "commentID": 20501653, "userID": 501960, "recommendations": 136, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20501653}, {"approveDate": "1479308493", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479308493", "permID": "20501543", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Britain", "parentID": null, "userDisplayName": "tony moon", "commentTitle": "<br/>", "commentBody": "This is the same  Giuliani  who during the  recent election claimed that he could not recall seeing Hilary Clinton  at the Ground Zero site.<br/><br/>Cut to: a photograph of him  standing next to her at Ground Zero.<br/><br/>These guys will tell any lie to advance their cause.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479291855", "commentID": 20501543, "userID": 73641287, "recommendations": 273, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20501543}, {"approveDate": "1479309061", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479309061", "permID": "20500798", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "canada", "parentID": null, "userDisplayName": "Rw", "commentTitle": "<br/>", "commentBody": "I go to bed, barely able to sleep.  I get up dreading turning on the TV.  Can anybody forget the Armageddon spectacle that was the Trump/Republican National Convention, with Giuliani in a starring role?  And now trump is doing a casting call for the sequel, again starring Giuliani.  Maybe tomorrow will be the day I finally unplug/cut the cord...but, who can avoid watching this train wreck in real time.  Giuliani needs the state hospital, not the state department.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479277945", "commentID": 20500798, "userID": 46543369, "recommendations": 170, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20500798}, {"approveDate": "1479309500", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479309500", "permID": "20504717", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 1, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "NY NY", "parentID": null, "userDisplayName": "Jen", "commentTitle": "<br/>", "commentBody": "I don't know why the NYT is dancing around it: Giuliani, like the man he helped put in office, is a notorious racist and a bully.  Diplomacy is possibly his weakest suit, which is why in past years Republicans have continually rejected him as a serious candidate for national office.  His appointment to Secretary of State would be like telling a fish to ride a bicycle.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479308254", "commentID": 20504717, "userID": 46931511, "recommendations": 186, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20504717}, {"approveDate": "1479309528", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479309528", "permID": "20502610", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Athens GA", "parentID": null, "userDisplayName": "Alistair Bruce", "commentTitle": "<br/>", "commentBody": "The hubris and short-term memory of the NYT editorial board is staggering.  Were you even living in the City on Sept 11 2001 and the days that followed?  My wife and I were and Mayor Giuliani was a Churchillian figure at that pivotal moment in our history.  He showed great humanity, compassion and most significantly courage.  He told it as it was.  He did not embellish.  He treated the people of NYC like adults.  He told us the truth.  My family will always honor him for how he impacted our lives and our City in those darkest of days.  Do we agree with every choice he has made since then?  No.  However, the lack of balance, lack of basic respect shown in this editorial are below what I expect from this newspaper.  We celebrated in our home last night at the news that he might be our Secretary of State.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479299775", "commentID": 20502610, "userID": 4616048, "recommendations": 14, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20502610}, {"approveDate": "1479309837", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479309837", "permID": "20501396", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New York", "parentID": null, "userDisplayName": "Steven McCain", "commentTitle": "<br/>", "commentBody": "If anybody is old enough to remember 9-11-2001 they will know that on 9-10-2001 New Yorkers could not get Rudy out of Gracie Mansion fast enough. During Rudy’s tenure as mayor he waged war on The Squeegee Men and what some thought people of color. Sure, he cleaned up Times Square but some would argue Times Square is not Times Square anymore. Have we forgotten that he divided the city like no other mayor in our time? His police force Street Crimes Unit wore tee shirts embolden with “We Own the Night”. When Abner Lumina was brutalized in police stations bathroom in Brooklyn or when Amado Diallo was shot forty times in a hallway in the Bronx he never came across as a diplomat. Rudy’s default position was always the cops were right and the victims had it coming to them. Have we forgotten Rudy fired Police Commissioner Bratton when Bratton got more press than he did? Rudy did what I believe any other mayor would have done on 9-11 but the press anointed him America’s Mayor. Have we forgotten when Rudy and Alfonse D’Amato played undercover operatives in a police van in Harlem in the seventies? Diplomats manage the relationships of entire countries with the world. The world knows Trump owes Rudy big time for the position he will take in January 2017 but does he owe him that much? How does he give the job of the biggest deal maker in the world to someone who is an autocrat? Diplomacy is the art of give and take with Rudy it is either his way or the highway.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479289897", "commentID": 20501396, "userID": 51415176, "recommendations": 157, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20501396}, {"approveDate": "1479310075", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479310075", "permID": "20500979", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "DC", "parentID": null, "userDisplayName": 123, "commentTitle": "<br/>", "commentBody": "Amen. America's mayor my foot. I was in New York while he was mayor. I was in New York on 9/11 and its aftermath. <br/><br/>His \"policy misadventures\" regarding 9/11 go well beyond mislocating the command center. For instance, ask the 9/11 first responders what they think now of his casual concern for their health and safety, the inadequate protective gear and his obstructing follow-up health care and compensation. Ask them what they think of his decision to rush the clean-up, forcing many victims' remains, including those of many first responders, to be recovered from the Fresh Kills garbage dump for burial.<br/><br/>But why is the Times reporting his potential conflicts of interest only now? Notice that links to them all lead to news sources other than the Times. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479280548", "commentID": 20500979, "userID": 46722908, "recommendations": 114, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20500979}, {"approveDate": "1479310205", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479310205", "permID": "20504089", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Cheyenne WY", "parentID": null, "userDisplayName": "HighPlainsScribe", "commentTitle": "<br/>", "commentBody": "Don't you just love it? Giuliani and Trump spent months blasting Clinton for a handful of paid speeches. Elsewhere in the NYT today you can read that in 2006 alone Giuliani made 170+ paid speeches garnering 11.4 million for his efforts. The speeches were made to a number of bad actors, including some on the Terrorist Watch List. After being well-paid, Rudy successfully lobbied the removal of a group from that list. He has made huge money in the Muslim world he is so critical of.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6573/5846/cropped-65735846.jpg", "createDate": "1479306029", "commentID": 20504089, "userID": 65735846, "recommendations": 175, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20504089}, {"approveDate": "1479311602", "commentType": "comment", "userTitle": "NULL", "updateDate": "1479311602", "permID": "20505633", "status": "approved", "trusted": 0, "sharing": 1, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "seattle", "parentID": null, "userDisplayName": "DCC", "commentTitle": "<br/>", "commentBody": "The measure of a leader's ability is their choice of assistants. Reagan demonstrated that in spades by appointing and delegating and was able to rule effectively while taking more than his share of time off. But he had the decades of political experience to choose good people to help him. Trump may have good intentions but he is a political neophyte and his choice of cabinet members is dismal.  Ulitmately, Trump may be his own worst enemy as his opponents sit back and watch his presidency self-destruct.  ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1479311481", "commentID": 20505633, "userID": 60521678, "recommendations": 69, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 20505633}], "totalEditorsSelectionReturned": 21, "replyLimit": 3, "totalRecommendationsReturned": 21, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 1346, "api_timestamp": "1488822356", "totalReplyCommentsFound": 502, "totalCommentsReturned": 21, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}