{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"totalReplyCommentsReturned": 0, "totalParentCommentsReturned": 13, "totalParentCommentsFound": 395, "totalEditorsSelectionFound": 13, "depthLimit": 0, "totalRecommendationsFound": 423, "comments": [{"approveDate": "1459242034", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459238434", "permID": "18037836", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Metro Detroit", "parentID": null, "userDisplayName": "Patricia Lay-Dorsey", "commentTitle": "n/a", "commentBody": "If the worst were to happen and Donald Trump were elected president of the United States in November, I suspect there will be many people in our country and around the world who will look back with longing on the presidency of Barack Obama. <br/><br/>Whether or not one agreed with his foreign-policy decisions, it was always obvious that they were made with deliberation, maturity and intelligence. President Obama chose advisers who did not always agree with him nor did they agree with one another, but they were all qualified and respected in their fields. I doubt if President Obama ever made any foreign policy decision without serious consultation with advisors on all sides of the question. His policies and actions were consistent with the values he espoused. We were never shocked at anything President Obama said or did.<br/><br/>If Mr. Trump becomes our commander-in-chief, President Obama will be sorely missed by conservatives, moderates and liberals alike. And I am afraid that is the only way that Mr. Trump would unite our country.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459232435", "commentID": 18037836, "userID": 70276100, "recommendations": 530, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18037836}, {"approveDate": "1459242157", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459238557", "permID": "18037978", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 6, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Chicago, Il", "parentID": null, "userDisplayName": "Andy W", "commentTitle": "<br/>", "commentBody": "Running the most powerful nation in the world is several orders of magnitude more complex than becoming a successful real estate developer. More complex than even becoming a billionaire at it. There are actually quite a few people who have made a fortune in real estate. Extreme success in that field is more common than in most others. It's a fairly well understood business, with a ton of established resources at the disposal of any competent developer. It would be wise for people not to be so impressed with Mr. Trump's professed business acumen. He's never solved any great business challenges or created a new product category. He has also had an awful time trying to apply his professed skills in many a failed venture outside of real estate. Let's all hope America doesn't become one of those.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459236222", "commentID": 18037978, "userID": 57641454, "recommendations": 375, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18037978}, {"approveDate": "1459242385", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459238785", "permID": "18038141", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "New Jersey", "parentID": null, "userDisplayName": "Donny", "commentTitle": "<br/>", "commentBody": "Trump is no different from his Republican rivals , excepting perhaps Kaisch , in not comprehending the nature of the enemy and of the \"war\" being waged. ISIS and other Jihads  are nothing like traditional armies and are woven into thousands of square miles of loosely occupied territory meaning bombing campaigns or even large incursions of ground troops will only do so much.It would be interesting to hear what the three remaining candidates thought of the concept of \" soft power\" as formulated by Joseph Nye and others, in the case of Mr. Trump I'd be shocked to learn he was even familiar with it but I'm not sure anything Mr Cruz would say was less frightening. I would also be interested to know how either Ted or Donald would respond when they learned the entire intellectual wing of the military establishment was uniformly  opposed  to their analysis and strategies. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459241350", "commentID": 18038141, "userID": 74646842, "recommendations": 215, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038141}, {"approveDate": "1459252750", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459249150", "permID": "18038522", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 3, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "south florida", "parentID": null, "userDisplayName": "TKB", "commentTitle": "<br/>", "commentBody": "Donald Trump's knowledge of foreign affairs is so foreign to himself and to us too.<br/><br/>In one moment, he wants to 'stop giving  Iran, it's frozen assets as per the deal that the Europeans and the current administration worked out of the Iran nuclear deal but on the other hand he's lamenting that the Europeans are getting all the business orders from Iran and if he's the President he'll make sure that America cuts a deal and get all the orders'.<br/><br/>\"Which one of you're talking, Mr. Trump ?<br/> Do you even know what's in that Nuclear accord with Iran ?\"<br/><br/>There are many contradictions in the mind of President Trump, if his voters have their way, which I sincerely doubt.<br/><br/>Here's few more : when he suggests that he would nuke the I.S.I.S. but then about taking all the oil from them .<br/><br/>How can he take their oil, if he nuke them ? Will any of the oil stockpiles survive in the middle-east if he nukes any country in such close proximity where they live among each other ?<br/><br/>And does he even know anything about nuclear 'fallout' or 'chain reaction or 'the radioactive cloud which will travel all across middle-east, even through our friend and ally Israel's sky on its way to the Western Europe ?<br/><br/>Does he know anything about the difference between Nuclear fusion and Nuclear fission ? Because if he knows, he'll never talk in such general terms about Nuking any country or handing over the Nuclear Bomb technology to Japan and South Korea ?<br/><br/>Do we really need a President in training ?<br/><br/>I rest my case.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459247628", "commentID": 18038522, "userID": 72852624, "recommendations": 190, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038522}, {"approveDate": "1459255376", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459251776", "permID": "18038575", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Rochester NY", "parentID": null, "userDisplayName": "TDurk", "commentTitle": "<br/>", "commentBody": "Yes, Donald Trump is unqualified to be President of the United States as the text of his interviews clearly demonstrates.<br/><br/>That said, some of the issues he raises are issues worth revisiting by our leaders.  <br/><br/>Our purported allies have been getting a free ride on America's military and foreign aid budget.  President Obama, who has done a great job extricating America from W's war of ambition said as much in his recent Atlantic interview. <br/><br/>With the exception of the UK, NATO members do not meet their funding obligations.  Saudi Arabia has fomented most of the Islamic terrorism in the world by dint of their use of Wahhabist madrassas and Imans as elements of their theocratic foreign policy.  The list goes on.<br/><br/>It is long past due that the American government pay heed to the advice of the founding fathers not to entangle the country in foreign alliances.  Some are undoubtedly necessary, but too many of them only serve to inflate our defense budgets at the expense of domestic needs.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459248452", "commentID": 18038575, "userID": 21573232, "recommendations": 80, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038575}, {"approveDate": "1459255615", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459252016", "permID": "18038694", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Boston", "parentID": null, "userDisplayName": "olivia james", "commentTitle": "<br/>", "commentBody": "How can anyone take a man seriously whose top issue, and the one he's clearly given the most thought to, is the length of his fingers? He spent a lot of time with the Washington Post editorial board discussing them, and featured them in his debate remarks. He's au currant on his fingers, but not much else.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459249784", "commentID": 18038694, "userID": 47483898, "recommendations": 147, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038694}, {"approveDate": "1459255745", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459252145", "permID": "18038751", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mexico", "parentID": null, "userDisplayName": "John Townsend", "commentTitle": "<br/>", "commentBody": "I wonder if people are really listening to Trump, I mean the actual words coming out of his mouth. On the Mexican wall for example he insists “I would build a great wall, and nobody builds walls better than me, believe me”. And it doesn't stop there. Consider these dillies ...<br/><br/>&gt; “I will be the greatest jobs president that god ever created”<br/>&gt; “No one knows the system better than me”<br/>&gt; “No one would be tougher on ISIS than Donald Trump”<br/>&gt; “No one loves the bible better than I do”<br/>&gt; “There’s nobody bigger or better at the military than I am”<br/>&gt; “I could be more presidential than anybody”. <br/><br/>When asked about his information sources he asserts \"All I know is what’s on the internet”. This guy has serious mental issues.", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6974/5052/cropped-69745052.jpg?4287809851024206165", "createDate": "1459250411", "commentID": 18038751, "userID": 69745052, "recommendations": 476, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038751}, {"approveDate": "1459255771", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459264312", "permID": "18038767", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 5, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Saint Augustine, Florida", "parentID": null, "userDisplayName": "Carolyn", "commentTitle": "<br/>", "commentBody": "Trump bashing is not going to influence the outcome of the election.  By titling an article \"Mr. Trump's Dangerous Babble,\" the very people that the NYT Editorial Board wants to influence are immediately disengaged.  If the Board wants to preach to the choir, so be it.  It can always hope that the choir outnumbers the congregation.  Otherwise, it is best to put Trump's words in context and avoid sneering headlines and words like \"babble.\" <br/><br/>It's very likely that Trump will wind up with the Republican nomination because there are millions of Americans out there that want him as a president.  By being so disrespectful to Trump and taking a scornful approach, it's as if the Board wants to discount this huge swath of Americans, as if they are not important. But they are important, extremely important, in fact vitally important to the election and thus, the future of this country.  No matter how much the NYT wants Clinton to be president, the paper is only as potent as its ability to sway that people that don't support her, and the Board, in my humble opinion, is not at all persuasive when it is more divisive and alarmist than informative.  ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6733/4363/cropped-67334363.jpg?0.139570734036513", "createDate": "1459250577", "commentID": 18038767, "userID": 67334363, "recommendations": 72, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038767}, {"approveDate": "1459255884", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459252284", "permID": "18038830", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Mexico", "parentID": null, "userDisplayName": "John Townsend", "commentTitle": "<br/>", "commentBody": "The so called GOP “establishment\" is reeling, unable or unwilling to embrace the stark reality that a shady, bloviating liar is hardening the image of the party as a symbol of intolerance and division, whose quest for the presidency revolves around targeting religious and racial minorities and people with disabilities, who flirts with white supremacists and who has turned vicious ridiculing and slandering of those who disagree with him into a new politicking art-form. It makes a mockery of Paul Ryan’s mealymouthed assertion that the GOP “does not prey on people’s prejudices. It appeals to their highest ideals. This is the party of Lincoln.” ", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6974/5052/cropped-69745052.jpg?4287809851024206165", "createDate": "1459251124", "commentID": 18038830, "userID": 69745052, "recommendations": 178, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18038830}, {"approveDate": "1459263250", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459259650", "permID": "18039605", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Newpaltz", "parentID": null, "userDisplayName": "joe cantona", "commentTitle": "<br/>", "commentBody": "All true but I don't expect Trump to be elected. And Cruz, while offering a steadier and more consistent creepiness factor has no chance at all. I'm more worried about Clinton who's prospects of a presidency are real. She's not Trump, but still has a big mouth and is not as smart as so many depict her to be. Her anti-Russia rhetoric for example is just ripe for triggering yet another cold war. I don't like the manner in which she engages the world and her track record is not a good one. ", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459256064", "commentID": 18039605, "userID": 71772578, "recommendations": 31, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18039605}, {"approveDate": "1459269283", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459265683", "permID": "18042076", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Midwest", "parentID": null, "userDisplayName": "TheraP", "commentTitle": "<br/>", "commentBody": "DT's so-called \"campaign\" is nothing more than his \"back of the envelope\" snap opinions.  Nothing thought-through.  Just a disputed bunch of assertions and off-the-cuff platitudes.  Grounded in nothing!  <br/><br/>A man who is unable to control his mouth and speaks without any filter at all, has no coherent philosophy of anything, unless it's \"Donald First\" or \"America First\".  This type of thinking belongs in an elementary classroom - to a kid who's got problems.  Not to an adult, who excuses his misogyny by saying, \"I never intended to run for president.\"<br/><br/>It is embarrassing and outrageous that a man like DT is close to capturing the GOP nomination for president, close to occupying the White House, close to having the nuclear codes and being in charge of running foreign policy.<br/><br/>Shooting from the hip is NOT a foreign policy.  Or any other kind of policy.<br/><br/>The Times is right to call his policy verbiage Babble.  Any GOP politicians who fail to condemn the candidacy of DT are guilty of political malpractice.  They are not fit to serve in office, any more than DT - it's a national disgrace!", "userURL": "NULL", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/3219/5826/cropped-32195826.jpg?0.033850603736937046", "createDate": "1459266631", "commentID": 18042076, "userID": 32195826, "recommendations": 78, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18042076}, {"approveDate": "1459269388", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459265788", "permID": "18041978", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 2, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Seattle, WA", "parentID": null, "userDisplayName": "Adam", "commentTitle": "<br/>", "commentBody": "Trump supporters are electing a personality, not policies.<br/><br/>They don't know or care what policies Trump is actually proposing.  All they know is \"the elite\" are doing a bad job, and he will do things differently... which is just fine. <br/><br/>Trumpism is a cult of personality, among many other things.", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459266336", "commentID": 18041978, "userID": 46912795, "recommendations": 64, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18041978}, {"approveDate": "1459275490", "commentType": "comment", "userTitle": "NULL", "updateDate": "1459271890", "permID": "18043069", "status": "approved", "trusted": 0, "sharing": 0, "parentUserDisplayName": null, "replyCount": 0, "replies": [], "editorsSelection": true, "timespeople": 1, "depth": 1, "userLocation": "Philadelphia PA", "parentID": null, "userDisplayName": "Ian MacFarlane", "commentTitle": "<br/>", "commentBody": "The idea of \"Keep America Safe\" is a bill of goods which we have bought since the end of WW2. Sheer repetition has made it what it is today, a mantra that continues to fill defense industry coffers.<br/><br/>We could have and still can stop spendiong the little money we have on our worldwide military presence without suffering any ill effects. Who is going to attack our nation? The few grouped or even less individual madmen who after 9/11 have lost the ability to bring major criminal catastrophe to a naive public?<br/><br/>Bring our troops home. Repair our infrastructure. Educate and feed our children. Reopen closed manufacturing plants. Tax businesses the way they were during Eisenhower's Presidency. Give us all medical care. Stop being so concerned with the welfare of the world and as much as anything stop lining your and your friends pockets with our money. <br/><br/>Stupid? Shortsighted? Selfish? How about real?", "userURL": "NULL", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "createDate": "1459270671", "commentID": 18043069, "userID": 53616761, "recommendations": 51, "reportAbuseFlag": null, "recommendedFlag": null, "commentSequence": 18043069}], "totalEditorsSelectionReturned": 13, "replyLimit": 3, "totalRecommendationsReturned": 13, "page": 1, "callerID": null, "totalReporterReplyCommentsReturned": 0, "filter": "highlights", "totalCommentsFound": 600, "api_timestamp": "1488822331", "totalReplyCommentsFound": 205, "totalCommentsReturned": 13, "sort": "highlights", "totalReporterReplyCommentsFound": 0}, "debug": {"version": 3.1}}